[
  {
    "name": "Biomedical Informatics on the Cloud: A Treasure Hunt for Advancing Cardiovascular Medicine",
    "url": "https://www.ahajournals.org/doi/full/10.1161/CIRCRESAHA.117.310967",
    "description": "An overview of how BioIE and bioinformatics workflows can be applied to questions in cardiovascular health and medicine research."
  },
  {
    "name": "Clinical information extraction applications: A literature review",
    "url": "https://www.sciencedirect.com/science/article/pii/S1532046417302563",
    "description": "A review of clinical IE papers published as of September 2016. From Mayo Clinic group (see below)."
  },
  {
    "name": "Literature Based Discovery: Models, methods, and trends",
    "url": "https://www.sciencedirect.com/science/article/pii/S1532046417301909",
    "description": "A review of Literature Based Discovery (LBD), or the philosophy that meaningful connections may be found between seemingly unrelated scientific literature."
  },
  {
    "name": "For some historical context on LBD, see papers by University of Chicago's Don Swanson and Neil Smalheiser, including Undiscovered Public Knowledge (paywalled) and Rediscovering Don Swanson: the Past, Present and Future of Literature-Based Discovery.",
    "url": "https://www.jstor.org/stable/4307965"
  },
  {
    "name": "Mining Electronic Health Records (EHRs): A Survey",
    "url": "https://arxiv.org/abs/1702.03222",
    "description": "A review of the methods and philosophy behind mining electronic health records, including using them for adverse event detection. See Table 2 for a list of relevant papers as of mid-2017."
  },
  {
    "name": "Capturing the Patient's Perspective: a Review of Advances in Natural Language Processing of Health-Related Text",
    "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6250990/",
    "description": "A 2017 review of natural language processing methods applied to information extraction in health records and social media text. An important note from this review: \"One of the main challenges in the field is the availability of data that can be shared and which can be used by the community to push the development of methods based on comparable and reproducible studies\"."
  },
  {
    "name": "Boston Children's Hospital Natural Language Processing Laboratory",
    "url": "http://www.childrenshospital.org/research/labs/natural-language-processing-laboratory",
    "description": "Led by Dr. Guergana Savova, formerly at Mayo Clinic and the Apache cTAKES project."
  },
  {
    "name": "BD2K",
    "url": "https://commonfund.nih.gov/bd2k",
    "description": "The U.S. National Institutes of Health (NIH) funded 13 Centers of Excellence through their Big Data to Knowledge (BD2K) program, several of which developed tools and resources for BioIE."
  },
  {
    "name": "HeartBD2K",
    "url": "http://www.heartbd2k.org/",
    "description": "Based at University of California, Los Angeles (UCLA). Led by Dr. Peipei Ping."
  },
  {
    "name": "KnowEng",
    "url": "https://knoweng.org/about/people/",
    "description": "Based an University of Illinois at Urbana-Champaign (UIUC). Led by Dr. Jiawei Han."
  },
  {
    "name": "Mobilize",
    "url": "http://mobilize.stanford.edu/",
    "description": "Based at Stanford. Led by Dr. Scott Delp."
  },
  {
    "name": "Brown Center for Biomedical Informatics",
    "url": "https://www.brown.edu/academics/medical/about-us/research/centers-institutes-and-programs/biomedical-informatics/",
    "description": "Based at Brown University and directed by Dr. Neil Sarkar, whose research group works on topics in clinical NLP and IE."
  },
  {
    "name": "Center for Computational Pharmacology NLP Group",
    "url": "http://compbio.ucdenver.edu/Hunter_lab/CCP_website/index.html",
    "description": "based at University of Colorado, Denver and led by Larry Hunter - see their GitHub repos here."
  },
  {
    "name": "Demner-Fushman group at NLM",
    "url": "https://www.lhncbc.nlm.nih.gov/personnel/dina-demner-fushman"
  },
  {
    "name": "BioNLP group at NCBI",
    "url": "https://www.ncbi.nlm.nih.gov/research/bionlp/",
    "description": "Develops improvements to biomedical literature search and curation (e.g., through PubMed), led by Dr. Zhiyong Lu."
  },
  {
    "name": "JensenLab",
    "url": "https://jensenlab.org/",
    "description": "Based at the Novo Nordisk Foundation Center for Protein Research at the University of Copenhagen, Denmark."
  },
  {
    "name": "National Centre for Text Mining (NaCTeM)",
    "url": "http://www.nactem.ac.uk/",
    "description": "Based at the University of Manchester and led by Prof. Sophia Ananiadou, NaCTeM is concerned with text mining in general but has a particular focus on biomedical applications."
  },
  {
    "name": "Mayo Clinic's clinical natural language processing program",
    "url": "https://www.mayo.edu/research/departments-divisions/department-health-sciences-research/medical-informatics/projects",
    "description": "Several groups at Mayo Clinic have made major contributions to BioIE (for example, the Apache cTAKES platform) over the past 20 years."
  },
  {
    "name": "Monarch Initiative",
    "url": "https://monarchinitiative.org/",
    "description": "A joint effort between groups at Oregon State University, Oregon Health & Science University, Lawrence Berkeley National Lab, The Jackson Laboratory, and several others, seeking to \"integrate biological information using semantics, and present it in a novel way, leveraging phenotypes to bridge the knowledge gap\"."
  },
  {
    "name": "TurkuNLP",
    "url": "https://turkunlp.org/",
    "description": "Based at the University of Turku and concerned with NLP in general with a focus on BioNLP and clinical applications."
  },
  {
    "name": "UTHealth Houston Biomedical Natural Language Processing Lab",
    "url": "https://sbmi.uth.edu/nlp/",
    "description": "Based in the University of Texas Health Science Center at Houston, School of Biomedical Informatics and led by Dr. Hua Xu."
  },
  {
    "name": "VCU Natural Language Processing Lab",
    "url": "https://nlp.cs.vcu.edu/",
    "description": "Based at Virginia Commonwealth University and led by Dr. Bridget McInnes."
  },
  {
    "name": "Zaklab",
    "url": "http://zaklab.org",
    "description": "Group led by Dr. Isaac Kohane at Harvard Medical School's Department of Biomedical Informatics (Dr. Kohane is also a steward of the n2c2 (formerly i2b2) datasets - see Datasets below)."
  },
  {
    "name": "Columbia University Department of Biomedical Informatics",
    "url": "https://www.dbmi.columbia.edu/",
    "description": "Led by Drs. George Hripcsak and Noémie Elhadad."
  },
  {
    "name": "AMIA",
    "url": "https://www.amia.org/",
    "description": "Many—but certainly not all—individuals studying biomedical informatics are members of the American Medical Informatics Association. AMIA publishes a journal, JAMIA (see below)."
  },
  {
    "name": "IMIA",
    "url": "https://imia-medinfo.org/",
    "description": "The International Medical Informatics Association. Publishes the IMIA Yearbook of Medical Informatics."
  },
  {
    "name": "Database",
    "url": "https://academic.oup.com/database",
    "description": "Its subtitle is \"The Journal of Biological Databases and Curation\". Open access."
  },
  {
    "name": "NAR",
    "url": "https://academic.oup.com/nar",
    "description": "Nucleic Acids Research. Has a broad biomolecular focus but is particularly notable for its annual database issue."
  },
  {
    "name": "JAMIA",
    "url": "https://academic.oup.com/jamia",
    "description": "The Journal of the American Medical Informatics Association. Concerns \"articles in the areas of clinical care, clinical research, translational science, implementation science, imaging, education, consumer health, public health, and policy\"."
  },
  {
    "name": "JBI",
    "url": "https://www.sciencedirect.com/journal/journal-of-biomedical-informatics",
    "description": "The Journal of Biomedical Informatics. Not open access by default, though it does have an open-access \"X\" version."
  },
  {
    "name": "Scientific Data",
    "url": "https://www.nature.com/sdata/",
    "description": "An open-access Springer Nature journal publishing \"descriptions of scientifically valuable datasets, and research that advances the sharing and reuse of scientific data\"."
  },
  {
    "name": "ACM-BCB",
    "url": "http://acm-bcb.org/",
    "description": "The ACM Conference on Bioinformatics, Computational Biology, and Health Informatics. Held annually since 2010."
  },
  {
    "name": "BIBM",
    "url": "http://ieeebibm.org/BIBM2019/",
    "description": "The IEEE International Conference on Bioinformatics and Biomedicine."
  },
  {
    "name": "ISMB",
    "url": "https://www.iscb.org/about-ismb",
    "description": "The International Conference on Intelligent Systems for Molecular Biology is an annual conference hosted by the International Society for Computational Biology since 1993. Much of its focus has concerned bioinformatics and computational biology without an explicit clinical focus, though it has included an increasing amount of text mining content (e.g., the 2019 meeting included a full-day special session on Text Mining for Biology and Healthcare). The meeting is combined with that of the European Conference on Computational Biology (ECCB) on odd-numbered years."
  },
  {
    "name": "PSB",
    "url": "https://psb.stanford.edu/",
    "description": "The Pacific Symposium on Biocomputing."
  },
  {
    "name": "BioASQ",
    "url": "http://bioasq.org/",
    "description": "Challenges on biomedical semantic indexing and question answering. Challenges and workshops held annually since 2013."
  },
  {
    "name": "BioCreAtIvE workshop",
    "url": "https://biocreative.bioinformatics.udel.edu/",
    "description": "These workshops have been organized since 2004, with  BioCreative VI happening February 2017 and the BioCreative/OHNLP Challenge held in 2018. See Datasets below."
  },
  {
    "name": "SemEval workshop",
    "url": "http://alt.qcri.org/semeval2020/",
    "description": "Tasks and evaluations in computational semantic analysis. Tasks vary by year but frequently cover scientific and/or biomedical language, e.g. the SemEval-2019 Task 12 on Toponym Resolution in Scientific Papers."
  },
  {
    "name": "eHealth-KD",
    "url": "https://knowledge-learning.github.io/ehealthkd-2019/",
    "description": "Challenges for encouraging \"development of software technologies to automatically extract a large variety of knowledge from eHealth documents written in the Spanish Language\". Previously held as part of TASS, an annual workshop for semantic analysis in Spanish."
  },
  {
    "name": "EHR DREAM Challenge",
    "url": "https://www.synapse.org/#!Synapse:syn18405991/wiki/589657",
    "description": "Held along with several other more bioinformatics-focused challenges, this challenge opened in October 2019 and focuses on using electronic health record data to predict patient mortality. Uses a synthetic data set rather than real EHR contents."
  },
  {
    "name": "Getting Started in Text Mining",
    "url": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.0040020",
    "description": "A brief introduction to bio-text mining from Cohen and Hunter. More than ten years old but still quite relevant. See also an earlier paper by the same authors."
  },
  {
    "name": "Biomedical Literature Mining",
    "url": "https://link.springer.com/book/10.1007/978-1-4939-0709-0",
    "description": "A (non-free) volume of Methods in Molecular Biology from 2014. Chapters covers introductory principles in text mining, applications in the biological sciences, and potential for use in clinical or medical safety scenarios."
  },
  {
    "name": "Coursera",
    "url": "https://www.coursera.org/learn/mining-medical-data",
    "description": "Foundations of mining non-structured medical data - About three hours worth of video lectures on working with medical data of various types and structures, including text and image data. Appears fairly high-level and intended for beginners."
  },
  {
    "name": "JensenLab text mining exercises",
    "url": "https://jensenlab.org/training/textmining/"
  },
  {
    "name": "VIB text mining and curation training",
    "url": "https://www.bits.vib.be/training-list/111-bits/training/previous-trainings/183-text-mining",
    "description": "This training workshop happenened in 2013 but the slides are still online."
  },
  {
    "name": "Biopython",
    "url": "https://biopython.org/",
    "description": "paper - code - Python tools primarily intended for bioinformatics and computational molecular biology purposes, but also a convenient way to obtain data, including documents/abstracts from PubMed (see Chapter 9 of the documentation)."
  },
  {
    "name": "Bio-SCoRes",
    "url": "https://github.com/kilicogluh/Bio-SCoRes",
    "description": "paper - A framework for biomedical coreference resolution."
  },
  {
    "name": "medaCy",
    "url": "https://github.com/NLPatVCU/medaCy",
    "description": "A system for building predictive medical natural language processing models. Built on the spaCy framework."
  },
  {
    "name": "ScispaCy",
    "url": "https://github.com/allenai/SciSpaCy",
    "description": "paper - A version of the spaCy framework for scientific and biomedical documents."
  },
  {
    "name": "rentrez",
    "url": "https://github.com/ropensci/rentrez",
    "description": "R utilities for accessing NCBI resources, including PubMed."
  },
  {
    "name": "Med7",
    "url": "https://medium.com/@kormilitzin/med7-clinical-information-extraction-system-in-python-and-spacy-5e6f68ab1c68",
    "description": "paper - code - a Python package and model (for use with spaCy) for doing NER with medication-related concepts."
  },
  {
    "name": "mimic-code",
    "url": "https://github.com/MIT-LCP/mimic-code",
    "description": "Code associated with the MIMIC-III dataset (see below). Includes some helpful tutorials."
  },
  {
    "name": "cTAKES",
    "url": "https://ctakes.apache.org/",
    "description": "paper - code - A system for processing the text in electronic medical records. Widely used and open source."
  },
  {
    "name": "CLAMP",
    "url": "https://clamp.uth.edu/",
    "description": "paper - A natural language processing toolkit intended for use with the text in clinical reports. Check out their live demo first to see what it does. Usable at no cost for academic research."
  },
  {
    "name": "DeepPhe",
    "url": "https://github.com/DeepPhe/DeepPhe-Release",
    "description": "A system for processing documents describing cancer presentations. Based on cTAKES (see above)."
  },
  {
    "name": "DNorm",
    "url": "https://www.ncbi.nlm.nih.gov/research/bionlp/Tools/dnorm/",
    "description": "paper - A method for disease normalization, i.e., linking mentions of disease names and acronyms to unique concept identifiers. Downloadable version includes the NCBI Disease Corpus and BC5CDR (see Annotated Text Data below)."
  },
  {
    "name": "PubTator Central",
    "url": "https://www.ncbi.nlm.nih.gov/research/pubtator/",
    "description": "paper - A web platform that identifies five different types of biomedical concepts in PubMed articles and PubMed Central full texts. The full annotation sets are downloadable (see Annotated Text Data below)."
  },
  {
    "name": "Pubrunner",
    "url": "https://github.com/jakelever/pubrunner",
    "description": "A framework for running text mining tools on the newest set(s) of documents from PubMed."
  },
  {
    "name": "SemEHR",
    "url": "https://github.com/CogStack/CogStack-SemEHR",
    "description": "paper - an IE infrastructure for electronic health records (EHR). Built on the CogStack project."
  },
  {
    "name": "TaggerOne",
    "url": "https://www.ncbi.nlm.nih.gov/research/bionlp/Tools/taggerone/",
    "description": "paper - Performs concept normalization (see also DNorm above). Can be trained for specific concept types and can perform NER independent of other normalization functions."
  },
  {
    "name": "TabInOut",
    "url": "https://github.com/nikolamilosevic86/TabInOut",
    "description": "paper - a framework for IE from tables in the literature."
  },
  {
    "name": "Anafora",
    "url": "https://github.com/weitechen/anafora",
    "description": "paper - An annotation tool with adjudication and progress tracking features."
  },
  {
    "name": "brat",
    "url": "https://brat.nlplab.org/",
    "description": "paper - code - The brat rapid annotation tool. Supports producing text annotations visually, through the browser. Not subject specific; appropriate for many annotation projects. Visualization is based on that of the stav tool."
  },
  {
    "name": "BioASQword2vec",
    "url": "http://bioasq.org/news/bioasq-releases-continuous-space-word-vectors-obtained-applying-word2vec-pubmed-abstracts",
    "description": "paper - Qord embeddings derived from biomedical text (>10 million PubMed abstracts) using the popular word2vec tool."
  },
  {
    "name": "BioWordVec",
    "url": "https://figshare.com/articles/Improving_Biomedical_Word_Embeddings_with_Subword_Information_and_MeSH_Ontology/6882647",
    "description": "paper - code - Word embeddings derived from biomedical text (>27 million PubMed titles and abstracts), including subword embedding model based on MeSH."
  },
  {
    "name": "BioBERT",
    "url": "https://github.com/naver/biobert-pretrained",
    "description": "paper - code - A PubMed and PubMed Central-trained version of the BERT language model."
  },
  {
    "name": "Alsentzer et al Clinical BERT",
    "url": "https://github.com/EmilyAlsentzer/clinicalBERT",
    "description": "paper"
  },
  {
    "name": "Huang et al ClinicalBERT",
    "url": "https://github.com/kexinhuang12345/clinicalBERT",
    "description": "paper"
  },
  {
    "name": "Flair embeddings from PubMed",
    "url": "https://github.com/zalandoresearch/flair/pull/519",
    "description": "A language model available through the Flair framework and embedding method. Trained over a 5% sample of PubMed abstracts until 2015, or > 1.2 million abstracts in total."
  },
  {
    "name": "SciBERT",
    "url": "https://github.com/allenai/scibert",
    "description": "paper - A BERT model trained on >1M papers from the Semantic Scholar database."
  },
  {
    "name": "BlueBERT",
    "url": "https://github.com/ncbi-nlp/bluebert",
    "description": "paper - A BERT model pre-trained on PubMed text and MIMIC-III notes."
  },
  {
    "name": "PubMedBERT",
    "url": "https://microsoft.github.io/BLURB/models.html",
    "description": "paper - A BERT model trained from scratch on PubMed, with versions trained on abstracts+full texts and on abstracts alone."
  },
  {
    "name": "OHSUMED",
    "url": "http://davis.wpi.edu/xmdv/datasets/ohsumed.html",
    "description": "paper - 348,566 MEDLINE entries (title and sometimes abstract) from between 1987 and 1991. Includes MeSH labels. Primarily of historical significance."
  },
  {
    "name": "PubMed Central Open Access Subset",
    "url": "https://www.ncbi.nlm.nih.gov/pmc/tools/openftlist/",
    "description": "A set of PubMed Central articles usable under licenses other than traditional copyright, though the exact licenses vary by publication and source. Articles are available as PDF and XML."
  },
  {
    "name": "CORD-19",
    "url": "https://pages.semanticscholar.org/coronavirus-research",
    "description": "A corpus of scholarly manuscripts concerning COVID-19. Articles are primarily from PubMed Central and preprint servers, though the set also includes metadata on papers without full-text availability."
  },
  {
    "name": "SPL-ADR-200db",
    "url": "https://bionlp.nlm.nih.gov/tac2017adversereactions/",
    "description": "paper - A pilot dataset containing standardised information, and annotations of occurence in text, about ~5,000 known adverse reactions for 200 FDA-approved drugs."
  },
  {
    "name": "BioCreAtIvE 1",
    "url": "https://sourceforge.net/projects/biocreative/files/",
    "description": "paper - 15,000 sentences (10,000 training and 5,000 test) annotated for protein and gene names. 1,000 full text biomedical research articles annotated with protein names and Gene Ontology terms."
  },
  {
    "name": "BioCreAtIvE 2",
    "url": "https://sourceforge.net/projects/biocreative/files/",
    "description": "paper - 15,000 sentences (10,000 training and 5,000 test, different from the first corpus) annotated for protein and gene names. 542 abstracts linked to EntrezGene identifiers. A variety of research articles annotated for features of protein–protein interactions."
  },
  {
    "name": "BioCreAtIvE V CDR Task Corpus (BC5CDR)",
    "url": "https://biocreative.bioinformatics.udel.edu/accounts/login/?next=/resources/corpora/biocreative-v-cdr-corpus/",
    "description": "paper - 1,500 articles (title and abstract) published in 2014 or later, annotated for 4,409 chemicals, 5,818 diseases and 3116 chemical–disease interactions. Requires registration."
  },
  {
    "name": "BioCreative VI CHEMPROT Corpus",
    "url": "https://biocreative.bioinformatics.udel.edu/resources/corpora/chemprot-corpus-biocreative-vi/#chemprot-corpus-biocreative-vi:downloads",
    "description": "paper - >2,400 articles annotated with chemical-protein interactions of a variety of relation types. Requires registration."
  },
  {
    "name": "CRAFT",
    "url": "https://github.com/UCDenver-ccp/CRAFT",
    "description": "paper - 67 full-text biomedical articles annotated in a variety of ways, including for concepts and coreferences. Now on version 3."
  },
  {
    "name": "n2c2 (formerly i2b2) Data",
    "url": "https://portal.dbmi.hms.harvard.edu/projects/n2c2-nlp/",
    "description": "The Department of Biomedical Informatics (DBMI) at Harvard Medical School manages data for the National NLP Clinical Challenges and the Informatics for Integrating Biology and the Bedside challenges running since 2006. They require registration before access and use. Datasets include a variety of topics. See the list of data challenges for individual descriptions."
  },
  {
    "name": "NCBI Disease Corpus",
    "url": "https://www.ncbi.nlm.nih.gov/CBBresearch/Dogan/DISEASE/",
    "description": "paper - A corpus of 793 biomedical abstracts annotated with names of diseases and related concepts from MeSH and OMIM."
  },
  {
    "name": "PubTator Central datasets",
    "url": "https://www.ncbi.nlm.nih.gov/research/pubtator/",
    "description": "paper - Accessible through a RESTful API or FTP download. Includes annotations for >29 million abstracts and ∼3 million full text documents."
  },
  {
    "name": "Word Sense Disambiguation (WSD)",
    "url": "https://wsd.nlm.nih.gov/",
    "description": "paper - 203 ambiguous words and 37,888 automatically extracted instances of their use in biomedical research publications. Requires UTS account."
  },
  {
    "name": "Clinical Questions Collection",
    "url": "https://www.nlm.nih.gov/databases/download/CQC.html",
    "description": "also known as CQC or the Iowa collection, these are several thousand questions posed by physicians during office visits along with the associated answers."
  },
  {
    "name": "BioNLP ST 2013 datasets",
    "url": "http://2013.bionlp-st.org/",
    "description": "data from six shared tasks, though some may not be easily accessible; try the CG task set (BioNLP2013CG) for extensive entity and event annotations."
  },
  {
    "name": "BioScope",
    "url": "https://rgai.inf.u-szeged.hu/node/105",
    "description": "paper - a corpus of sentences from medical and biological documents, annotated for negation, speculation, and linguistic scope."
  },
  {
    "name": "AIMed",
    "url": "http://corpora.informatik.hu-berlin.de/corpora/brat2bioc/aimed_bioc.xml.zip",
    "description": "paper - 225 MEDLINE abstracts annotated for PPI."
  },
  {
    "name": "BioC-BioGRID",
    "url": "http://bioc.sourceforge.net/BioC-BioGRID.html",
    "description": "paper - 120 full text articles annotated for PPI and genetic interactions. Used in the BioCreative V BioC task."
  },
  {
    "name": "BioInfer",
    "url": "http://corpora.informatik.hu-berlin.de/corpora/brat2bioc/bioinfer_bioc.xml.zip",
    "description": "paper - 1,100 sentences from biomedical research abstracts annotated for relationships (including PPI), named entities, and syntactic dependencies. Additional information and download links are here."
  },
  {
    "name": "HPRD50",
    "url": "http://corpora.informatik.hu-berlin.de/corpora/brat2bioc/hprd50_bioc.xml.zip",
    "description": "paper - 50 scientific abstracts referenced by the Human Protein Reference Database, annotated for PPI."
  },
  {
    "name": "IEPA",
    "url": "http://corpora.informatik.hu-berlin.de/corpora/brat2bioc/iepa_bioc.xml.zip",
    "description": "paper - 486 sentences from biomedical research abstracts annotated for pairs of co-occurring chemicals, including proteins (hence, PPI annotations)."
  },
  {
    "name": "LLL",
    "url": "http://corpora.informatik.hu-berlin.de/corpora/brat2bioc/lll_bioc.xml.zip",
    "description": "paper - 77 sentences from research articles about the bacterium Bacillus subtilis, annotated for protein–gene interactions (so, fairly close to PPI annotations). Additional information is here."
  },
  {
    "name": "Columbia Open Health Data",
    "url": "http://cohd.io",
    "description": "paper - A database of prevalence and co-occurrence frequencies of conditions, drugs, procedures, and patient demographics extracted from electronic health records. Does not include original record text."
  },
  {
    "name": "Comparative Toxicogenomics Database",
    "url": "https://ctdbase.org/",
    "description": "paper - A database of manually curated associations between chemicals, gene products, phenotypes, diseases, and environmental exposures. Useful for assembling ontologies of the related concepts, such as types of chemicals."
  },
  {
    "name": "MIMIC-III",
    "url": "https://mimic.physionet.org/",
    "description": "paper - Deidentified health data from ~60,000 intensive care unit admissions. Requires completion of an online training course (CITI training) and acceptance of a data use agreement prior to use."
  },
  {
    "name": "MIMIC-CXR",
    "url": "https://physionet.org/content/mimic-cxr/2.0.0/",
    "description": "The MIMIC Chest X-Ray database. Contains more than 377,000 radiographic images and accompanying free-text radiology reports. As with MIMIC-III, requires acceptance of a data use agreement."
  },
  {
    "name": "UMLS Knowledge Sources",
    "url": "https://www.nlm.nih.gov/research/umls/licensedcontent/umlsknowledgesources.html",
    "description": "reference manual - A large and comprehensive collection of biomedical terminology and identifiers, as well as accompanying tools and scripts. Depending on your purposes, the single file MRCONSO.RRF may be sufficient, as this file contains unique identifiers and names for all concepts in the UMLS Metathesaurus. See also the Ontologies and Controlled Vocabularies section below."
  },
  {
    "name": "MIMIC-IV",
    "url": "https://mimic-iv.mit.edu/",
    "description": "An update to MIMIC-III's multimodal patient data, now covering more recent years of admissions, plus a new data structure, emergency department records, and links to MIMIC-CXR images."
  },
  {
    "name": "eICU Collaborative Research Database",
    "url": "https://eicu-crd.mit.edu/",
    "description": "paper - a database of observations from more than 200 thousand intensive care unit admissions, with consistent structure. Requires registration, training course completion, and data use agreement."
  },
  {
    "name": "Disease Ontology",
    "url": "http://www.disease-ontology.org/",
    "description": "paper - An ontology of human diseases. Has cross-links to MeSH, ICD, NCI Thesaurus, SNOMED, and OMIM. Public domain. Available on GitHub and on the OBO Foundry."
  },
  {
    "name": "RxNorm",
    "url": "https://www.nlm.nih.gov/research/umls/rxnorm/index.html",
    "description": "paper - Normalized names for clinical drugs and drug packs, with combined ingredients, strengths, and form, and assigned types from the Semantic Network (see below). Released monthly."
  },
  {
    "name": "SPECIALIST Lexicon",
    "url": "https://lexsrv3.nlm.nih.gov/Specialist/Summary/lexicon.html",
    "description": "paper - A general English lexicon that includes many biomedical terms. Updated yearly since 1994 and still updated as of 2019. Part of UMLS but does not require UTS account to download."
  },
  {
    "name": "UMLS Metathesaurus",
    "url": "https://www.nlm.nih.gov/research/umls/knowledge_sources/metathesaurus/index.html",
    "description": "paper - Mappings between >3.8 million concepts, 14 million concept names, and >200 sources of biomedical vocabulary and identifiers. It's big. It may help to prepare a subset of the Metathesaurus with the MetamorphoSys installation tool but we're still talking about ~30 Gb of disk space required for the 2019 release. See the manual here. Requires UTS account."
  },
  {
    "name": "UMLS Semantic Network",
    "url": "https://semanticnetwork.nlm.nih.gov/",
    "description": "paper - Lists of 133 semantic types and 54 semantic relationships covering biomedical concepts and vocabulary. Is the Metathesaurus too complex for your needs? Try this. Does not require UTS account to download."
  },
  {
    "name": "Biolink",
    "url": "https://biolink.github.io/biolink-model/",
    "description": "code - A data model of biological entities. Provided as a YAML file."
  },
  {
    "name": "BioUML",
    "url": "http://wiki.biouml.org/index.php/BioUML",
    "description": "paper - An architecture for biomedical data analysis, integration, and visualization. Conceptually based on the visual modeling language UML."
  },
  {
    "name": "OMOP Common Data Model",
    "url": "https://github.com/OHDSI/CommonDataModel",
    "description": "a standard for observational healthcare data."
  }
]
