[
  {
    "name": "Broad Bioimage Benchmark Collection",
    "url": "https://data.broadinstitute.org/bbbc/",
    "description": "The Broad Bioimage Benchmark Collection (BBBC) is a collection of freely downloadable microscopy image sets. In addition to the images themselves, each set includes a description of the biological application and some type of \"ground truth\" (expected results)."
  },
  {
    "name": "Image Data Resource",
    "url": "https://idr.openmicroscopy.org/",
    "description": "Public repository of image datasets from published scientific studies."
  },
  {
    "name": "RxRx1",
    "url": "https://www.rxrx.ai/rxrx1",
    "description": "RxRx1 is a set of 125,514 high-resolution 512x512 6-channel fluorescence microscopy images of human cells under 1,108 genetic perturbations in 51 experimental batches across four cell types.  The images were produced by Recursion Pharmaceuticals in their labs in Salt Lake City, Utah.  Researchers will use this dataset for studying and benchmarking methods for dealing with biological batch effects, as well as areas in machine learning such as domain adaptation, transfer learning, and k-shot learning."
  },
  {
    "name": "RxRx19",
    "url": "https://www.rxrx.ai/rxrx19",
    "description": "RxRx19 is the first morphological dataset that demonstrates the rescue of morphological effects of COVID-19."
  },
  {
    "name": "Gustafsdottir et al. 2013",
    "url": "https://doi.org/10.1371/journal.pone.0080999",
    "description": "Cell painting profiles from 1,600 bioactive compounds in U2OS cells (Access from public S3 bucket: s3://cytodata/datasets/Bioactives-BBBC022-Gustafsdottir/profiles/Bioactives-BBBC022-Gustafsdottir/)."
  },
  {
    "name": "Wawer et al. 2014",
    "url": "https://doi.org/10.1073/pnas.1410933111",
    "description": "Cell painting profiles from 31,770 compounds in U2OS cells (Click to download)."
  },
  {
    "name": "Bray et al. 2017",
    "url": "https://doi.org/10.1093/gigascience/giw014",
    "description": "Cell painting profiles from 30,616 compounds in U2OS cells (Center Driven Research Project CDRP) (Download from GigaDB | Access from public S3 bucket: s3://cytodata/datasets/CDRPBIO-BBBC036-Bray/profiles_cp/CDRPBIO-BBBC036-Bray/)."
  },
  {
    "name": "Singh et al. 2015",
    "url": "https://doi.org/10.1371/journal.pone.0131370",
    "description": "3,072 cell painting profiles from 41 genes knocked down with RNA interference (RNAi) in U2OS cells (Access from GitHub)."
  },
  {
    "name": "Rohban et al. 2017",
    "url": "https://doi.org/10.7554/eLife.24060.001",
    "description": "Cell painting data from 220 overexpressed genes in U2OS cells (Access from public S3 bucket: s3://cytodata/datasets/TA-ORF-BBBC037-Rohban/profiles_cp/TA-ORF-BBBC037-Rohban/)."
  },
  {
    "name": "Unpublished",
    "url": "https://github.com/broadinstitute/cell-health/tree/master/0.generate-profiles/data/profiles",
    "description": "3,456 cell painting profiles from CRISPR experiments knocking down 59 genes in A549, ES2, and HCC44 cells (Access from GitHub)."
  },
  {
    "name": "Advanced Cell Classifier",
    "url": "https://www.cellclassifier.org/",
    "description": "A software package for exploration, annotation and classification of cells within large datasets using machine learning."
  },
  {
    "name": "CellProfiler",
    "url": "http://cellprofiler.org/",
    "description": "CellProfiler is a free open-source software for measuring and analyzing cell images."
  },
  {
    "name": "CellProfiler Analyst",
    "url": "http://cellprofiler.org/cp-analyst/",
    "description": "Interactive data exploration, analysis, and classification of large biological image sets."
  },
  {
    "name": "Cytominer",
    "url": "https://github.com/cytomining/cytominer",
    "description": "Methods for image-based cell profiling."
  },
  {
    "name": "EBImage",
    "url": "https://github.com/aoles/EBImage",
    "description": "Image processing toolbox for R."
  },
  {
    "name": "HTSvis",
    "url": "http://htsvis.dkfz.de/HTSvis/",
    "description": "A web app for exploratory data analysis and visualization of arrayed high-throughput screens."
  },
  {
    "name": "Image-based profiling for drug discovery: due for a machine-learning upgrade?",
    "url": "https://www.nature.com/articles/s41573-020-00117-w",
    "description": "2020 review of applications in image-based profiling from a Carpenter lab/pharma perspective."
  },
  {
    "name": "Data-analysis strategies for image-based cell profiling",
    "url": "https://doi.org/10.1038/nmeth.4397",
    "description": "Introduce the steps required to create high-quality image-based (i.e., morphological) profiles from a collection of microscopy images."
  },
  {
    "name": "High-content screening for quantitative cell biology",
    "url": "https://doi.org/10.1016/j.tcb.2016.03.008",
    "description": "Describe some recent applications of HCS, ranging from the identification of genes required for specific biological processes to the characterization of genetic interactions."
  },
  {
    "name": "Microscopy-based high-content screening",
    "url": "https://doi.org/10.1016/j.cell.2015.11.007",
    "description": "Describe the state of the art for image-based screening experiments and delineate experimental approaches and image-analysis approaches as well as discussing challenges and future directions, including leveraging CRISPR/Cas9-mediated genome engineering."
  },
  {
    "name": "Applications in image-based profiling of perturbations",
    "url": "https://doi.org/10.1016/j.copbio.2016.04.003",
    "description": "Describes applications of image-based profiling including target and MOA identification, lead hopping, library enrichment, gene annotation and identification of disease-specific phenotypes"
  },
  {
    "name": "Expanding the antibacterial selectivity of polyether ionophore antibiotics through diversity-focused semisynthesis",
    "url": "https://rdcu.be/ccBFH",
    "description": "Poulsen lab paper from 2020 where antibiotics are tested for their ability to leave mammalian cells as intact as possible, per the Cell Painting assay."
  },
  {
    "name": "Image-based multivariate profiling of drug responses from single cells",
    "url": "https://doi.org/10.1038/nmeth1032",
    "description": "A multivariate method for classifying untreated and treated human cancer cells based on ∼300 single-cell phenotypic measurements."
  },
  {
    "name": "Discovering metabolic disease gene interactions by correlated effects on cellular morphology",
    "url": "https://doi.org/10.1016/j.molmet.2019.03.001",
    "description": "Profiling disease-gene interaction during adipocyte differentiation."
  },
  {
    "name": "Phenotypic profiling of the human genome by time-lapse microscopy reveals cell division genes",
    "url": "https://doi.org/10.1038/nature08869",
    "description": "This study provides an in-depth analysis of cell division phenotypes and makes the entire high-content data set available as a resource to the community."
  },
  {
    "name": "Bioactivity screening of environmental chemicals using imaging-based high-throughput phenotypic profiling",
    "url": "https://doi.org/10.1016/j.taap.2019.114876",
    "description": "Use of image-based profiling to screen the bioactivity of environmental chemicals"
  },
  {
    "name": "Repurposing High-Throughput Image Assays Enables Biological Activity Prediction for Drug Discovery",
    "url": "https://doi.org/10.1016/j.chembiol.2018.01.015",
    "description": "Using image-based profiles to predict the bioactivity of small molecules in other unrelated assays."
  },
  {
    "name": "Tales of 1,008 Small Molecules: Phenomic Profiling through Live-cell Imaging in a Panel of Reporter Cell Lines",
    "url": "https://doi.org/10.1101/2020.03.13.990093",
    "description": "Demonstrating the effects of polypharmacology in MOA prediction while offering solutions for overcoming it in future image-based profiling studies."
  },
  {
    "name": "Cell Painting, a high-content image-based assay for morphological profiling using multiplexed fluorescent dyes",
    "url": "https://doi.org/10.1038/nprot.2016.105",
    "description": "Protocol describing the design and execution of experiments using Cell Painting."
  },
  {
    "name": "Multiplex Cytological Profiling Assay to Measure Diverse Cellular States",
    "url": "https://doi.org/10.1371/journal.pone.0080999",
    "description": "Cell Painting assay."
  },
  {
    "name": "CIDRE: an illumination-correction method for optical microscopy",
    "url": "https://doi.org/10.1038/nmeth.3323",
    "description": "Retrospective method for illumination-correction based on energy minimization."
  },
  {
    "name": "Retrospective shading correction based entropy minimization",
    "url": "https://doi.org/10.1046/j.1365-2818.2000.00669.x",
    "description": "Method for retrospective shading correction based on entropy minimization."
  },
  {
    "name": "Capturing single-cell heterogeneity via data fusion improves image-based profiling",
    "url": "https://doi.org/10.1038/s41467-019-10154-8",
    "description": "Adds dispersion and covariances to population averages to capture single-cell heterogeneity."
  },
  {
    "name": "Minimum redundancy feature selection from microarray gene expression data",
    "url": "https://doi.org/10.1142/S0219720005001004",
    "description": "Minimum redundancy - maximum relevance feature selection framework."
  },
  {
    "name": "Learning unsupervised feature representations for single cell microscopy images with paired cell painting",
    "url": "https://doi.org/10.1101/395954",
    "description": "Selfsupervised method to learn feature representations of single cells in microscopy images without labelled training data."
  },
  {
    "name": "Weakly supervised learning of single-cell feature embeddings",
    "url": "https://doi.org/10.1109/CVPR.2018.00970",
    "description": "Training CNNs using a weakly supervised approach for feature learning."
  },
  {
    "name": "Accurate Prediction of Biological Assays with High-Throughput Microscopy Images and Convolutional Networks",
    "url": "https://doi.org/10.1021/acs.jcim.8b00670",
    "description": "End-to-end learning with CNNs to predict bioactivity of small molecules in unrelated assays using image-based profiles."
  },
  {
    "name": "Evaluation of Deep Learning Strategies for Nucleus Segmentation in Fluorescence Images",
    "url": "https://doi.org/10.1002/cyto.a.23863",
    "description": "Comparing several deep learning methods for nuclear segmentation."
  },
  {
    "name": "Automating Morphological Profiling with Generic Deep Convolutional Networks",
    "url": "https://doi.org/10.1101/085118",
    "description": "Transfer of activation features of generic CNNs to extract features for image-based profiling."
  }
]
