[
  {
    "name": "Introduction To NoSQL",
    "url": "https://www.youtube.com/watch?v=qI_g07C_Q5I",
    "description": "Martin Fowler (54:52) - Talk given at GOTO 2012 as a great introduction to NoSQL databases, the types of NoSQL databases, their history, pros and cons, and how and when to use them."
  },
  {
    "name": "NoSQL Distilled",
    "url": "https://martinfowler.com/books/nosql.html",
    "description": "Very digestable and affordable book describing the different NoSQL databases and help you make the decision on whether using a NoSQL database is appropriate for your project."
  },
  {
    "name": "Seven Databases in Song (1:43)",
    "url": "https://www.youtube.com/watch?v=jyx8iP5tfCI",
    "description": "Fun song from 2012 about seven (six are NoSQL) databases with a very condensed overview of how they each work."
  },
  {
    "name": "NoSQL Databases: a Survey and Decision Guidance (2016)",
    "url": "https://medium.baqend.com/nosql-databases-a-survey-and-decision-guidance-ea7823a822d",
    "description": "\"This NoSQL Toolbox allows us to derive a simple decision tree to help practitioners and researchers filter potential system candidates based on central application requirements\"."
  },
  {
    "name": "Data Management in the Cloud: Limitations and Opportunities (PDF)",
    "url": "http://www.cs.umd.edu/~abadi/papers/abadi-cloud-ieee09.pdf",
    "description": "Abadi (2009) discusses limitations and opportunities of data management and data analysis in the cloud."
  },
  {
    "name": "10 NoSQL Misconceptions",
    "url": "https://www.dummies.com/programming/big-data/10-nosql-misconceptions/",
    "description": "Some misconceptions about NoSQL databases relating to topics such as what they are, ACID-compliance, and security."
  },
  {
    "name": "10 Reasons Developers Love NoSQL",
    "url": "https://www.dummies.com/programming/big-data/10-reasons-developers-love-nosql/",
    "description": "A list of ten arguments for why developers like to use NoSQL databases."
  },
  {
    "name": "Distribution, Data, Deployment: Software Architecture Convergence in Big Data Systems (PDF)",
    "url": "https://resources.sei.cmu.edu/library/asset-view.cfm?assetID=90909",
    "description": "Gorton and Klein (2014) paper to discuss software engineering concerns when dealing with big data systems in terms of distribution, data, and deployment. Also accessible here."
  },
  {
    "name": "Use cases for NoSQL (2017)",
    "url": "https://stackoverflow.com/questions/2875432/use-cases-for-nosql",
    "description": "Discussion on Stack Overflow on best use cases for using NoSQL databases over traditional SQL databases."
  },
  {
    "name": "Best Practices for NoSQL Database Design (2012)",
    "url": "https://softwareengineering.stackexchange.com/q/158790/",
    "description": "A couple answers and links for NoSQL database design."
  },
  {
    "name": "Five Common Data Stores and When to Use Them (2019)",
    "url": "https://shopify.engineering/five-common-data-stores-usage",
    "description": "Article describes five common data stores (relational database, non-relational (“NoSQL”) database, key-value store, full-text search engine, message queue) and their attributes."
  },
  {
    "name": "NoSQL Databases (PDF)",
    "url": "https://web.archive.org/web/20190927222738/https://www.christof-strauch.de/nosqldbs.pdf",
    "description": "A 149-page document outlining motives and rationale for NoSQL databases, and common concepts, techniques and patterns among these databases; last updated around 2011."
  },
  {
    "name": "NoSQL Data Architecture & Data Governance: Everything You Need to Know (2018)",
    "url": "https://www.dataversity.net/nosql-data-architecture-data-governance-everything-need-know/",
    "description": "Overview of different NoSQL database architectures with diagrams."
  },
  {
    "name": "NoSQL vs SQL: Demystifying NoSQL Databases (2019)",
    "url": "https://build5nines.com/nosql-vs-sql-demystifying-nosql-databases/",
    "description": "General overview and examples of NoSQL database schema types, while covering CAP theorem tradeoffs."
  },
  {
    "name": "Comparing Database Types: How Database Types Evolved to Meet Different Needs",
    "url": "https://www.prisma.io/dataguide/intro/comparing-database-types",
    "description": "Good overview of databases in general and how NoSQL database types differ and can be useful."
  },
  {
    "name": "The NoSQL Ecosystem",
    "url": "https://www.aosabook.org/en/nosql.html",
    "description": "A chapter written by Adam Marcus from \"The Architecture of Open Source Applications\" book, this chapter is geared more towards systems architects needing to learn more in-depth understanding of how these systems are built."
  },
  {
    "name": "What is NoSQL",
    "url": "https://aws.amazon.com/nosql/",
    "description": "Amazon AWS - Great high-level overview of NoSQL databases and how they compare to SQL database technologies and terminologies.  Serves as landing page for Amazon's AWS services for NoSQL options of key-value (Amazon DynamoDB), document (Amazon DocumentDB), graph (Amazon Neptune), in-memory (Amazon ElastiCache), and search-engine (Amazon Elasticsearch) database."
  },
  {
    "name": "SQL vs. NoSQL Databases: What's the Difference (2019)",
    "url": "https://www.upwork.com/resources/sql-vs-nosql-databases-whats-the-difference",
    "description": "Upwork - Explanation comparing SQL and NoSQL databases, along with giving some advice on what database solution is right for your use case."
  },
  {
    "name": "Structure Your Database",
    "url": "https://firebase.google.com/docs/database/android/structure-data",
    "description": "Best practices (as of 2018) of structuring your data if your database uses JSON."
  },
  {
    "name": "NoSQL Data Modeling Techniques (2012)",
    "url": "https://highlyscalable.wordpress.com/2012/03/01/nosql-data-modeling-techniques/",
    "description": "This article provides a short comparison of NoSQL system families from the data modeling point of view and digests several common modeling techniques."
  },
  {
    "name": "Data Models for MongoDB",
    "url": "https://docs.mongodb.com/manual/data-modeling/",
    "description": "Data modeling help specific to MongoDB, ranging from schema validation and example patterns. However, concepts may carry over to other document NoSQL databases."
  },
  {
    "name": "Data Models Will Be Beautiful Again (2016)",
    "url": "https://tdwi.org/articles/2016/11/22/data-models-will-be-beautiful-again.aspx",
    "description": "Essay argues that despite existing schema-less databases, thoughtful database modeling is important to gain knowledge and insights using algorithms."
  },
  {
    "name": "Unified Data Modeling for Relational and NoSQL Databases",
    "url": "https://www.infoq.com/articles/unified-data-modeling-for-relational-and-nosql-databases/",
    "description": "Solution for managing both NoSQL and relational databases using the Unified Data Modeling technique."
  },
  {
    "name": "Unifying Relational, Document, Graph, and Temporal Data Models",
    "url": "https://fauna.com/blog/unifying-relational-document-graph-and-temporal-data-models",
    "description": "Patterns for querying across multiple paradigms in the same database."
  },
  {
    "name": "How to Design Schema for Your NoSQL Database?",
    "url": "https://www.dataversity.net/how-to-design-schema-for-your-nosql-database/#",
    "description": "Despite popular belief that NoSQL are schema-less, this article outlines how NoSQL databases follow \"query driven design\" and considerations for this flexibility in schema."
  },
  {
    "name": "Visual Guide to NoSQL Systems (2010)",
    "url": "http://blog.nahurst.com/visual-guide-to-nosql-systems",
    "description": "Visual display of trade-offs in the CAP theorem among different NoSQL databases."
  },
  {
    "name": "How to Choose the Right NoSQL Database for Your Application? (2018)",
    "url": "https://www.dataversity.net/choose-right-nosql-database-application/",
    "description": "Reviews CAP theorem and maps common NoSQL databases to CAP categories to help choose one."
  },
  {
    "name": "/r/nosql",
    "url": "https://www.reddit.com/r/nosql/",
    "description": "Reddit page on NoSQL on general questions and discussions people may have about NoSQL databases."
  },
  {
    "name": "[nosql] tag on Stack Overflow",
    "url": "https://stackoverflow.com/tags/nosql/info"
  },
  {
    "name": "Ask HN: Learning NoSQL, papers and books (2017)",
    "url": "https://news.ycombinator.com/item?id=15427932",
    "description": "\"In your opinion, which papers and books are mandatory to really understand NoSQL subject?\""
  },
  {
    "name": "Difference between scaling horizontally and vertically for databases",
    "url": "https://stackoverflow.com/q/11707879/6873133",
    "description": "Common terms talked about in the database world and here are answers from others."
  },
  {
    "name": "NoSQL",
    "url": "https://en.wikipedia.org/wiki/NoSQL",
    "description": "Wikipedia - Wikipedia entry on all things NoSQL databases."
  },
  {
    "name": "Graph Databases Use Cases",
    "url": "https://neo4j.com/use-cases/",
    "description": "Although documents geared towards Neo4j, concepts are applicable to all graph databases."
  },
  {
    "name": "How the ICIJ Used Neo4j to Unravel the Panama Papers",
    "url": "https://www.youtube.com/watch?v=S20XMQyvANY",
    "description": "Mar Cabra (32:02) - Learn how graph databases were key to explore who were the main names connected to companies in tax havens, including 140 politicians in more than 50 countries."
  },
  {
    "name": "Graph Databases for Beginners: The Basics of Data Modeling",
    "url": "https://neo4j.com/blog/data-modeling-basics/",
    "description": "Discusses the basics of modeling your data and which approach you should take."
  },
  {
    "name": "Graph Data Modeling Guidelines",
    "url": "https://neo4j.com/developer/guide-data-modeling/",
    "description": "Directly related to Neo4j, but possibly applicable to any graph database."
  },
  {
    "name": "Graph Data Modeling Visualize Structure and Meaning",
    "url": "http://www.graphdatamodeling.com",
    "description": "Brief introduction to graph data modeling and is an introduction to the book \"Graph Data Modeling for NoSQL and SQL\" by Thomas Frisendal."
  },
  {
    "name": "Addressing the NoSQL Criticism (2011)",
    "url": "https://www.bradley-holt.com/2011/07/addressing-the-nosql-criticism/",
    "description": "Argues against nine criticisms to NoSQL databases as they apply to CouchDB, but may apply to others as well."
  },
  {
    "name": "Thank You for Your Help NoSQL, but We Got It from Here (2020)",
    "url": "https://web.archive.org/web/20200913032621/https://www.memsql.com/blog/why-nosql-databases-wrong-tool-for-modern-application/",
    "description": "Argument that NoSQL databases have pushed the evolution of databases given the problem of scaling, but now NewSQL has addressed those concerns (from the perspective of MemSQL)."
  },
  {
    "name": "The Five Stages of NoSQL (2016)",
    "url": "https://sookocheff.com/post/opinion/the-five-stages-of-nosql/",
    "description": "Stages of going through picking and using a NoSQL database mirroring the five stages of grief."
  },
  {
    "name": "The Biggest Challenges of Moving to NoSQL (2017)",
    "url": "https://dzone.com/articles/the-biggest-challenges-of-moving-to-nosql",
    "description": "Speed and scalability and developer joy have been the gains found from enduring through challenges of moving to NoSQL."
  },
  {
    "name": "What is a NoSQL Database? Learn By Writing One In Python",
    "url": "https://web.archive.org/web/20201109032031/https://jeffknupp.com/blog/2014/09/01/what-is-a-nosql-database-learn-by-writing-one-in-python/",
    "description": "Excellent tutorial in learning NoSQL vs RDBMS through building a toy database using Python."
  },
  {
    "name": "Dynamo vs Cassandra : Systems Design of NoSQL Databases",
    "url": "https://sujithjay.com/data-systems/dynamo-cassandra/",
    "description": "Blog post comparing and constrating system designs of two well known NoSQL databases."
  },
  {
    "name": "Why you should build your own NoSQL database",
    "url": "https://medium.com/@marceloboeira/why-you-should-build-your-own-nosql-database-9bbba42039f5",
    "description": "Brief overview of NoSQL databases and the spectrum of schema, along with a very basic implementation of a NoSQL database using the Crystal programming language."
  },
  {
    "name": "PostgreSQL, the NoSQL Database (2015)",
    "url": "https://www.linuxjournal.com/content/postgresql-nosql-database",
    "description": "An argument for PostgreSQL being an alternative to NoSQL databases with NoSQL-like features using its new features like HStore (key-value store) and JSONB (document-based) as of Version 9.4."
  }
]
