[
  {
    "name": "CS50’s Intro to Artificial Intelligence",
    "url": "https://cs50.harvard.edu/ai/2020",
    "description": "This course explores the concepts and algorithms at the foundation of modern artificial intelligence"
  },
  {
    "name": "MIT: Intro to Deep Learning",
    "url": "https://introtodeeplearning.com",
    "description": "A seven day bootcamp designed in MIT to introduce deep learning methods and applications"
  },
  {
    "name": "Deep Blueberry: Deep Learning book",
    "url": "https://mithi.github.io/deep-blueberry",
    "description": "A free five-weekend plan to self-learners to learn the basics of deep-learning architectures like CNNs, LSTMs, RNNs, VAEs, GANs, DQN, A3C and more"
  },
  {
    "name": "Spinning Up in Deep Reinforcement Learning",
    "url": "https://spinningup.openai.com/",
    "description": "A free deep reinforcement learning course by OpenAI"
  },
  {
    "name": "MIT Artifical Intelligence Videos",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-034-artificial-intelligence-fall-2010/lecture-videos",
    "description": "MIT AI Course"
  },
  {
    "name": "Grokking Deep Learning in Motion",
    "url": "https://www.manning.com/livevideo/grokking-deep-learning-in-motion?a_aid=algmotion&a_bid=5d7bc0ba",
    "description": "Beginner's course to learn deep learning and neural networks without frameworks."
  },
  {
    "name": "Intro to Artificial Intelligence",
    "url": "https://www.udacity.com/course/cs271",
    "description": "Learn the Fundamentals of AI. Course run by Peter Norvig"
  },
  {
    "name": "EdX Artificial Intelligence",
    "url": "https://www.edx.org/course/artificial-intelligence-uc-berkeleyx-cs188-1x-0#.VMeIsmSsVkg",
    "description": "The course will introduce the basic ideas and techniques underlying the design of intelligent computer systems"
  },
  {
    "name": "Artificial Intelligence For Robotics",
    "url": "https://www.class-central.com/mooc/319/udacity-artificial-intelligence-for-robotics",
    "description": "This class will teach you basic methods in Artificial Intelligence, including: probabilistic inference, planning and search, localization, tracking and control, all with a focus on robotics"
  },
  {
    "name": "Machine Learning",
    "url": "https://class.coursera.org/ml-008",
    "description": "Basic machine learning algorithms for supervised and unsupervised learning"
  },
  {
    "name": "Deep Learning",
    "url": "https://www.udacity.com/course/intro-to-tensorflow-for-deep-learning--ud187",
    "description": "An Introductory course to the world of Deep Learning using TensorFlow."
  },
  {
    "name": "Stanford Statistical Learning",
    "url": "http://online.stanford.edu/course/statistical-learning-winter-2014",
    "description": "Introductory course on machine learning focusing on: linear and polynomial regression, logistic regression and linear discriminant analysis; cross-validation and the bootstrap, model selection and regularization methods (ridge and lasso); nonlinear models, splines and generalized additive models; tree-based methods, random forests and boosting; support-vector machines."
  },
  {
    "name": "Knowledge Based Artificial Intelligence",
    "url": "https://www.udacity.com/course/knowledge-based-ai-cognitive-systems--ud409",
    "description": "Georgia Tech's course on Artificial Intelligence focussing on Symbolic AI."
  },
  {
    "name": "Deep RL Bootcamp Lectures",
    "url": "https://sites.google.com/view/deep-rl-bootcamp/lectures",
    "description": "Deep Reinforcement Bootcamp Lectures - August 2017"
  },
  {
    "name": "Machine Learning Crash Course By Google Machine Learning Crash Course features a series of lessons with video lectures, real-world case studies, and hands-on practice exercises.",
    "url": "https://developers.google.com/machine-learning/crash-course/ml-intro"
  },
  {
    "name": "Python Class By Google This is a free class for people with a little bit of programming experience who want to learn Python. The class includes written materials, lecture videos, and lots of code exercises to practice Python coding.",
    "url": "https://developers.google.com/edu/python/"
  },
  {
    "name": "Deep Learning Crash Course In this liveVideo course, machine learning expert Oliver Zeigermann teaches you the basics of deep learning.",
    "url": "https://www.manning.com/livevideo/deep-learning-crash-course"
  },
  {
    "name": "Artificial Intelligence: A Modern Approach",
    "url": "http://www.amazon.com/Artificial-Intelligence-Modern-Approach-3rd/dp/0136042597",
    "description": "Stuart Russell & Peter Norvig"
  },
  {
    "name": "Also consider browsing the list of recommended reading, divided by each chapter in \"Artificial Intelligence: A Modern Approach\".",
    "url": "http://aima.cs.berkeley.edu/books.html"
  },
  {
    "name": "Paradigms Of Artificial Intelligence Programming: Case Studies in Common Lisp",
    "url": "http://www.amazon.com/exec/obidos/ASIN/1558601910",
    "description": "Paradigms of AI Programming is the first text to teach advanced Common Lisp techniques in the context of building major AI systems"
  },
  {
    "name": "Reinforcement Learning: An Introduction",
    "url": "http://www.freetechbooks.com/reinforcement-learning-an-introduction-second-edition-draft-t1282.html",
    "description": "This introductory textbook on reinforcement learning is targeted toward engineers and scientists in artificial intelligence, operations research, neural networks, and control systems, and we hope it will also be of interest to psychologists and neuroscientists."
  },
  {
    "name": "The Cambridge Handbook Of Artificial Intelligence",
    "url": "http://www.amazon.com/Cambridge-Handbook-Artificial-Intelligence/dp/0521691915",
    "description": "Written for non-specialists, it covers the discipline's foundations, major theories, and principal research areas, plus related topics such as artificial life"
  },
  {
    "name": "The Emotion Machine: Commonsense Thinking, Artificial Intelligence, and the Future of the Human Mind ",
    "url": "http://www.amazon.com/gp/product/0743276647",
    "description": "In this mind-expanding book, scientific pioneer Marvin Minsky continues his groundbreaking research, offering a fascinating new model for how our minds work"
  },
  {
    "name": "Artificial Intelligence: A New Synthesis",
    "url": "http://www.amazon.com/Artificial-Intelligence-Synthesis-Nils-Nilsson/dp/1558604677",
    "description": "Beginning with elementary reactive agents, Nilsson gradually increases their cognitive horsepower to illustrate the most important and lasting ideas in AI"
  },
  {
    "name": "On Intelligence",
    "url": "http://www.amazon.com/Jeff-Hawkins/e/B001KHNZ7C/ref=sr_ntt_srch_lnk_11?qid=1435480927&sr=8-11",
    "description": "Hawkins develops a powerful theory of how the human brain works, explaining why computers are not intelligent and how, based on this new theory, we can finally build intelligent machines. Also audio version available from audible.com"
  },
  {
    "name": "How To Create A Mind",
    "url": "http://www.amazon.com/How-Create-Mind-Thought-Revealed/dp/0143124048/ref=pd_sim_14_3?ie=UTF8&refRID=0QY72H7NGRYH79R7S3K7",
    "description": "Kurzweil discusses how the brain works, how the mind emerges, brain-computer interfaces, and the implications of vastly increasing the powers of our intelligence to address the world’s problems"
  },
  {
    "name": "Deep Learning",
    "url": "http://www.deeplearningbook.org/",
    "description": "Goodfellow, Bengio and Courville's introduction to a broad range of topics in deep learning, covering mathematical and conceptual background, deep learning techniques used in industry, and research perspectives."
  },
  {
    "name": "The Elements of Statistical Learning: Data Mining, Inference, and Prediction",
    "url": "https://web.stanford.edu/~hastie/ElemStatLearn/",
    "description": "Hastie and Tibshirani cover a broad range of topics, from supervised learning (prediction) to unsupervised learning including neural networks, support vector machines, classification trees and boosting---the first comprehensive treatment of this topic in any book."
  },
  {
    "name": "Deep Learning and the Game of Go",
    "url": "https://www.manning.com/books/deep-learning-and-the-game-of-go",
    "description": "Deep Learning and the Game of Go teaches you how to apply the power of deep learning to complex human-flavored reasoning tasks by building a Go-playing AI. After exposing you to the foundations of machine and deep learning, you'll use Python to build a bot and then teach it the rules of the game."
  },
  {
    "name": "Deep Learning for Search",
    "url": "https://www.manning.com/books/deep-learning-for-search",
    "description": " Deep Learning for Search teaches you how to leverage neural networks, NLP, and deep learning techniques to improve search performance."
  },
  {
    "name": "Deep Learning with PyTorch",
    "url": "https://www.manning.com/books/deep-learning-with-pytorch",
    "description": " PyTorch puts these superpowers in your hands, providing a comfortable Python experience that gets you started quickly and then grows with you as you—and your deep learning skills—become more sophisticated. Deep Learning with PyTorch will make that journey engaging and fun."
  },
  {
    "name": "Deep Reinforcement Learning in Action",
    "url": "https://www.manning.com/books/deep-reinforcement-learning-in-action",
    "description": " Deep Reinforcement Learning in Action teaches you the fundamental concepts and terminology of deep reinforcement learning, along with the practical skills and techniques you’ll need to implement it into your own projects."
  },
  {
    "name": "Grokking Deep Reinforcement Learning",
    "url": "https://www.manning.com/books/grokking-deep-reinforcement-learning",
    "description": " Grokking Deep Reinforcement Learning introduces this powerful machine learning approach, using examples, illustrations, exercises, and crystal-clear teaching."
  },
  {
    "name": "Fusion in Action",
    "url": "https://www.manning.com/books/fusion-in-action",
    "description": " Fusion in Action teaches you to build a full-featured data analytics pipeline, including document and data search and distributed data clustering."
  },
  {
    "name": "Real-World Natural Language Processing",
    "url": "https://www.manning.com/books/real-world-natural-language-processing",
    "description": "Early access book on how to create practical NLP applications using Python."
  },
  {
    "name": "Grokking Machine Learning",
    "url": "https://www.manning.com/books/grokking-machine-learning",
    "description": "Early access book that introduces the most valuable machine learning techniques."
  },
  {
    "name": "Succeeding with AI",
    "url": "https://www.manning.com/books/succeeding-with-ai",
    "description": "An introduction to managing successful AI projects and applying AI to real-life situations."
  },
  {
    "name": "Elements of AI (Part 1)",
    "url": "https://www.elementsofai.com/",
    "description": "Reaktor/University of Helsinki - An Introduction to AI is a free online course for everyone interested in learning what AI is, what is possible (and not possible) with AI, and how it affects our lives – with no complicated math or programming required."
  },
  {
    "name": "Essential Natural Language Processing",
    "url": "https://www.manning.com/books/essential-natural-language-processing",
    "description": "A hands-on guide to NLP with practical techniques, numerous Python-based examples and real-world case studies."
  },
  {
    "name": "Kaggle's micro courses",
    "url": "https://www.kaggle.com/learn/overview",
    "description": "A series of micro courses by offering practical and hands-on knowledge ranging from Python to Deep Learning."
  },
  {
    "name": "Transfer Learning for Natural Language Processing",
    "url": "https://www.manning.com/books/transfer-learning-for-natural-language-processing?utm_source=github&utm_medium=organic&utm_campaign=book_azunre_transfer_3_10_20",
    "description": "A book that gets you up to speed with the relevant ML concepts and then dives into transfer learning for NLP."
  },
  {
    "name": "(Stanford Deep Learning Series][https://www.youtube.com/playlist?list=PLoROMvodv4rOABXSygHTsbvUz4G_YQhOb]",
    "url": "https://www.youtube.com/playlist?list=PLoROMvodv4rOABXSygHTsbvUz4G_YQhOb"
  },
  {
    "name": "Amazon Machine Learning Developer Guide",
    "url": "https://docs.aws.amazon.com/machine-learning/latest/dg/machinelearning-dg.pdf",
    "description": "A book for ML developers which itroduces the ML concepts & strategies with lots of practical usages."
  },
  {
    "name": "Machine Learning for Humans",
    "url": "https://medium.com/machine-learning-for-humans/why-machine-learning-matters-6164faf1df12",
    "description": "A series of simple, plain-English explanations accompanied by math, code, and real-world examples."
  },
  {
    "name": "Machine Learning for Mortals (Mere and Otherwise)",
    "url": "https://www.manning.com/books/machine-learning-for-mortals-mere-and-otherwise",
    "description": "Early access book that provides basics of machine learning and using R programming language."
  },
  {
    "name": "How Machine Learning Works",
    "url": "https://livebook.manning.com/book/how-machine-learning-works/welcome/v-5",
    "description": "Mostafa Samir. Early access book that introduces machine learning from both practical and theoretical aspects in a non-threating way."
  },
  {
    "name": "MachineLearningWithTensorFlow2ed",
    "url": "https://www.manning.com/books/machine-learning-with-tensorflow-second-edition",
    "description": "a book on general purpose machine learning techniques regression, classification, unsupervised clustering, reinforcement learning, auto encoders, convolutional neural networks, RNNs, LSTMs, using TensorFlow 1.14.1."
  },
  {
    "name": "Serverless Machine Learning",
    "url": "https://www.manning.com/books/serverless-machine-learning-in-action",
    "description": "a book for machine learning engineers on how to train and deploy machine learning systems on public clouds like AWS, Azure, and GCP, using a code-oriented approach."
  },
  {
    "name": "The Hundred-Page Machine Learning Book",
    "url": "http://themlbook.com/",
    "description": "all you need to know about Machine Learning in a hundred pages, supervised and unsupervised learning, SVM, neural networks, ensemble methods, gradient descent, cluster analysis and dimensionality reduction, autoencoders and transfer learning, feature engineering and hyperparameter tuning."
  },
  {
    "name": "Trust in Machine Learning",
    "url": "https://www.manning.com/books/trust-in-machine-learning",
    "description": "a book for experienced data scientists and machine learning engineers on how to make your AI a trustworthy partner. Build machine learning systems that are explainable, robust, transparent, and optimized for fairness."
  },
  {
    "name": "Prolog Programming For Artificial Intelligence",
    "url": "http://www.amazon.com/Programming-Artificial-Intelligence-International-Computer/dp/0321417461",
    "description": "This best-selling guide to Prolog and Artificial Intelligence concentrates on the art of using the basic mechanisms of Prolog to solve interesting AI problems."
  },
  {
    "name": "AI Algorithms, Data Structures and Idioms in Prolog, Lisp and Java",
    "url": "http://www.amazon.co.uk/Algorithms-Data-Structures-Idioms-Prolog/dp/0136070477",
    "description": "PDF here"
  },
  {
    "name": "Python Tools for Machine Learning",
    "url": "https://www.cbinsights.com/blog/python-tools-machine-learning/"
  },
  {
    "name": "Python for Artificial Intelligence",
    "url": "https://wiki.python.org/moin/PythonForArtificialIntelligence"
  },
  {
    "name": "Super Intelligence",
    "url": "http://www.audible.co.uk/pd/Non-fiction/Superintelligence-Audiobook/B00LPMA33G",
    "description": "Superintelligence asks the questions: What happens when machines surpass humans in general intelligence. A really great book."
  },
  {
    "name": "Our Final Invention: Artificial Intelligence And The End Of The Human Era",
    "url": "http://www.audible.co.uk/pd/Non-fiction/Our-Final-Invention-Audiobook/B00KLJMDH8",
    "description": "Our Final Invention explores the perils of the heedless pursuit of advanced AI. Until now, human intelligence has had no rival. Can we coexist with beings whose intelligence dwarfs our own? And will they allow us to?"
  },
  {
    "name": "How to Create a Mind: The Secret of Human Thought Revealed",
    "url": "http://www.audible.com/pd/Science-Technology/How-to-Create-a-Mind-Audiobook/B009S7OKJS/ref=a_search_c4_1_1_srTtl?qid=1422483493&sr=1-1",
    "description": "Ray Kurzweil, director of engineering at Google, explored the process of reverse-engineering the brain to understand precisely how it works, then applies that knowledge to create vastly intelligent machines."
  },
  {
    "name": "Minds, Brains, And Programs",
    "url": "http://cogprints.org/7150/1/10.1.1.83.5248.pdf",
    "description": "The 1980 paper by philospher John Searle that contains the famous 'Chinese Room' thought experiment. Probably the most famous attack on the notion of a Strong AI possessing a 'mind' or a 'consciousness', and interesting reading for those interested in the intersection of AI and philosophy of mind."
  },
  {
    "name": "Gödel, Escher, Bach: An Eternal Golden Braid",
    "url": "http://www.amazon.com/G%C3%B6del-Escher-Bach-Eternal-Golden/dp/0465026567",
    "description": "Written by Douglas Hofstadter and taglined \"a metaphorical fugue on minds and machines in the spirit of Lewis Carroll\", this wonderful journey into the the fundamental concepts of mathematics,symmetry and intelligence won a Pulitzer Price for Non-Fiction in 1979. A major theme throughout is the emergence of meaning from seemingly 'meaningless' elements, like 1's and 0's, arranged in special patterns."
  },
  {
    "name": "Life 3.0: Being Human in the Age of Artificial Intelligence",
    "url": "https://www.goodreads.com/book/show/34272565-life-3-0",
    "description": "Max Tegmark, professor of Physics at MIT, discusses how Artificial Intelligence may affect crime, war, justice, jobs, society and our very sense of being human both in the near and far future."
  },
  {
    "name": "Foundations Of Computational Agents",
    "url": "http://artint.info/html/ArtInt.html",
    "description": "This book is published by Cambridge University Press, 2010"
  },
  {
    "name": "The Quest For Artificial Intelligence",
    "url": "http://ai.stanford.edu/~nilsson/QAI/qai.pdf",
    "description": "This book traces the history of the subject, from the early dreams of eighteenth-century (and earlier) pioneers to the more successful work of today's AI engineers."
  },
  {
    "name": "Stanford CS229",
    "url": "https://see.stanford.edu/Course/CS229",
    "description": "Machine Learning - This course provides a broad introduction to machine learning and statistical pattern recognition."
  },
  {
    "name": "Computers and Thought: A practical Introduction to Artificial Intelligence",
    "url": "http://www.cs.bham.ac.uk/research/projects/poplog/computers-and-thought/",
    "description": "The book covers computer simulation of human activities, such as problem solving and natural language understanding; computer vision; AI tools and techniques; an introduction to AI programming; symbolic and neural network models of cognition; the nature of mind and intelligence; and the social implications of AI and cognitive science."
  },
  {
    "name": "Society of Mind",
    "url": "http://aurellem.org/society-of-mind/index.html",
    "description": "Marvin Minsky's seminal work on how our mind works. Lot of Symbolic AI concepts have been derived from this basis."
  },
  {
    "name": "Artificial Intelligence and Molecular Biology",
    "url": "https://web.archive.org/web/20060627060706/http://www.biosino.org/mirror/www.aaai.org/Press/Books/Hunter/hunter-contents.html",
    "description": "The current volume is an effort to bridge that range of exploration, from nucleotide to abstract concept, in contemporary AI/MB research."
  },
  {
    "name": "Brief Introduction To Educational Implications Of Artificial Intelligence",
    "url": "http://pages.uoregon.edu/moursund/Books/AIBook/index.htm",
    "description": "This book is designed to help preservice and inservice teachers learn about some of the educational implications of current uses of Artificial Intelligence as an aid to solving problems and accomplishing tasks."
  },
  {
    "name": "Encyclopedia: Computational intelligence",
    "url": "http://www.scholarpedia.org/article/Encyclopedia:Computational_intelligence",
    "description": "Scholarpedia is a peer-reviewed open-access encyclopedia written and maintained by scholarly experts from around the world."
  },
  {
    "name": "Ethical Artificial Intelligence",
    "url": "http://arxiv.org/abs/1411.1373",
    "description": "a book by Bill Hibbard that combines several peer reviewed papers and new material to analyze the issues of ethical artificial intelligence."
  },
  {
    "name": "Golden Artificial Intelligence",
    "url": "https://golden.com/wiki/Cluster%3A_Artificial_intelligence",
    "description": "a cluster of pages on artificial intelligence and machine learning."
  },
  {
    "name": "R2D3",
    "url": "http://www.r2d3.us/",
    "description": "A website with explanations on topics from Machine Learning to Statistics. All helped with beautiful animated infographics and real life examples. Available in various languages."
  },
  {
    "name": "Modeling Agents with Probabilistic Programs",
    "url": "https://agentmodels.org/",
    "description": "This book describes and implements models of rational agents for (PO)MDPs and Reinforcement Learning."
  },
  {
    "name": "ExplainX- ExplainX is a fast, light-weight, and scalable explainable AI framework for data scientists to explain any black-box model to business stakeholders.",
    "url": "https://github.com/explainX/explainx"
  },
  {
    "name": "AIMACode",
    "url": "https://github.com/aimacode",
    "description": "Source code for \"Artificial Intelligence: A Modern Approach\" in Common Lisp, Java, Python. More to come."
  },
  {
    "name": "FANN",
    "url": "http://leenissen.dk/fann/wp/",
    "description": "Fast Artificial Neural Network Library, native for C"
  },
  {
    "name": "FARGonautica",
    "url": "https://github.com/Alex-Linhares/FARGonautica",
    "description": "Source code of Douglas Hosftadter's Fluid Concepts and Creative Analogies Ph.D. projects."
  },
  {
    "name": "A tutorial on Deep Learning",
    "url": "http://videolectures.net/jul09_hinton_deeplearn"
  },
  {
    "name": "Basics of Computational Reinforcement Learning",
    "url": "http://videolectures.net/rldm2015_littman_computational_reinforcement"
  },
  {
    "name": "Deep Reinforcement Learning",
    "url": "http://videolectures.net/rldm2015_silver_reinforcement_learning"
  },
  {
    "name": "Intelligent agents and paradigms for AI",
    "url": "https://youtu.be/7o2GzSj86e8?t=3457"
  },
  {
    "name": "The Unreasonable Effectiveness Of Deep Learning",
    "url": "https://www.youtube.com/watch?v=sc-KbuZqGkI",
    "description": "The Director of Facebook's AI Research, Dr. Yann LeCun gives a talk on deep convolutional neural networks and their applications to machine learning and computer vision"
  },
  {
    "name": "AWS Machine Learning in Motion- This interactive liveVideo course gives you a crash course in using AWS for machine learning, teaching you how to build a fully-working predictive algorithm.",
    "url": "https://www.manning.com/livevideo/aws-machine-learning-in-motion"
  },
  {
    "name": "Deep Learning with R in Motion-Deep Learning with R in Motion teaches you to apply deep learning to text and images using the powerful Keras library and its R language interface.",
    "url": "https://www.manning.com/livevideo/deep-learning-with-r-in-motion"
  },
  {
    "name": "Grokking Deep Learning in Motion-Grokking Deep Learning in Motion will not just teach you how to use a single library or framework, you’ll actually discover how to build these algorithms completely from scratch!",
    "url": "https://www.manning.com/livevideo/grokking-deep-learning-in-motion"
  },
  {
    "name": "Reinforcement Learning in Motion",
    "url": "https://www.manning.com/livevideo/reinforcement-learning-in-motion",
    "description": "This liveVideo breaks down key concepts like how RL systems learn, how to sense and process environmental data, and how to build and train AI agents."
  },
  {
    "name": "Deep Learning. Methods And Applications Free book from Microsoft Research",
    "url": "http://research.microsoft.com/pubs/209355/DeepLearning-NowPublishing-Vol7-SIG-039.pdf"
  },
  {
    "name": "Neural Networks And Deep Learning",
    "url": "http://neuralnetworksanddeeplearning.com",
    "description": "Neural networks and deep learning currently provide the best solutions to many problems in image recognition, speech recognition, and natural language processing. This book will teach you the core concepts behind neural networks and deep learning"
  },
  {
    "name": "Machine Learning: A Probabilistic Perspective",
    "url": "http://www.amazon.com/Machine-Learning-Probabilistic-Perspective-Computation/dp/0262018020",
    "description": "This textbook offers a comprehensive and self-contained introduction to the field of machine learning, based on a unified, probabilistic approach"
  },
  {
    "name": "Deep Learning",
    "url": "https://www.deeplearningbook.org",
    "description": "Yoshua Bengio, Ian Goodfellow and Aaron Courville put together this currently free (and draft version) book on deep learning.  The book is kept up-to-date and covers a wide range of topics in depth (up to and including sequence-to-sequence learning)."
  },
  {
    "name": "Getting Started with Deep Learning and Python",
    "url": "http://www.pyimagesearch.com/2014/09/22/getting-started-deep-learning-python/"
  },
  {
    "name": "Machine Learning Mastery",
    "url": "http://machinelearningmastery.com/"
  },
  {
    "name": "Deep Learning.net",
    "url": "https://web.archive.org/web/20201114013453/http://deeplearning.net/",
    "description": "Aggregation site for DL resources"
  },
  {
    "name": "Awesome Machine Learning",
    "url": "https://github.com/josephmisiti/awesome-machine-learning",
    "description": "Like this Github, but ML-focused"
  },
  {
    "name": "FastML",
    "url": "http://fastml.com/"
  },
  {
    "name": "Awesome Deep Learning Resources",
    "url": "https://github.com/guillaume-chevalier/awesome-deep-learning-resources",
    "description": "Rough list of learning resources for Deep Learning"
  },
  {
    "name": "Professional and In-Depth Machine Learning Video Courses",
    "url": "https://freecoursesite.com/?s=Machine+Learning+Data+Science",
    "description": "A collection of free professional and in depth Machine Learning and Data Science video tutorials and courses"
  },
  {
    "name": "Professional and In-Depth Artificial Intelligence Video Courses",
    "url": "https://freecoursesite.com/?s=Artificial+Intelligence",
    "description": "A collection of free professional and in depth Artificial Intelligence video tutorials and courses"
  },
  {
    "name": "Professional and In-Depth Deep Learning Video Courses",
    "url": "https://freecoursesite.com/?s=Deep+Learning",
    "description": "A collection of free professional and in depth Deep Learning video tutorials and courses"
  },
  {
    "name": "Introduction to Machine Learning",
    "url": "https://developers.google.com/machine-learning/crash-course/ml-intro",
    "description": "Introductory level machine learning crash course"
  },
  {
    "name": "Awesome Graph Classification",
    "url": "https://github.com/benedekrozemberczki/awesome-graph-classification",
    "description": "Learning from graph stuctured data"
  },
  {
    "name": "Awesome Community Detection",
    "url": "https://github.com/benedekrozemberczki/awesome-community-detection",
    "description": "Clustering graph structured data"
  },
  {
    "name": "Awesome Decision Tree Papers",
    "url": "https://github.com/benedekrozemberczki/awesome-decision-tree-papers",
    "description": "Decision tree papers from machine learning conferences"
  },
  {
    "name": "Awesome Gradient Boosting Papers",
    "url": "https://github.com/benedekrozemberczki/awesome-gradient-boosting-papers",
    "description": "Gradient boosting papers from machine learning conferences"
  },
  {
    "name": "Awesome Fraud Detection Papers",
    "url": "https://github.com/benedekrozemberczki/awesome-fraud-detection-papers",
    "description": "Fraud detection papers from machine learning conferences"
  },
  {
    "name": "Awesome Neural Art",
    "url": "https://github.com/crypdick/awesome-neural-art",
    "description": "Creating art and manipulating images using deep neural networks."
  },
  {
    "name": "IEEE Computational Intelligence Society",
    "url": "http://cis.ieee.org/"
  },
  {
    "name": "Machine Intelligence Research Institute",
    "url": "https://intelligence.org/research-guide/"
  },
  {
    "name": "OpenAI",
    "url": "https://openai.com/about/"
  },
  {
    "name": "Association For The Advancement of Artificial Intelligence",
    "url": "http://www.aaai.org/home.html"
  },
  {
    "name": "Google DeepMind Research",
    "url": "https://deepmind.com/research/"
  },
  {
    "name": "Nvidia Deep Learning",
    "url": "https://developer.nvidia.com/deep-learning"
  },
  {
    "name": "AI Google",
    "url": "https://ai.google/"
  },
  {
    "name": "Facebook AI",
    "url": "https://ai.facebook.com"
  },
  {
    "name": "IBM Research",
    "url": "https://www.research.ibm.com/artificial-intelligence"
  },
  {
    "name": "Microsoft Research",
    "url": "https://www.microsoft.com/en-us/research/research-area/artificial-intelligence/"
  },
  {
    "name": "AI & Society",
    "url": "http://www.springer.com/journal/146"
  },
  {
    "name": "AI Communications",
    "url": "http://iospress.metapress.com/openurl.asp?genre=journal&issn=0921-7126"
  },
  {
    "name": "AI Magazine",
    "url": "http://www.aaai.org/Magazine/magazine.php"
  },
  {
    "name": "Annals of Mathematics and Artifical Intelligence",
    "url": "http://www.springer.com/journal/10472"
  },
  {
    "name": "Applicable Algebra in Engineering, Communication and Computing",
    "url": "http://www.springer.com/journal/200"
  },
  {
    "name": "Applied Artificial Intelligence",
    "url": "https://www.tandfonline.com/toc/uaai20/current"
  },
  {
    "name": "Applied Intelligence",
    "url": "http://www.springer.com/journal/10489"
  },
  {
    "name": "Artificial Intelligence for Engineering Design, Analysis and Manufacturing",
    "url": "http://journals.cambridge.org/action/displayJournal?jid=AIE"
  },
  {
    "name": "Artificial Intelligence Review",
    "url": "http://www.springer.com/journal/10462"
  },
  {
    "name": "Artificial Intelligence",
    "url": "http://www.elsevier.com/locate/artint"
  },
  {
    "name": "Automated Software Engineering",
    "url": "http://www.springer.com/journal/10515"
  },
  {
    "name": "Autonomous Agents and Multi-Agent Systems",
    "url": "http://www.springer.com/journal/10458"
  },
  {
    "name": "Computational and Mathematical Organization Theory ",
    "url": "http://www.springer.com/journal/10588"
  },
  {
    "name": "Computational Intelligence",
    "url": "http://www.blackwellpublishing.com/content/BPL_Images/New_Journal_Samples/coin0824-7935~17~4/C.PDF"
  },
  {
    "name": "Electronic Transactions on Artificial Intelligence",
    "url": "https://dblp.org/db/journals/etai/index.html"
  },
  {
    "name": "Evolutionary Intelligence",
    "url": "http://www.springer.com/journal/12065"
  },
  {
    "name": "EXPERT—IEEE Intelligent Systems",
    "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9670"
  },
  {
    "name": "IEEE Transactions Automation Science and Engineering",
    "url": "http://www.ieee-ras.org/publications/t-ase"
  },
  {
    "name": "Intelligent Industrial Systems",
    "url": "http://www.springer.com/engineering/robotics/journal/40903"
  },
  {
    "name": "International Journal of Intelligent Systems",
    "url": "https://onlinelibrary.wiley.com/journal/1098111x"
  },
  {
    "name": "International Journal on Artificial Intelligence Tools",
    "url": "https://www.worldscientific.com/worldscinet/ijait"
  },
  {
    "name": "Journal of Artificial Intelligence Research",
    "url": "http://www.cs.washington.edu/research/"
  },
  {
    "name": "Journal of Automated Reasoning",
    "url": "http://www.springer.com/journal/10817"
  },
  {
    "name": "Journal of Experimental and Theoretical Artificial Intelligence ",
    "url": "https://www.tandfonline.com/toc/teta20/current"
  },
  {
    "name": "Journal of Intelligent Information Systems ",
    "url": "http://www.springer.com/journal/10844"
  },
  {
    "name": "Journal on Data Semantics ",
    "url": "http://www.springer.com/journal/13740"
  },
  {
    "name": "Knowledge Engineering Review",
    "url": "http://journals.cambridge.org/action/displayJournal?jid=KER"
  },
  {
    "name": "Minds and Machines",
    "url": "http://www.springer.com/journal/11023"
  },
  {
    "name": "Progress in Artificial Intelligence ",
    "url": "http://www.springer.com/journal/13748"
  },
  {
    "name": "MIT Battlecode",
    "url": "https://www.battlecode.org/"
  },
  {
    "name": "AI Challenge",
    "url": "http://aichallenge.org"
  },
  {
    "name": "AI Games",
    "url": "http://theaigames.com"
  },
  {
    "name": "AI Digest. A weekly newsletter to keep up to date with AI, machine learning, and data science. Archive.",
    "url": "https://aidigest.net/"
  },
  {
    "name": "Open Cognition Project",
    "url": "http://wiki.opencog.org/w/The_Open_Cognition_Project",
    "description": "We're undertaking a serious effort to build a thinking machine"
  },
  {
    "name": "AITopics",
    "url": "http://aitopics.org/",
    "description": "Large aggregation of AI resources"
  },
  {
    "name": "AIResources",
    "url": "http://airesources.org/",
    "description": "Directory of open source software and open access data for the AI research community"
  },
  {
    "name": "Artificial Intelligence Subreddit",
    "url": "https://www.reddit.com/r/artificial/"
  },
  {
    "name": "AI Experiments with Google",
    "url": "https://experiments.withgoogle.com/collection/ai"
  }
]
