[
  {
    "name": "Cinnamon",
    "url": "http://cinnamon.linuxmint.com/",
    "description": "Cinnamon strives to provide a traditional user experience. Cinnamon is a fork of GNOME 3."
  },
  {
    "name": "EDE",
    "url": "http://www.equinox-project.org/",
    "description": "EDE is a small desktop environment built to be responsive, light in resource usage and to have a familiar look and feel."
  },
  {
    "name": "Enlightenment",
    "url": "https://www.enlightenment.org/",
    "description": "The Enlightenment desktop shell provides an efficient window manager based on the Enlightenment Foundation Libraries along with other essential desktop components like a file manager, desktop icons and widgets. It supports themes, while still being capable of performing on older hardware or embedded devices."
  },
  {
    "name": "LXQt",
    "url": "http://lxqt.org/",
    "description": "LXQt is the Qt port and the upcoming version of LXDE, the Lightweight Desktop Environment. It is the product of the merge between the LXDE-Qt and the Razor-qt projects: A lightweight, modular, blazing-fast and user-friendly desktop environment."
  },
  {
    "name": "MATE",
    "url": "http://www.mate-desktop.org/",
    "description": "Mate provides an intuitive and attractive desktop to Linux users using traditional metaphors. MATE is a fork of GNOME 2."
  },
  {
    "name": "Pantheon",
    "url": "https://elementary.io",
    "description": "Pantheon is the default desktop environment originally created for the elementary OS distribution. It is written from scratch using Vala and the GTK3 toolkit. With regards to usability and appearance, the desktop has some similarities with GNOME Shell and Mac OS X."
  },
  {
    "name": "Unity",
    "url": "http://unity.ubuntu.com/",
    "description": "Unity is a shell for GNOME designed by Canonical for Ubuntu."
  },
  {
    "name": "9wm",
    "url": "http://unauthorised.org/dhog/9wm.html",
    "description": "9wm is an X window manager which attempts to emulate the Plan 9 window manager 8-1/2 as far as possible within the constraints imposed by X."
  },
  {
    "name": "awesome",
    "url": "http://awesome.naquadah.org/",
    "description": "awesome is a highly configurable, next generation framework window manager for X. It is very fast, extensible and licensed under the GNU GPLv2 license."
  },
  {
    "name": "Blackbox",
    "url": "http://blackboxwm.sourceforge.net/",
    "description": "Blackbox is the fast, lightweight window manager for the X Window System you have been looking for, without all those annoying library dependencies. Blackbox is built with C++ and contains completely original code (even though the graphics implementation is similar to that of WindowMaker)."
  },
  {
    "name": "bspwm",
    "url": "https://github.com/baskerville/bspwm",
    "description": "bspwm is a tiling window manager that represents windows as the leaves of a full binary tree."
  },
  {
    "name": "Compiz",
    "url": "https://launchpad.net/compiz",
    "description": "OpenGL compositing window manager. It has a plug-in system to be changed at runtime"
  },
  {
    "name": "dwm",
    "url": "http://dwm.suckless.org/",
    "description": "dwm is a dynamic window manager for X. It manages windows in tiled, monocle and floating layouts. All of the layouts can be applied dynamically, optimising the environment for the application in use and the task performed."
  },
  {
    "name": "Enlightenment",
    "url": "http://www.enlightenment.org/",
    "description": "Enlightenment is not just a window manager for Linux/X11 and others, but also a whole suite of libraries to help you create beautiful user interfaces with much less work than doing it the old fashioned way and fighting with traditional toolkits, not to mention a traditional window manager"
  },
  {
    "name": "Fluxbox",
    "url": "http://www.fluxbox.org/",
    "description": "Fluxbox is a windowmanager for X that was based on the Blackbox 0.61.1 code. It is very light on resources and easy to handle but yet full of features to make an easy, and extremely fast, desktop experience. It is built using C++ and licensed under the MIT-License."
  },
  {
    "name": "FVWM",
    "url": "http://fvwm.org/",
    "description": "FVWM is an extremely powerful ICCCM-compliant multiple virtual desktop window manager for the X  Window system"
  },
  {
    "name": "i3",
    "url": "http://i3wm.org/",
    "description": "i3 is a tiling window manager, completely written from scratch. The target platforms are GNU/Linux and BSD operating systems, our code is Free and Open Source Software (FOSS) under the BSD license. i3 is primarily targeted at advanced users and developers."
  },
  {
    "name": "IceWM",
    "url": "http://www.icewm.org/",
    "description": "IceWM is a window manager for the X Window System (freedesktop, XFree86). The goal of IceWM is speed, simplicity, and not getting in the user's way."
  },
  {
    "name": "JWM",
    "url": "http://www.joewing.net/projects/jwm/",
    "description": "JWM is a light-weight window manager for the X11 Window System. JWM is written in C and uses only Xlib at a minimum. Because of its small footprint, JWM makes a good window manager for older computers and less powerful systems, such as the Raspberry Pi, though it is perfectly capable of running on modern systems."
  },
  {
    "name": "Matchbox",
    "url": "https://www.yoctoproject.org/tools-resources/projects/matchbox",
    "description": "Matchbox is an Open Source base environment for the X Window System running on non-desktop embedded platforms such as handhelds, set-top boxes, kiosks and anything else for which screen space, input mechanisms or system resources are limited."
  },
  {
    "name": "Mutter",
    "url": "https://download.gnome.org/sources/mutter/",
    "description": "Mutter is a window manager for the X Window System, and is in the process of becoming a Wayland compositor; it became the default window manager in GNOME 3, replacing Metacity."
  },
  {
    "name": "Openbox",
    "url": "http://openbox.org/wiki/Main_Page",
    "description": "Openbox is a highly configurable, next generation window manager with extensive standards support."
  },
  {
    "name": "pekwm",
    "url": "https://www.pekwm.org/projects/pekwm/",
    "description": "pekwm is a window manager that once upon a time was based on the aewm++ window manager, but it has evolved enough that it no longer resembles aewm++ at all."
  },
  {
    "name": "ratpoison",
    "url": "http://www.nongnu.org/ratpoison/",
    "description": "Ratpoison is a simple Window Manager with no fat library dependencies, no fancy graphics, no window decorations, and no rodent dependence. It is largely modelled after GNU Screen which has done wonders in the virtual terminal market."
  },
  {
    "name": "Sawfish",
    "url": "http://sawfish.tuxfamily.org/",
    "description": "Sawfish is an extensible window manager using a Lisp-based scripting language. Its policy is very minimal compared to most window managers. Its aim is simply to manage windows in the most flexible and attractive manner possible."
  },
  {
    "name": "wmii",
    "url": "https://code.google.com/p/wmii/",
    "description": "A small, scriptable window manager, with a 9P filesystem interface and an acme-like layout."
  },
  {
    "name": "xmonad",
    "url": "http://xmonad.org/",
    "description": "xmonad is a dynamically tiling X11 window manager that is written and configured in Haskell. In a normal WM, you spend half your time aligning and searching for windows. xmonad makes work easier, by automating this."
  },
  {
    "name": "cmus",
    "url": "https://cmus.github.io/",
    "description": "Small, fast and powerful console music player for Unix-like operating systems."
  },
  {
    "name": "fuck",
    "url": "https://github.com/nvbn/thefuck",
    "description": "A magnificent command line tool which corrects your previously mistyped command (see this .gif)."
  },
  {
    "name": "git",
    "url": "https://git-scm.com/",
    "description": " Git is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency. Git is easy to learn and has a tiny footprint with lightning fast performance. It outclasses SCM tools like Subversion, CVS, Perforce, and ClearCase with features like cheap local branching, convenient staging areas, and multiple workflows."
  },
  {
    "name": "glances",
    "url": "https://nicolargo.github.io/glances/",
    "description": "cross-platform curses-based system monitoring tool written in Python."
  },
  {
    "name": "htop",
    "url": "http://hisham.hm/htop/",
    "description": "nice looking, customizable TUI task manager."
  },
  {
    "name": "nano",
    "url": "http://www.nano-editor.org",
    "description": "GNU nano (or nano) is a text editor which aims to introduce a simple interface and intuitive command options to console based text editing. nano supports features including colorized syntax highlighting, DOS/Mac file type conversions, spellchecking and UTF-8 encoding. nano opened with an empty buffer typically occupies under 1.5 MB of resident memory."
  },
  {
    "name": "photorec",
    "url": "http://www.cgsecurity.org/wiki/PhotoRec",
    "description": "recover deleted files"
  },
  {
    "name": "screenFetch",
    "url": "https://github.com/KittyKatt/screenFetch",
    "description": "Fetches system/theme information in terminal for Linux desktop screenshots."
  },
  {
    "name": "speed-test",
    "url": "https://github.com/sindresorhus/speed-test",
    "description": "Test your Internet connection speed and ping using speedtest.net from the CLI."
  },
  {
    "name": "testdisk",
    "url": "http://www.cgsecurity.org/wiki/TestDisk",
    "description": "recover lost partitions"
  },
  {
    "name": "tig",
    "url": "http://jonas.nitro.dk/tig/",
    "description": "Tig is an ncurses-based text-mode interface for git. It functions mainly as a Git repository browser, but can also assist in staging changes for commit at chunk level and act as a pager for output from various Git commands."
  },
  {
    "name": "vim",
    "url": "http://vim.org",
    "description": "Vim is an advanced text editor that seeks to provide the power of the de-facto Unix editor 'Vi', with a more complete feature set."
  },
  {
    "name": "vtop",
    "url": "https://parall.ax/vtop",
    "description": "Command-line tools like “top” make it difficult to see CPU usage across multi-process applications (like Apache and Chrome), spikes over time, and memory usage. Vtop is a free and open source activity monitor for the command line. It’s written in node.js and can be easily extended."
  },
  {
    "name": "wavemon",
    "url": "https://github.com/uoaerg/wavemon",
    "description": "ncurses-based monitoring application for wireless network devices"
  },
  {
    "name": "Geany",
    "url": "http://geany.org",
    "description": "really small GTK IDE and versatile text editor, extendable with plugins."
  },
  {
    "name": "Gedit",
    "url": "https://wiki.gnome.org/Apps/Gedit",
    "description": "Gedit is the GNOME text editor. While aiming at simplicity and ease of use, gedit is a powerful general purpose text editor."
  },
  {
    "name": "Gnome Builder",
    "url": "https://wiki.gnome.org/Apps/Builder",
    "description": "Builder is a new IDE for GNOME that is focused on bringing the power of our platform to more developers than ever before. It is currently under heavy development and needs your help to become a success."
  },
  {
    "name": "GParted",
    "url": "http://gparted.sourceforge.net/",
    "description": "GParted is the most popular partitioning software out there and many Linux distributions have it installed by default."
  },
  {
    "name": "Zathura",
    "url": "https://pwmt.org/projects/zathura/",
    "description": "Zathura is a highly customizable and functional document viewer. It provides a minimalistic and space saving interface as well as an easy usage that mainly focuses on keyboard interaction."
  },
  {
    "name": "Y PPA Manager (Ubuntu)",
    "url": "https://launchpad.net/y-ppa-manager",
    "description": "Search for packages in Launchpad PPAs."
  },
  {
    "name": "PacmanXG (Arch)",
    "url": "http://almin-soft.ru/index.php?programmy/pacmanxg/tags/pacmanxg",
    "description": "GUI front-end for pacman. Depends on neither GTK+ nor Qt, just X11."
  },
  {
    "name": "pirut (Fedora)",
    "url": "http://fedoraproject.org/wiki/Tools/pirut",
    "description": "pirut provides a set of graphical tools for managing software."
  },
  {
    "name": "Synaptics (Debian and .deb users)",
    "url": "http://www.nongnu.org/synaptic/",
    "description": "Synaptic is a graphical package management program for apt. It provides the same features as the apt-get command line utility with a GUI front-end based on Gtk+."
  },
  {
    "name": "YaST (openSUSE)",
    "url": "https://en.opensuse.org/YaST_Software_Management",
    "description": "YaST is the main package management tool on openSUSE."
  },
  {
    "name": "YumEx (Fedora)",
    "url": "https://fedorahosted.org/yumex/",
    "description": "YumEx is a GUI for the dnf package manager, it is written in Python and is using the PyGTK toolkit for GUI Components."
  },
  {
    "name": "Yaourt (Arch)",
    "url": "https://wiki.archlinux.org/index.php/Yaourt",
    "description": "Yaourt (Yet AnOther User Repository Tool) is a wrapper for pacman which adds automated access to the AUR using the same syntax as pacman."
  },
  {
    "name": "Aura (Arch)",
    "url": "https://github.com/aurapm/aura",
    "description": "A secure, multilingual package manager for Arch Linux and the AUR."
  },
  {
    "name": "awesome",
    "url": "https://github.com/sindresorhus/awesome"
  },
  {
    "name": "awesome lists for programming languages",
    "url": "https://github.com/sindresorhus/awesome#programming-languages"
  },
  {
    "name": "awesome-shell",
    "url": "https://github.com/alebcay/awesome-shell"
  },
  {
    "name": "awesome-emacs",
    "url": "https://github.com/emacs-tw/awesome-emacs"
  },
  {
    "name": "awesome-vim",
    "url": "http://vimawesome.com/"
  },
  {
    "name": "awesome-sysadmin",
    "url": "https://github.com/n1trux/awesome-sysadmin"
  }
]
