[
  {
    "name": ".NET Rocks!",
    "url": "https://www.dotnetrocks.com/",
    "description": "The internet audio talk show for .NET developer with Carl Franklin and Richard Campbell."
  },
  {
    "name": "/dev/hell",
    "url": "http://devhell.info/",
    "description": "Chris Hartjes and Ed Finkler are trapped in Development Hell, where they talk mostly about PHP, web, their development experiences and also with special guests."
  },
  {
    "name": "a16z Podcast",
    "url": "https://a16z.com/podcasts/",
    "description": "A podcast discusses tech and culture trends, news, and the future."
  },
  {
    "name": "Accidental Tech Podcast",
    "url": "http://atp.fm/",
    "description": "Three nerds discussing tech, Apple, programming, and loosely related matters."
  },
  {
    "name": "Ada Lovelace Day iTunes",
    "url": "https://findingada.com/",
    "description": "Achievements of women in science, technology, engineering and maths (STEM)."
  },
  {
    "name": "Android Developers Backstage",
    "url": "http://androidbackstage.blogspot.com/",
    "description": "Android Backstage, a podcast by and for Android developers. Hosted by developers from the Android engineering team, this show covers topics of interest to Android programmers, with in-depth discussions and interviews with engineers on the Android team at Google."
  },
  {
    "name": "Around IT In 256 Seconds",
    "url": "https://256.nurkiewicz.com/",
    "description": "Podcast for developers, testers, SREs… and their managers. I explain complex and convoluted technologies in a clear way, avoiding buzzwords and hype. Never longer than 4 minutes and 16 seconds."
  },
  {
    "name": "Ask Noah",
    "url": "https://www.jupiterbroadcasting.com/show/asknoah/",
    "description": "Noah answers questions about technology, business, community and Linux"
  },
  {
    "name": "Away From The Keyboard",
    "url": "http://awayfromthekeyboard.com/category/podcasts/",
    "description": "Away From The Keyboard is where technologists tell their stories of how they started, how they grew, how they learned, and how they unwind."
  },
  {
    "name": "Away from Keyboard – Exploring the human side of creative work.",
    "url": "https://changelog.com/afk"
  },
  {
    "name": "Azure Friday",
    "url": "https://channel9.msdn.com/Shows/Azure-Friday",
    "description": "Scott Hanselman sits down with the actual engineers who build Azure on his journey to learn how to program the cloud. No marketing, no BS, just two engineers and a laptop in short manageable chunks."
  },
  {
    "name": "Base.cs",
    "url": "https://www.codenewbie.org/basecs",
    "description": "Beginner-friendly computer science lessons based on Vaidehi Joshi's base.cs blog series, produced by CodeNewbie."
  },
  {
    "name": "Between Screens",
    "url": "https://soundcloud.com/between-screens",
    "description": "Expect to find content about the following topics: Ruby, Rails, Sinatra, Sass, Javascript, Design Patterns, Jekyll, Client-Side Web Apps, Rust, Typography, Git, Responsive Design, Prototyping, Web Design, Type Design and more."
  },
  {
    "name": "Blockchain Insider",
    "url": "https://bi.11fs.com/",
    "description": "Weekly podcast specialising in all things blockchain, ledger technology and crypto currencies."
  },
  {
    "name": "Boagworld Show",
    "url": "https://boagworld.com/show",
    "description": "Boagworld is a podcast about digital strategy, management and user experience. It offers practical advice, news, tools, review and interviews with leading figures in the web design community."
  },
  {
    "name": "BookBytes",
    "url": "https://www.orbit.fm/bookbytes/",
    "description": "A book club podcast for developers."
  },
  {
    "name": "Bootstrapped",
    "url": "http://bootstrapped.fm/",
    "description": "Both Ian and Andrey are experienced startup founders, both have had major blows and successes in their career. You can learn a lot listening to them."
  },
  {
    "name": "Bootstrapped Web",
    "url": "http://bootstrappedweb.com/",
    "description": "Bootstrapped Web is for entrepreneurs bootstrapping their startups, who believe that the best way to get to where we're going is to learn by doing."
  },
  {
    "name": "Breach",
    "url": "https://www.carbonite.com/podcasts/breach/",
    "description": "A podcast exploring data breaches and cybersecurity by Carbonite."
  },
  {
    "name": "BSDNow",
    "url": "http://www.bsdnow.tv/",
    "description": "A Weekly BSD Podcast - News, Interviews and Tutorials."
  },
  {
    "name": "BSDTalk",
    "url": "http://bsdtalk.blogspot.com/",
    "description": "Talking about the BSD family of free operating systems."
  },
  {
    "name": "Build Phase",
    "url": "http://buildphase.fm/",
    "description": "Build Phase is a weekly technical podcast discussing iOS development and design."
  },
  {
    "name": "Choose Linux",
    "url": "https://chooselinux.show/",
    "description": "The show that captures the excitement of discovering Linux."
  },
  {
    "name": "Citizen Cosmos",
    "url": "https://www.citizencosmos.space/",
    "description": "A podcast discovering the masterminds of the Cosmos blockchain ecosystem and web3 ."
  },
  {
    "name": "Cloudcast",
    "url": "http://www.thecloudcast.net/",
    "description": "Award-winning podcast on all things, Cloud Computing, AWS Ecosystem, OpenSource, DevOps, AppDev, SaaS and SDN."
  },
  {
    "name": "CMOS",
    "url": "https://code-maven.com/cmos",
    "description": "The Code-Maven Open Source podcast helps you become familiar with a wide range of projects by interviewing users or developers of these projects."
  },
  {
    "name": "CodeNewbie Podcast",
    "url": "https://www.codenewbie.org/podcast",
    "description": "Stories from people on their coding journey."
  },
  {
    "name": "Coding Over Cocktails",
    "url": "https://www.torocloud.com/podcast",
    "description": "A podcast produced by Toro Cloud tackling issues faced by enterprises as they manage the process of digital transformation, application integration, low-code application development, data management, and business process automation."
  },
  {
    "name": "CoRecursive Interviews",
    "url": "https://corecursive.com/",
    "description": "In-Depth interviews with software development experts.  Focusing on functional programming and languages like scala / haskell / F# / erlang / idris / kotlin."
  },
  {
    "name": "CodePen Radio",
    "url": "https://blog.codepen.io/radio/",
    "description": "Co-founders of CodePen talk about the ins and outs of running a web software business."
  },
  {
    "name": "Command Line Heroes",
    "url": "https://www.redhat.com/en/command-line-heroes",
    "description": "A new podcast about the people who transform technology from the command line up."
  },
  {
    "name": "Complete Developer Podcast",
    "url": "https://completedeveloperpodcast.com/",
    "description": "There are plenty of podcasts out there about languages and coding. What we are doing with the Complete Developer Podcast is to cover the other areas of life. For example, our first episode is about talking with customers, bosses, and others that developers interact with who are not fellow developers."
  },
  {
    "name": "Composers Play",
    "url": "https://www.youtube.com/playlist?list=PL05Yj9M-fWdJUySLU5fJ8Lg6h6t43_0nf",
    "description": "Listen to a video game composer discuss soundtracks of iconic games such as Mass Effect, Duke Nukem II, Doom, and System Shock with their composers, often while playing the game."
  },
  {
    "name": "Cortex",
    "url": "https://www.relay.fm/cortex",
    "description": "Content creators CGP Grey and Myke Hurley discuss their processes, productivity hacks, workflows, and general working lives."
  },
  {
    "name": "CppCast",
    "url": "http://cppcast.com/",
    "description": "The first podcast by C++ developers for C++ developers."
  },
  {
    "name": "Creative Coding Podcast",
    "url": "http://creativecodingpodcast.com/",
    "description": "about programming for visual and creative applications."
  },
  {
    "name": "CTRL+Click Cast",
    "url": "https://www.ctrlclickcast.com/",
    "description": "They \"inspect the web for you\". Interviews with developers and designers, about design, code, and content management systems. Hosted by Lea Alcantara and Emily Lewis."
  },
  {
    "name": "Curious Minds",
    "url": "https://www.cmpod.net/",
    "description": "Curious Minds is a podcast about Science, Technology, and History. Each episode brings interesting stories from a wide range of subjects: from Physics and Astronomy to Medicine, Art and Science Fiction."
  },
  {
    "name": "Darknet Diaries",
    "url": "https://darknetdiaries.com",
    "description": "Stories from hackers or those who have been attacked. How they got in and what happened."
  },
  {
    "name": "Data Stories",
    "url": "http://datastori.es/",
    "description": "Enrico Bertini and Moritz Stefaner discuss the latest developments in data analytics, visualization and related topics."
  },
  {
    "name": "Defensive Security Podcast",
    "url": "https://defensivesecurity.org/category/podcast/",
    "description": "Defensive Security is a Cyber Security Podcast covering breaches and strategies for defense."
  },
  {
    "name": "Design vs Dev",
    "url": "https://agileleague.com/",
    "description": "A podcast about web development from the different perspectives of designers and developers."
  },
  {
    "name": "DevChat.tv",
    "url": "https://devchat.tv/",
    "description": "We are programmers. House of Ruby Rogues, Javascript Jabber, IPhreaks, Freelancers' Show, Adventures in Angular and RailsClips."
  },
  {
    "name": "Developer On Fire",
    "url": "https://developeronfire.com/",
    "description": "Podcast with inspiring interviews with successful software developers, architects, testers, and other professionals with stories of success, failure, excellence, and inspiration."
  },
  {
    "name": "DevelopersHangout",
    "url": "http://www.developershangout.io/",
    "description": "Two Developers talk about challenges, articles, news, books and other podcasts that came across their radar every 2 weeks. Laravel, PHP are two key topics, and other great podcasts like the ones listed above."
  },
  {
    "name": "Developer Tea",
    "url": "https://spec.fm/podcasts/developer-tea",
    "description": "Podcast for web and software developers hosted by a developer that you can listen to in less than 10 minutes."
  },
  {
    "name": "Developing Perspective",
    "url": "http://developingperspective.com/",
    "description": "From development and design to marketing and support, Under the Radar is all about independent app development. It's never longer than 30 minutes."
  },
  {
    "name": "DevOps Cafe",
    "url": "http://devopscafe.org/",
    "description": "In this interview driven show, John Willis and Damon Edwards take a pragmatic look at the technology, tools, and business developments behind the emerging DevOps movement."
  },
  {
    "name": "Digital Human",
    "url": "https://www.bbc.co.uk/programmes/b01n7094",
    "description": "BBC series explores the digital world presented by Aleks Krotoski."
  },
  {
    "name": "Disruptive",
    "url": "https://soundcloud.com/wyssinstitute/sets/disruptive",
    "description": "Researchers at the Wyss Institute for Biologically Inspired Engineering use Nature's design principles to develop bioinspired materials and devices that will transform medicine and create a more sustainable world. In this podcast series, Terrence McNally speaks directly with Institute researchers, exploring their motivations and how they envision our future as it might be impacted by their disruptive technologies."
  },
  {
    "name": "Eat Sleep Code Podcast",
    "url": "https://soundcloud.com/esc-podcast",
    "description": "On the show we’ll be talking to passionate people about a wide range of developer-related topics."
  },
  {
    "name": "Elixir Foundation",
    "url": "http://feeds.soundcloud.com/users/soundcloud:users:24638646/sounds.rss",
    "description": "Your weekly podcast for news & interviews from around the Elixirlang Community."
  },
  {
    "name": "Elixir Outlaws",
    "url": "https://elixiroutlaws.com",
    "description": "Panel discussions of topics in and around Elixir development."
  },
  {
    "name": "Embedded.fm",
    "url": "https://www.embedded.fm/",
    "description": "Talk about the how, why, and what of engineering, usually devices."
  },
  {
    "name": "Ember Weekend",
    "url": "https://emberweekend.com/episodes",
    "description": "A week(end)ly podcast about Ember, hosted by Jon and Chase."
  },
  {
    "name": "Entreprogrammers",
    "url": "http://entreprogrammers.com/",
    "description": "Get a fly-on-the-wall perspective from 4 developers turned entrepreneurs, as they struggle with the business and learn lessons the hard way. This is the weekly mastermind group of the entreprogrammers."
  },
  {
    "name": "FiveJS",
    "url": "https://www.pluralsight.com/codeschool",
    "description": "The latest news in the JavaScript community."
  },
  {
    "name": "FLOSS Weekly",
    "url": "https://twit.tv/shows/floss-weekly",
    "description": "Interviews with prominent guests from the free software/open source community."
  },
  {
    "name": "Founders Talk – In-depth, one on one conversations with founders, CEOs, and makers. The journey, lessons learned, and the struggles. Let's do this!",
    "url": "https://changelog.com/founderstalk"
  },
  {
    "name": "Fragmented",
    "url": "https://fragmentedpodcast.com/",
    "description": "An Android Developer Podcast."
  },
  {
    "name": "Full Stack Radio",
    "url": "http://www.fullstackradio.com/",
    "description": "A podcast for developers interested in building great software products."
  },
  {
    "name": "Functional Geekery",
    "url": "https://www.functionalgeekery.com/",
    "description": "Functional Geeks, Geeking Functionally."
  },
  {
    "name": "Future of Coding",
    "url": "https://futureofcoding.org/",
    "description": "Monthly interviews."
  },
  {
    "name": "Get Up and Code",
    "url": "https://simpleprogrammer.com/",
    "description": "Get Up and Code is a podcast about fitness for programmers and software developers. Every week, John Sonmez, helps you lose weight, refactor your diet and get in shape."
  },
  {
    "name": "GitMinutes",
    "url": "http://www.gitminutes.com/",
    "description": "The show for proficient Git users."
  },
  {
    "name": "Google Cloud Platform Podcast",
    "url": "https://www.gcppodcast.com/",
    "description": "The Google Cloud Platform Podcast, coming to you every week. Discussing everything from on Google Cloud Platform from App Engine to Big Query."
  },
  {
    "name": "Go Time",
    "url": "https://changelog.com/gotime",
    "description": "Interesting topics around the Go programming language, building systems, the community, and everything in between."
  },
  {
    "name": "Hackable?",
    "url": "https://hackablepodcast.com",
    "description": "In a world where we obsess over staying connected, how can we be sure we're not leaving ourselves vulnerable. The host Geoff Siskind does a live demonstration of some awesome hacking techniques in each episode."
  },
  {
    "name": "Hackaday Podcast",
    "url": "https://hackaday.com/category/podcasts/",
    "description": "Hackaday's podcast, talking about the best articles published and hackaday contests."
  },
  {
    "name": "HardcoreHistory",
    "url": "https://www.dancarlin.com/hardcore-history-series/",
    "description": "In \"Hardcore History\" the very unconventional Dan Carlin takes his \"Martian\", outside-the-box way of thinking and applies it to the past."
  },
  {
    "name": "Greater Than Code",
    "url": "https://www.greaterthancode.com/",
    "description": "because #peoplematter."
  },
  {
    "name": "Harry Potter and the methods of rationality",
    "url": "http://www.hpmorpodcast.com/",
    "description": "This is an alternate universe story, where Petunia married a scientist. Harry enters the wizarding world armed with Enlightenment ideals and the experimental spirit."
  },
  {
    "name": "HaskellCast — A podcast for Haskell developers working in industry.",
    "url": "http://www.haskellcast.com/"
  },
  {
    "name": "Hello Internet",
    "url": "http://www.hellointernet.fm/",
    "description": "Science youtubers CGP Grey and Brady Haran discuss everything from flag design to Star Wars."
  },
  {
    "name": "Houston We Have a Podcast",
    "url": "https://www.nasa.gov/johnson/HWHAP/",
    "description": "Official Johnson Space Center NASA's podcast. Hosted weekly, its topics are in general about space and the ISS."
  },
  {
    "name": "HTTP 203",
    "url": "https://developers.google.com/web/shows/http203/",
    "description": " In each show Jake and Paul pick a hot topic in the world of web development and discuss the various aspects of it, meanwhile dropping in lifehacks, lessons and some rather honest truths."
  },
  {
    "name": "Iron Sysadmin",
    "url": "https://www.ironsysadmin.com/",
    "description": "A Podcast by real world sysadmins, for real world sysadmins."
  },
  {
    "name": "IRL: Because Online Life Is Real Life",
    "url": "https://irlpodcast.org/",
    "description": "Host Veronica Belmont shares real stories of life online and real talk about the future of the Web. IRL is an original podcast from Mozilla."
  },
  {
    "name": "JavaScript Air",
    "url": "https://javascriptair.com/",
    "description": "The live broadcast podcast all about JavaScript."
  },
  {
    "name": "Javascript Jabber",
    "url": "https://devchat.tv/podcasts/js-jabber/",
    "description": "Weekly podcast discussion about Javascript on the front and back ends."
  },
  {
    "name": "JS Party – A community celebration of JavaScript and the web",
    "url": "https://changelog.com/jsparty"
  },
  {
    "name": "Ladybug Podcast – An all lady-hosted tech podcast for all developers with great discussions around how to start coding, the hot technologies right now, how to get your first developer job, imposter syndrome, how to write CSS and more.",
    "url": "https://ladybug.dev/"
  },
  {
    "name": "Land of Giants",
    "url": "https://www.vox.com/land-of-the-giants-podcast",
    "description": "Facebook. Apple. Amazon. Netflix. Google. This podcast examine how it got its power, what it's doing with it, and what might happen to in the future."
  },
  {
    "name": "Laravel News Podcast",
    "url": "https://laravel-news.com/podcast/",
    "description": "The Laravel News Podcast brings you all the latest news and events related to Laravel."
  },
  {
    "name": "Linear Digressions",
    "url": "http://lineardigressions.com/",
    "description": "Explores topics of data science and machine learning in an accessible way through real-world stories and examples."
  },
  {
    "name": "Linux Action News",
    "url": "https://www.jupiterbroadcasting.com/show/linux-action-news/",
    "description": "Weekly news about Linux and the open source world."
  },
  {
    "name": "Linux For Everyone",
    "url": "https://linuxforeveryone.fireside.fm/",
    "description": "A show about the thrilling world of desktop Linux, open source software and the community creating it. For beginners and veterans alike! Hosted by Forbes' Jason Evangelho and friends."
  },
  {
    "name": "Linux Unplugged",
    "url": "https://www.jupiterbroadcasting.com/show/linuxun/",
    "description": "Weekly Linux live and open talk show"
  },
  {
    "name": "Listen and Learn about AWS",
    "url": "https://aws.amazon.com/podcasts/aws-podcast/",
    "description": "Jeff Barr discusses various aspects of the Amazon Web Services (AWS) offering. Each podcast include AWS news, tech tips, and interviews with startups, AWS partners, and AWS employees."
  },
  {
    "name": "Magic Read Along",
    "url": "http://www.magicreadalong.com",
    "description": "A podcast about programming, life and the internet. Topics include FP, OOP, development practices, and a dip into our personal lives from time to time."
  },
  {
    "name": "Makers",
    "url": "https://crew.co/",
    "description": "Unexpected life moments that have had an impact on today’s most influential and experimental makers."
  },
  {
    "name": "Mastering Embedded Systems",
    "url": "https://embeddedsuccess.com/podcast/",
    "description": "I have identified four major problems in mastering Embedded Systems: 1. Not enough specialists; 2. inadequate design and poor detections of faults; 3. mandatory multi-site approaches are failing; 4. bad mistakes in managing Virtual Teams I'll teach you the know-how and the tools to overcome these challenges."
  },
  {
    "name": "Mind the Cloud Podcast",
    "url": "http://mindthecloud.com",
    "description": "The podcast about the developers and companies using the cloud to create the future."
  },
  {
    "name": "MS Dev Show",
    "url": "https://msdevshow.com/",
    "description": "THE podcast for Microsoft developers. Jason Young and Carl Schweitzer talk about the latest in developer news covering topics such as the Azure cloud, Windows, Windows Phone, Visual Studio, and cross-platform development using the Microsoft platform."
  },
  {
    "name": "New Rustacean",
    "url": "https://newrustacean.com/",
    "description": "This is a podcast about learning the programming language Rust—from scratch."
  },
  {
    "name": "Note To Self",
    "url": "https://www.wnycstudios.org/shows/notetoself",
    "description": "Host Manoush Zomorodi talks with everyone from big name techies to elementary school teachers about the effects of technology on our lives, in a quest for the smart choices that will help you think and live better."
  },
  {
    "name": "Office 365 Developer Podcast",
    "url": "https://www.microsoft.com/en-us/microsoft-365/blog/",
    "description": "The only show focused on Office 365 development where we talk to the experts from all over the globe coding on the Office 365 platform."
  },
  {
    "name": "On the Metal",
    "url": "https://oxide.computer/blog/categories/on-the-metal/",
    "description": "Tales from the Hardware/Software Interface: “the nerdiest podcast on the face of the planet”."
  },
  {
    "name": "Open Source Security Podcast",
    "url": "https://www.opensourcesecuritypodcast.com/",
    "description": "A security podcast geared towards those looking to better understand security topics of the day."
  },
  {
    "name": "Open Source System Podcast",
    "url": "http://opensourcesystempodcast.vf.io/",
    "description": "Latest open source projects and news!"
  },
  {
    "name": "Our Ludicrous Future",
    "url": "https://ourludicrousfuture.com/",
    "description": "Mostly talks abut space, technology and Elon Musk."
  },
  {
    "name": "Packet Pushers",
    "url": "https://packetpushers.net/",
    "description": "About data networking by network architects. Deeply technical & unabashedly nerdy."
  },
  {
    "name": "Partially Derivative",
    "url": "http://partiallyderivative.com/",
    "description": "A podcast about Data, Nerdiness, and Beer."
  },
  {
    "name": "PHP Round Table",
    "url": "https://www.phproundtable.com/",
    "description": "The PHP Roundtable is a casual gathering of developers discussing topics that PHP nerds care about."
  },
  {
    "name": "PHP Town Hall",
    "url": "http://phptownhall.com/",
    "description": "Town Hall a way for PHP developers to raise questions about current events (or upcoming things) in the PHP community, with different guests each week."
  },
  {
    "name": "Podcast._init_",
    "url": "https://www.pythonpodcast.com/",
    "description": "A podcast about Python and the people who make it great."
  },
  {
    "name": "Practical AI – Making artificial intelligence practical, productive, and accessible to everyone.",
    "url": "https://changelog.com/practicalai"
  },
  {
    "name": "Python Bytes",
    "url": "https://pythonbytes.fm/",
    "description": "Python headlines delivered directly to your earbuds."
  },
  {
    "name": "Radiolab",
    "url": "https://www.wnycstudios.org/shows/radiolab",
    "description": "Radiolab is a show about curiosity. Where sound illuminates ideas, and the boundaries blur between science, philosophy, and human experience."
  },
  {
    "name": "Reactive",
    "url": "http://reactive.audio/",
    "description": "A podcast which merges, filters, scans and maps streams of thoughts about software engineering, culture, and technology."
  },
  {
    "name": "React Podcast",
    "url": "https://reactpodcast.com/",
    "description": "Podcast about React.js"
  },
  {
    "name": "Reasonably Sound",
    "url": "http://reasonablysound.com/",
    "description": "Context, explanation and a little celebration of the complexities and awesomeness of audio, and the various cultures which surround and have grown around it."
  },
  {
    "name": "Reply All",
    "url": "https://www.gimletmedia.com/reply-all",
    "description": "Reply All is a show about the internet."
  },
  {
    "name": "Risky Business",
    "url": "https://risky.biz/netcasts/risky-business/",
    "description": "Risky Business was established in February, 2007. It take a lighthearted look at information security news and features."
  },
  {
    "name": "Rocket Ranch",
    "url": "https://www.nasa.gov/kennedy/rocketranch/",
    "description": "Official podcast from NASA’s Kennedy Space Center."
  },
  {
    "name": "Rocket Talk",
    "url": "https://www.tor.com/features/series/rocket-talk-podcast/",
    "description": "Rocket Talk is Tor.com’s sci-fi/fantasy podcast, blending discussion style talk-radio with audio narrations of Tor.com’s award winning short fiction."
  },
  {
    "name": "Ruby5",
    "url": "https://www.pluralsight.com/search?q=ruby",
    "description": "The latest news in the Ruby and Rails community."
  },
  {
    "name": "RunAs Radio",
    "url": "http://www.runasradio.com/",
    "description": "A weekly Internet Audio Talk Show for IT Professionals working with Microsoft products."
  },
  {
    "name": "Second Career Devs",
    "url": "https://secondcareerdevs.com/",
    "description": "Each episode of the Second Career Devs podcast focuses on a guest who became a software engineer after a previous career."
  },
  {
    "name": "Security Now!",
    "url": "https://www.grc.com/securitynow.htm",
    "description": "Security Now! consists of a discussion between Steve Gibson and Leo Laporte of issues of computer security and, conversely, insecurity."
  },
  {
    "name": "Security Weekly",
    "url": "https://securityweekly.com",
    "description": "A weekly podcast about security and info sec."
  },
  {
    "name": "Semaphore Uncut",
    "url": "https://semaphoreci.com/podcast",
    "description": "Software industry pros discuss problems they’re currently solving with the products they're working on."
  },
  {
    "name": "Self Hosted",
    "url": "https://selfhosted.show/",
    "description": "Discover new software and hardware to get the best out of your network, control smart devices, and secure your data on cloud services. Self-Hosted is a chat show between Chris and Alex two long-time \"self-hosters\" who share their lessons and take you on the journey of their new ones. A Linux Academy podcast showcasing free and open source technologies you can host yourself."
  },
  {
    "name": "ShopTalk Show",
    "url": "https://shoptalkshow.com/",
    "description": "Podcast about front end web design, development and UX."
  },
  {
    "name": "Software Engineering Daily",
    "url": "https://softwareengineeringdaily.com/",
    "description": "A podcast with daily interviews about technical software topics intended for professional software developers."
  },
  {
    "name": "Software Engineering Radio",
    "url": "http://www.se-radio.net/",
    "description": "The podcast for professional software developers."
  },
  {
    "name": "Software Sessions",
    "url": "https://www.softwaresessions.com/",
    "description": "Practical conversations about building software."
  },
  {
    "name": "Soft Skills Engineering",
    "url": "https://softskills.audio/",
    "description": "Weekly advice podcast for software developers. It takes more than great code to be a great developer."
  },
  {
    "name": "Sound Of Symfony",
    "url": "https://www.soundofsymfony.com/",
    "description": "The unofficial Symfony podcast."
  },
  {
    "name": "StarTalk Radio",
    "url": "https://www.startalkradio.net/?sfid=22493&post_types=show",
    "description": "Program devoted to all things space and is hosted by renowned astrophysicist Neil deGrasse Tyson."
  },
  {
    "name": "Surveillance Report",
    "url": "https://techlore.tech",
    "description": "A weekly security and privacy news roundup to keep you up-to-speed on important updated in our digital world. Uploaded every weekend!."
  },
  {
    "name": "Sword & Laser",
    "url": "http://swordandlaser.com/",
    "description": "The Sword and Laser (S&L) is a science fiction and fantasy-themed book club, video show and podcast, started by Veronica Belmont and Tom Merritt."
  },
  {
    "name": "SYFY25 Origin Stories",
    "url": "https://www.syfy.com/syfywire/syfy25/podcast-episodes",
    "description": "Adam Savage sits down with creators, thought-leaders, and celebrity fans to discuss the moments, people, and milestones that have changed the genre universe forever; a nostalgic celebration of all things science fiction."
  },
  {
    "name": "Syntax FM",
    "url": "https://syntax.fm/",
    "description": "A Tasty Treats Podcast for Web Developers."
  },
  {
    "name": "Sysadministrivia",
    "url": "https://sysadministrivia.com/",
    "description": "Linux, Lagers, and Late Nights."
  },
  {
    "name": "Syscast Podcast",
    "url": "http://podcast.sysca.st/",
    "description": "Talking Linux, open source, web development and system administration (DevOps)."
  },
  {
    "name": "Talking Code",
    "url": "http://www.talkingcode.com/",
    "description": "Short expert interviews that help you decode what developers are saying."
  },
  {
    "name": "Talking Kotlin",
    "url": "http://talkingkotlin.com/",
    "description": "A bimonthly podcast on Kotlin and more hosted by Hadi Hariri."
  },
  {
    "name": "Talking Machines",
    "url": "http://www.thetalkingmachines.com/",
    "description": "Talking Machines is your window into the world of machine learning."
  },
  {
    "name": "Talk Python to Me",
    "url": "https://talkpython.fm/",
    "description": "Weekly podcast (30 minutes) that covers a wide array of Python topics."
  },
  {
    "name": "Teaching Python",
    "url": "https://www.teachingpython.fm/",
    "description": "Two middle school teachers learning and teaching Python."
  },
  {
    "name": "TechStuff",
    "url": "https://www.stuffmedia.com/techstuff-podcast.htm",
    "description": "TechStuff tackles topics ranging from basic electronics to the Large Hadron Collider and everything in between. TechStuff is dedicated to demystifying technology and its role in our society and culture."
  },
  {
    "name": "Test and Code Podcast",
    "url": "https://testandcode.com/",
    "description": "A podcast about Software Development, Software Testing, and Python."
  },
  {
    "name": "Testing In The Pub",
    "url": "https://testingpodcast.com/category/testing-in-the-pub/",
    "description": "British podcast about Software Testing practices"
  },
  {
    "name": "That Podcast",
    "url": "https://thatpodcast.io/",
    "description": "Beau and Dave talking about life as dads, programmers, and entrepreneurs."
  },
  {
    "name": "The Accidental Engineer",
    "url": "https://theaccidentalengineer.com/",
    "description": "Interviews with engineers about how they started their career"
  },
  {
    "name": "The Agile Coffee Podcast",
    "url": "http://agilecoffee.com/",
    "description": "AgileCoffee brings together an engaged group of practitioners passionate about Agile methodologies and Lean practices."
  },
  {
    "name": "The Amp Hour",
    "url": "https://theamphour.com/",
    "description": "Discussing the world of electronics design in an hour long(ish) weekly show."
  },
  {
    "name": "The Back to Front Show",
    "url": "https://backtofrontshow.com/",
    "description": "The Back to Front show was started in 2013 by web industry veterans Keir Whitaker and Kieran Masterton. Over the first 40 episodes they have discussed everything from web design and development to startups and dog related tech."
  },
  {
    "name": "The Big Web Show",
    "url": "http://5by5.tv/bigwebshow",
    "description": "It's everything web that matters."
  },
  {
    "name": "The Bike Shed",
    "url": "http://bikeshed.fm/",
    "description": "On The Bike Shed, hosts Derek Prior, Sean Griffin, Laila Winner, and guests discuss their development experience and challenges with Ruby, Rails, JavaScript, and whatever else is drawing their attention, admiration, or ire this week."
  },
  {
    "name": "The Bug Bounty Podcast",
    "url": "https://anchor.fm/bugbountypodcast",
    "description": "A Podcast about bugs, bounties and its researchers. Hosted by Fisher."
  },
  {
    "name": "The Changelog",
    "url": "https://changelog.com/podcast",
    "description": "Conversations with the hackers, leaders, and innovators of software development."
  },
  {
    "name": "The Cognicast",
    "url": "http://blog.cognitect.com/cognicast",
    "description": "The Cognicast previously ThinkRelevance: The Podcast is the podcast from the Cognitect family."
  },
  {
    "name": "The CyberWire Daily",
    "url": "https://thecyberwire.com/podcasts/daily-podcast",
    "description": "The daily cybersecurity news and analysis industry leaders depend on. Published each weekday, the program also included interviews with a wide spectrum of experts from industry, academia, and research organizations all over the world."
  },
  {
    "name": "The Cybrary Podcast",
    "url": "https://www.cybrary.it/info/cybrary-podcast/",
    "description": " It discusses about industry leaders and professionals from all aspects on the cybersecurity and IT fields give insight into how they got where they are today and what new and emerging technology we should be taking notice of."
  },
  {
    "name": "The Distributed Data Show",
    "url": "https://www.datastax.com/resources/distributed-data-show",
    "description": "Weekly source for the latest news and technical expertise to help building large-scale distributed systems. Brought by the DataStax Technical Evangelist team, go in-depth with DataStax engineers and special guests from the broader data community. New episodes each Tuesday."
  },
  {
    "name": "The Five-Minute Geek Show",
    "url": "http://www.fiveminutegeekshow.com",
    "description": "Matt Stauffer, unabashedly geeky, 5 minutes, twice a week. Frontend dev, backend dev, audio, design, podcasts--all fair game."
  },
  {
    "name": "The Food Fight Show",
    "url": "http://foodfightshow.org/",
    "description": "The Podcast where DevOps chefs do battle"
  },
  {
    "name": "The Hackersploit Podcast",
    "url": "https://www.listennotes.com/podcasts/the-hackersploit-podcast-alexis-rwTafnO1K9c/",
    "description": "The HackerSploit podcast is aimed at educating anyone interested in Infosec, Hacking or Cybersecurity."
  },
  {
    "name": "The Hanselminutes podcast",
    "url": "https://hanselminutes.com/",
    "description": "Fresh Air for Developers."
  },
  {
    "name": "The Laravel Podcast",
    "url": "http://www.laravelpodcast.com",
    "description": "The Laravel Podcast brings you Laravel and PHP development news and discussion."
  },
  {
    "name": "The Life Scientific",
    "url": "https://www.bbc.co.uk/programmes/b015sqc7",
    "description": "Professor Jim Al-Khalili talks to leading scientists about their life and work, finding out what inspires and motivates them and asking what their discoveries might do for mankind."
  },
  {
    "name": "The Linux Action Show",
    "url": "https://www.jupiterbroadcasting.com/tag/linux-action-show/",
    "description": "Podcast about Linux and Open Source. (discontinued)"
  },
  {
    "name": "The Loosely Coupled Podcast",
    "url": "http://looselycoupled.info/",
    "description": "Jeff Carouth and Matt Frost combine their decades of experience as web developers to talk about developer life."
  },
  {
    "name": "The Manifest",
    "url": "https://manifest.fm",
    "description": "A podcast all about package management."
  },
  {
    "name": "The Ship Show",
    "url": "http://theshipshow.com/",
    "description": "Build engineering, DevOps, release management & everything in between!"
  },
  {
    "name": "The Stack Overflow Podcast",
    "url": "https://stackoverflow.blog/podcasts/",
    "description": "A weekly podcast about developers and the Stack Overflow community."
  },
  {
    "name": "The Web Ahead",
    "url": "http://5by5.tv/webahead",
    "description": "Conversations with world experts on changing technologies and future of the web. The Web Ahead is your shortcut to keeping up."
  },
  {
    "name": "The Web Platform Podcast",
    "url": "http://thewebplatform.libsyn.com/",
    "description": "A weekly show that dives deep into all things web from the developers building the platform today."
  },
  {
    "name": "This Developer's Life",
    "url": "http://thisdeveloperslife.com/",
    "description": "A podcast about developers and their lives."
  },
  {
    "name": "Thoughtbot",
    "url": "https://thoughtbot.com/podcasts",
    "description": "We record and release weekly podcasts from thoughtbot on design, Ruby on Rails, iOS, running software companies, and maintaining work/life balance."
  },
  {
    "name": "ThoughtWorks",
    "url": "https://soundcloud.com/thoughtworks",
    "description": "A community of passionate individuals whose purpose is to revolutionize software design, creation and delivery, while advocating for positive social change."
  },
  {
    "name": "Three Devs and a Maybe",
    "url": "https://threedevsandamaybe.com/",
    "description": "Weekly discussion podcast on all things web development. Topics range from daily developer life, PHP, frameworks, testing, good software design and our experiences using many other programming languages."
  },
  {
    "name": "Toolsday Podcast",
    "url": "https://spec.fm/podcasts/toolsday",
    "description": "A 20-ish-minute podcast about the latest in tech tools, tips, and tricks on Tuesdays at 2!"
  },
  {
    "name": "Ubuntu Podcast",
    "url": "http://ubuntupodcast.org",
    "description": "A lively and upbeat podcast made by members of the Ubuntu UK LoCo that includes news, discussion and interviews from the Ubuntu and Open Source communities."
  },
  {
    "name": "Web of Tomorrow",
    "url": "https://www.orbit.fm/weboftomorrow/",
    "description": "Podcast about JavaScript and front-end web development."
  },
  {
    "name": "Weird Trick Mafia",
    "url": "https://weirdtrickmafia.fm/",
    "description": "A podcast about tech, feelings, open source, and /dev/urandom."
  },
  {
    "name": "Why Are Computers",
    "url": "https://whyarecomputers.com/",
    "description": "A podcast about computers and computer programs and why."
  },
  {
    "name": "WIRED's Webmonkey Podcast",
    "url": "https://www.wired.com/series/webmonkey/",
    "description": "Glance behind the scenes of WIRED.com with the tech team."
  },
  {
    "name": "Laravel Portugal Live",
    "url": "https://laravel.pt",
    "description": "Os membros do Laravel Portugal reunem-se para falar sobre Laravel, PHP, a comunidade Portuguesa, ideias e muito mais. @joselaborges"
  },
  {
    "name": "Ubuntu Portugal (podcast)",
    "url": "https://ubuntu-pt.org/",
    "description": "A comunidade Ubuntu Portugal (Ubuntu-PT) é a comunidade Portuguesa de suporte à distribuição de GNU/Linux, Ubuntu. Esta comunidade consiste num grupo de pessoas que voluntariamente se dedica não só a promover a utilização do sistema operativo Ubuntu e do software livre em geral, mas também a dar suporte aos utilizadores portugueses desta distribuição de GNU/Linux."
  },
  {
    "name": "10deploys",
    "url": "https://www.10deploys.com/",
    "description": "São discutidas as origens, tendências, influências e os conceitos por trás do DevOps com o objetivo de ajudar organizações a se transformarem em organizações de alto desempenho."
  },
  {
    "name": "99Vidas",
    "url": "http://99vidas.com.br/",
    "description": "Nostalgia, diversão e muita opinião sobre videogames."
  },
  {
    "name": "Acabou o café",
    "url": "https://www.listennotes.com/podcasts/acabou-o-caf%C3%A9-archcode-3DQw-pYW_dx/",
    "description": "Podcast sobre desenvolvimento de sistemas e tecnologia do ArchCode."
  },
  {
    "name": "Amarelo Criativo",
    "url": "https://soundcloud.com/amarelocriativo",
    "description": "Todos os podcasts da Amarelo criativo. Programas diferentes ao longo da semana para trazer informação sobre o mercado criativo, mundo geek e com o humor bem Amarelo."
  },
  {
    "name": "CapyCast",
    "url": "https://soundcloud.com/rdshipit/",
    "description": "Podcast com o Time de Produto da Resultados Digitais sobre os seus aprendizados em Desenvolvimento e Design."
  },
  {
    "name": "Chama o Suporte",
    "url": "https://open.spotify.com/show/5NR3iBbF3aRUP2gEDRzjGo",
    "description": "Podcast do grupo Guardians do curso de Ciência da Computação da Universidade Federal de Campina Grande."
  },
  {
    "name": "DatabaseCast",
    "url": "https://imasters.com.br/perfil/databasecast/",
    "description": "Primeiro podcast brasileiro sobre bancos de dados."
  },
  {
    "name": "DevDrops",
    "url": "https://anchor.fm/devdrops",
    "description": "O seu podcast sobre desenvolvimento de software."
  },
  {
    "name": "DataHackers",
    "url": "https://datahackers.com.br/podcast",
    "description": "Podcast mensal que traz profissionais da ciência de dados para falar do mercado de trabalho, carreira e novidades."
  },
  {
    "name": "DevNaEstrada",
    "url": "https://devnaestrada.com.br/",
    "description": "Podcast semanal sobre desenvolvimento web com uma pitada de humor."
  },
  {
    "name": "Elemencast",
    "url": "https://elemencast.github.io",
    "description": "A proposta é levar ao ouvinte drops de conteúdo diversos a respeito do universo Front-End, NodeJs, Programação Funcional etc."
  },
  {
    "name": "Enciclopédia do Teatro Impossível",
    "url": "https://open.spotify.com/show/36EnYAg6C1szSmbryeavXb?si=Htx1pbzGSp61pqyVvxbrRw",
    "description": "A Enciclopédia do Teatro Impossível é uma história paralela do teatro brasileiro, vista pelos seus fracassos. São relatos parte ficção parte realidade sobre produções teatrais impossíveis."
  },
  {
    "name": "FalaDev",
    "url": "https://anchor.fm/faladev",
    "description": "Passando a maior parte do tempo escrevendo código, chegou o momento de se reunir e falar sobre o universo da programação."
  },
  {
    "name": "Galera do Rau",
    "url": "http://galeradorau.com.br/category/podcast/galera-do-rau/",
    "description": "Quatro professores, extremamente nerds, divertidos e com muita história pra contar."
  },
  {
    "name": "Hack n' Cast",
    "url": "http://mindbending.org/pt/category/hack-n-cast",
    "description": "Podcast about technology and Open Source/Free software"
  },
  {
    "name": "Hipsters ponto Tech",
    "url": "https://hipsters.tech/",
    "description": "Podcast da Caelum sobre startups, programação, UX, gadgets e as últimas tendências em tecnologia."
  },
  {
    "name": "Knowledge Cast",
    "url": "https://open.spotify.com/show/06fPDUqQapNcfIE01IQHhE?si=stsjeebMRQeH3ROpCeEYcw",
    "description": "Podcast sobre Agilidade por K21"
  },
  {
    "name": "Lambda3 Podcast",
    "url": "https://www.lambda3.com.br/category/podcast/",
    "description": "Podcast da Lambda3"
  },
  {
    "name": "Lídercast Café Brasil",
    "url": "http://www.portalcafebrasil.com.br/todos/lidercast/",
    "description": "Entrevistas tratando de assuntos como liderança e empreendedorismo."
  },
  {
    "name": "Like a Boss",
    "url": "https://www.likeaboss.com.br",
    "description": "O podcast Like a Boss é um podcast para empreendedores. Líderes e fundadores de startups e empresas de sucesso sentam com os dois hosts do programa."
  },
  {
    "name": "Mamilos",
    "url": "https://www.b9.com.br/shows/mamilos/",
    "description": "Jornalismo de peito aberto"
  },
  {
    "name": "MovileCast",
    "url": "https://movile.blog/tag/podcast/",
    "description": "Podcast de tecnologia do ecossistema de empresas Movile."
  },
  {
    "name": "Naruhodo!",
    "url": "https://www.b9.com.br/podcasts/naruhodo/",
    "description": "O Podcast tem uma proposta de explicar diversos temas, usando ciência, filosofia, história entre outros para embasar as respostas."
  },
  {
    "name": "NerdCast",
    "url": "https://jovemnerd.com.br/nerdcast/",
    "description": "Podcast do portal JovemNerd que fala sobre nerdices, teorias e rpg's"
  },
  {
    "name": "PHP Do Jeito Certo",
    "url": "http://phpdojeitocerto.tumblr.com/",
    "description": "Notícias sobre as novidades do PHP para desenvolvedores experientes e iniciantes."
  },
  {
    "name": "Pizza de Dados",
    "url": "https://pizzadedados.com/",
    "description": "O Pizza de Dados é uma iniciativa que trás assuntos relacionados à ciência de dados de forma lúdica e descontraída."
  },
  {
    "name": "PODebug",
    "url": "http://www.podebug.com/",
    "description": "Desenvolvimento de software e tecnologia em geral, mas de forma bem humorada e descontraída."
  },
  {
    "name": "PodProgramar",
    "url": "https://podprogramar.com.br/",
    "description": "Podcast sobre desenvolvimento técnologia comando pela Jessi Zanelato e Ana Eliza, abordam temas iniciantes e avançados."
  },
  {
    "name": "PodTag",
    "url": "https://podtag.com.br/",
    "description": "Podcast comando pelo Luiz Gonçalves que abordam diversos temas sobre tecnologia desde de carreira a techs em si com vários convidades diferentes."
  },
  {
    "name": "Quebradev",
    "url": "https://quebradev.com.br/",
    "description": "Um podcast de origem periférica e com destino voltado à origem."
  },
  {
    "name": "Rapadura Cast",
    "url": "https://cinemacomrapadura.com.br/cat/rapaduracast-podcast/",
    "description": "Podcast da galera do Cinema com rapadura, considerado hoje referência sobre cultura pop no Brasil."
  },
  {
    "name": "Rede Geek",
    "url": "http://www.redegeek.com.br/podcast/",
    "description": "Podcast destinado ao público geek sobre diversos assuntos como, tecnologia, ciência, história e outros."
  },
  {
    "name": "Reloading",
    "url": "http://reloading.com.br/",
    "description": "Podcast semanal que traz as notícias, acontecimentos e curiosidades mais importantes do mundo dos videogames."
  },
  {
    "name": "Souforce.cloud",
    "url": "https://souforce.cloud/podcast/",
    "description": "O primeiro podcast voltado ao mundo Salesforce no idioma Português, aqui batemos um papo de Desenvolvimento, Administração da Plataforma, Produtos Salesforce além de assuntos como Carreira entre outros."
  },
  {
    "name": "Start Coding",
    "url": "https://anchor.fm/start-coding",
    "description": "Start Coding é uma iniciativa online com o objetivo de inserir mulheres na tecnologia. O podcast apresenta temas da computação e a equidade de gênero na área."
  },
  {
    "name": "Tecnocast",
    "url": "https://tecnoblog.net/categoria/podcast/",
    "description": "Podcast do Tecnoblog, sobre tecnologia."
  },
  {
    "name": "Xadrez Verbal",
    "url": "https://xadrezverbal.com/category/audio/podcast-do-xadrez-verbal/",
    "description": "Política, história e atualidades."
  },
  {
    "name": "Zeno Overflow",
    "url": "https://soundcloud.com/zenorocha",
    "description": "Uma série de perguntas e respostas ao vivo sobre tecnologia, carreira e a vida fora do Brasil."
  },
  {
    "name": "Zone Of Front-Enders",
    "url": "https://zofe.com.br/",
    "description": "Podcast com enfoque no desenvolvimento front-end da web."
  },
  {
    "name": "Dragões de Garagem",
    "url": "http://dragoesdegaragem.com/",
    "description": "Um podcast de divulgação científica,  do desejo de falar sobre ciência de forma acessível e descontraída, incentivando a curiosidade e o pensamento crítico."
  },
  {
    "name": "Opencast",
    "url": "https://anchor.fm/opencast",
    "description": "Tecnologia, Software Livre e inovação em um bate-papo descontraído e cheio de referências ao mundo unix-like.."
  },
  {
    "name": "1984",
    "url": "https://podcast.jcea.es/podcast1984/",
    "description": "Hacking, hacktivismo y seguridad"
  },
  {
    "name": "85% Cocoa",
    "url": "http://ochentaycincoporcientococoa.tumblr.com/",
    "description": "Podcast sobre Cocoa y programación."
  },
  {
    "name": "A hombros de gigantes",
    "url": "http://www.rtve.es/alacarta/audios/a-hombros-de-gigantes/",
    "description": "Programa de divulgación científica."
  },
  {
    "name": "Basta ya de picar",
    "url": "http://www.bastayadepicar.com/",
    "description": "Podcasts donde se discuten diversos temas de programación y de la vida del programador."
  },
  {
    "name": "CAChemE",
    "url": "https://cacheme.org/podcast/",
    "description": "Aplicaciones para ciencia e ingeniería (principalmente Python)."
  },
  {
    "name": "El gato de Turing",
    "url": "https://elgatodeturing.com/",
    "description": "Podcast sobre la actualidad científica y tecnológica."
  },
  {
    "name": "Fallo de sistema",
    "url": "http://www.rtve.es/alacarta/audios/fallo-de-sistema/",
    "description": "Programa de divulgación científica, ciencia ficción y vídeo juegos."
  },
  {
    "name": "Ideas ágiles",
    "url": "https://dosideas.com/podcast/ideasagiles/",
    "description": "Podcast sobre charlas, entrevistas y experiencias sobre la vida del desarrollador de software."
  },
  {
    "name": "Nación Lumpen",
    "url": "https://www.nacionlumpen.com/",
    "description": "similar a \"Basta ya de picar\"."
  },
  {
    "name": "Python en español",
    "url": "https://podcast.jcea.es/python/",
    "description": "Python en tu idioma"
  },
  {
    "name": "WeDevelopers",
    "url": "http://wedevelopers.com/",
    "description": "Podcast de developers (algunos episodios en inglés / some podcasts in English)."
  },
  {
    "name": "Atareao Podcast",
    "url": "https://www.atareao.es/podcasts",
    "description": "Podcast sobre Linux, Ubuntu, Android y Open Source."
  },
  {
    "name": "Bricolabs Podcast",
    "url": "https://archive.org/details/BricolabsPodcast",
    "description": "Mundo maker, software y hardware libre, proyectos, actividades y eventos organizados por la asociación Bricolabs."
  },
  {
    "name": "Compilando Podcast",
    "url": "https://compilando.audio",
    "description": "Entrevistas y noticias sobre GNU/Linux y software libre."
  },
  {
    "name": "Davidochobits podcast",
    "url": "https://www.ochobitshacenunbyte.com/category/miscelaneos/",
    "description": "Free Software, GNU y Linux."
  },
  {
    "name": "deployando.me",
    "url": "https://deployando.me/",
    "description": "Podcast de tecnologia para sysadmins y devops."
  },
  {
    "name": "Eduardo Collado",
    "url": "https://www.eduardocollado.com/",
    "description": "Administración de redes. No sólo de hosting y redes vive el hombre."
  },
  {
    "name": "GNU/Linux Valencia",
    "url": "https://gnulinuxvalencia.org/category/podcasts",
    "description": "Una aproximación al mundo GNU/Linux desde la capital del Turia."
  },
  {
    "name": "Home Studio Libre: el Podcast",
    "url": "https://www.ivoox.com/podcast-home-studio-libre-podcast_sq_f1614625_1.html",
    "description": "Aquí encontraras informacion en español sobre producción y postproducción de audio y vídeo con herramientas libres."
  },
  {
    "name": "La Pingüina Increíblemente Curiosa",
    "url": "https://podcast.voidnull.es/",
    "description": "Un podcast sobre LPIC, contenido de la certificación y explicaciones de los capitulos que hay que estudiar."
  },
  {
    "name": "Maratón Linuxero",
    "url": "https://maratonlinuxero.org",
    "description": "proyecto creado por podcasters y oyentes de GNU/Linux que quieren realizar un evento en directo a través de aplicaciones y servicios de software libre."
  },
  {
    "name": "Más Allá de la Innovación",
    "url": "https://masalladelainnovacion.com",
    "description": "Entrevistas tech de OpenExpo."
  },
  {
    "name": "Mosqueteroweb Tecnología",
    "url": "https://www.ivoox.com/podcast-mosqueteroweb-tecnologia_sq_f1248962_1.html",
    "description": "Reflexiones sobre tecnología, ordenadores, chromebooks, smartphones, tablets, software, sistemas operativos:Linux, Windows y otros y apps."
  },
  {
    "name": "NeoSiteLinux Podcast",
    "url": "https://www.neositelinux.com/tags/#podcasts",
    "description": "Donde lo principal es el Software Libre, GNU/Linux y la Tecnologia."
  },
  {
    "name": "NOlegaltech Radio",
    "url": "https://www.ivoox.com/podcast-nolegaltech-radio_sq_f1446265_1.html",
    "description": "El mundo legal no mola nada... Píldoras de tecnología y derecho en 10 minutos."
  },
  {
    "name": "Podcast Linux",
    "url": "https://avpodcast.net/podcastlinux",
    "description": "Un podcast del mundo GNU/Linux para usuarios dómesticos de escritorio."
  },
  {
    "name": "Linux Express, de Podcast Linux",
    "url": "https://podcastlinux.gitlab.io",
    "description": "Resumen más personal de Podcast Linux."
  },
  {
    "name": "Podcast oficial KDE España",
    "url": "https://www.ivoox.com/podcast-podcast-kde-espana_sq_f1249423_1.html",
    "description": "Podcast de la Asociación Cultural KDE España."
  },
  {
    "name": "Salmorejo Geek",
    "url": "https://www.ivoox.com/podcast-salmorejo-geek_sq_f1206500_1.html",
    "description": "Batiburrillo Digital. Sobre todo Linux."
  },
  {
    "name": "Ubuntu y otras hierbas",
    "url": "https://www.ubuntuleon.com/search?q=podcast&max-results=20&by-date=true",
    "description": "Podcast en español sobre Ubuntu y software libre en general."
  },
  {
    "name": "uGeek",
    "url": "https://ugeek.github.io/",
    "description": "Tecnología, Android, Linux, Servidores y mucho más..."
  },
  {
    "name": "Debugger Podcast",
    "url": "https://debuggerpodcast.ge/",
    "description": "Podcast about development culture, technologies and career growth."
  },
  {
    "name": "DevZen Podcast",
    "url": "https://devzen.ru/",
    "description": "Podcast about programming, IT and related topics."
  },
  {
    "name": "How to make games",
    "url": "https://kdicast.com/",
    "description": "Podcast about video games and video games industry."
  },
  {
    "name": "RWPod",
    "url": "https://www.rwpod.com/",
    "description": "Podcast about world of Ruby and Web technologies."
  },
  {
    "name": "Radio-T",
    "url": "https://radio-t.com/",
    "description": "Podcast of weekend. Improvisation on the theme of IT."
  },
  {
    "name": "RadioJS",
    "url": "http://radiojs.ru/",
    "description": "Podcast about web-development, Javascript, Frontend and client-side."
  },
  {
    "name": "SDCast — Software development podcast. Interviews with developers, talks about development, open source and related IT topics.",
    "url": "http://sdcast.ksdaemon.ru"
  },
  {
    "name": "Razbor Poletov",
    "url": "http://razborpoletov.com",
    "description": "Podcast about world of Java, technologies and software development."
  },
  {
    "name": "uWebDesign",
    "url": "https://uwebdesign.ru/",
    "description": "Podcast about web-design, web-development and all IT-related stuff."
  },
  {
    "name": "GoLang Show",
    "url": "https://golangshow.com/",
    "description": "Podcast about Go language."
  },
  {
    "name": "DevOps Deflope",
    "url": "https://devopsdeflope.ru/",
    "description": "Podcast about DevOps."
  },
  {
    "name": "HangOps.Ru",
    "url": "https://www.youtube.com/channel/UCr5mwN4AKxiYxysr8PeQdaA/feed",
    "description": "Podcast + Live talk on YouTube about DevOps."
  },
  {
    "name": "Podlodka",
    "url": "http://podlodka.io",
    "description": "Weekly audio show on software development. Interviews with professionals in software development industry and other related fields."
  },
  {
    "name": "UnderJS Podcast",
    "url": "https://underjs.ru/",
    "description": "Podcast about JS, React Native, Nodejs."
  },
  {
    "name": "linkmeup",
    "url": "https://linkmeup.ru/",
    "description": "Podcast about Networks, Telecom and other IT."
  },
  {
    "name": "RadioDotNet",
    "url": "https://radio.dotnet.ru",
    "description": "Podcast about everything .NET-related: news, articles, libraries, events."
  },
  {
    "name": "DotNet & More",
    "url": "https://more.dotnet.ru",
    "description": "Podcast about .NET development and more. Hosted by Aleksandr Kugushev and Artem Akulyakov."
  },
  {
    "name": "Solo on .NET",
    "url": "https://youtube.com/playlist?list=PLAFX7TSEV7SOqEQKnrrFiV7bUY8kN5Qof",
    "description": "Podcast about software development (programming). Discussed topics are C#, F#, C++, .NET, Visual Studio, Java, CUDA, Xeon Phi, FPGA and much more. Hosted by Dmitri Nesteruk."
  },
  {
    "name": "Svoj Podcast",
    "url": "https://anchor.fm/svojpodcast",
    "description": "Podcast about the latest news in programming, IT and technologies. Hosted by Yurii Sydorets and Alex Poddiachyi"
  },
  {
    "name": "RadioGeek",
    "url": "https://jadi.net/2012/07/podcast-haye-jadi/",
    "description": "Yet another podcast for wandering geeks in the intersection of society and technology."
  },
  {
    "name": "Shir Ya Khat",
    "url": "http://shiryakhat.net/",
    "description": "The first Blockchain Podcast dedicated to Iranians and Farsi speaking communities. We talk about Bitcoin, Blockchain assets and decentralization ideaology."
  },
  {
    "name": "Kodsnack",
    "url": "https://kodsnack.se/",
    "description": "Weekly Swedish podcast about all things code, for coders. Hosted by Fredrik Björeman, Tobias Hieta and Kristoffer Grönlund, with occasional guests."
  },
  {
    "name": "Blogue Linux",
    "url": "http://www.bloguelinux.ca/",
    "description": "French (Quebec) podcast talking about Linux technologies."
  },
  {
    "name": "La Dev Team",
    "url": "https://www.radiokawa.com/episode/la-dev-team-hs2/",
    "description": "Monthly podcast hosted by developers and talking about the video game industry."
  },
  {
    "name": "Le comptoir sécu — Bimensual podcasts about security, welcoming an expert for each subject. Hosted by Justin Ganivet, Morgan Hotonnier, Youenn Piolet, Loïs Samain.",
    "url": "https://www.comptoirsecu.fr/"
  },
  {
    "name": "Les Cast Codeurs — Podcast provided from and for developers. Latest news on Java ecosystem and development in general. Hosted by  Emmanuel Bernard (JBoss, Hibernate), Arnaud Héritier (CloudBees, Jenkins), Guillaume Laforge (Google, Groovy), Antonio Goncalves (freelance, auteur), Vincent Massol (XWiki, Maven), Audrey Neveu (Saagie, Devoxx4Kids).",
    "url": "https://lescastcodeurs.com"
  },
  {
    "name": "Le podcast AWS en français",
    "url": "https://aws.amazon.com/fr/blogs/france/podcasts/",
    "description": "le podcast qui parle d’AWS en français."
  },
  {
    "name": "Visual Studio Talk Show",
    "url": "http://visualstudiotalkshow.libsyn.com/",
    "description": "French podcast talking about development with Microsoft technologies. Hosted by Mario Cardinal and Guy Barrette."
  },
  {
    "name": "IFTTD – If This Then Dev",
    "url": "https://ifttd.io/",
    "description": "Weekly french podcast interviewing experts in various tech domains (AI, blockchain, security, devops,...). Hosted by Bruno Soulez."
  },
  {
    "name": "Electro Monkeys",
    "url": "https://electro-monkeys.fr/",
    "description": "Weekly french podcast, Electro Monkeys is the most offbeat podcast on the planet on cloud native technologies! Hosted by Stéphane Beuret."
  },
  {
    "name": "Apfelfunk",
    "url": "https://apfelfunk.com/",
    "description": "Weekly podcast about everything that's related to Apple."
  },
  {
    "name": "Chaosradio",
    "url": "https://chaosradio.de",
    "description": "Monthly live talk radio show of the Chaos Computer Club."
  },
  {
    "name": "Freak Show",
    "url": "https://freakshow.fm/",
    "description": "Tech podcast, normally published every two weeks. Mostly Apple, Bitcoin and podcasting."
  },
  {
    "name": "Logbuch:Netzpolitik",
    "url": "https://logbuch-netzpolitik.de/",
    "description": "Weekly podcast about netpolitics."
  },
  {
    "name": "Methodisch inkorrekt",
    "url": "http://minkorrekt.de/",
    "description": "humoristic reviews of papers 4. Releasing pretty much all two weeks"
  },
  {
    "name": "Radio Nukular",
    "url": "https://www.radionukular.de/",
    "description": "Mainly (but not limited to) movies, video games and comics."
  },
  {
    "name": "Request for Comments",
    "url": "https://requestforcomments.de/",
    "description": "Der RFC Podcast"
  },
  {
    "name": "Working Draft",
    "url": "https://workingdraft.de/",
    "description": "Weekly news podcast for webdesigners and developers."
  },
  {
    "name": "Teahour",
    "url": "http://teahour.fm/",
    "description": "A podcast hosted by Terry Tai, Dingding Ye and Daniel Lv, Most topics are about software development, startups, etc."
  },
  {
    "name": "DevTalk",
    "url": "https://devtalk.pl/",
    "description": "Tech podcast for passionate developers. All topics related to dev: architecture, languages, tools, libraries, conferences, community, career planning... Hosted by Maciej Aniserowicz."
  },
  {
    "name": "Just4Fun",
    "url": "https://just4fun.io/",
    "description": "Biweekly tech podcast hosted by Rafal Warzycha and Piotr Leszczynski. Main topics are JavaScript and frontend."
  },
  {
    "name": "ChwastIT",
    "url": "https://chwast.it//",
    "description": "The worst programming podcast in Poland. Casually, unbearably and possibly flippantly about software engineering. With @kwasniew, @kubek2k, @peel and their guests - the weeds of polish IT."
  },
  {
    "name": "devPod",
    "url": "https://devpod.org/",
    "description": "Turkish podcast talking about modern software technology, programming languages, conferences, Linux, Unix, iOS, MacOS, Python, Ruby, Git etc. Hosted by Uğur Özyılmazel(Vigo) and Üstün Özgür."
  },
  {
    "name": "Frontend Friday – A podcast and meeting about HTML, the Web, and related topics. From Oulu, Finland.",
    "url": "http://frontendfriday.fi/"
  },
  {
    "name": "Webbidevaus.fi",
    "url": "https://webbidevaus.fi/",
    "description": "Weekly podcast about web-development. Hosted by Antti Mattila and Riku Rouvila."
  },
  {
    "name": "Rebuild",
    "url": "http://rebuild.fm/",
    "description": "A Podcast by Tatsuhiko Miyagawa. Talking about Tech, Software Development and Gadgets."
  },
  {
    "name": "Ceritanya Developer Podcast  -Cerita Developer inspiratif tentang bagaimana mereka memulai menjadi developer.",
    "url": "https://ceritanyadeveloper.com/"
  },
  {
    "name": "Teh atau Kopi",
    "url": "https://tehataukopi.club/",
    "description": "Belajar di luar sekolah"
  },
  {
    "name": "Developer Muslim",
    "url": "https://devmuslim.id/",
    "description": "Jurnal seorang developer muslim"
  },
  {
    "name": "Teman Macet",
    "url": "http://temanmacet.com/",
    "description": "Tentang programming dan industri informatika."
  },
  {
    "name": "De Appels en Peren Show",
    "url": "http://appelsenperenshow.nl/",
    "description": "Een talkshow over en uit de toekomst. Technologie, media, cultuur en alles wat verder de toekomst mogelijk maakt."
  },
  {
    "name": "Tech45",
    "url": "https://tech45.eu/",
    "description": "Tech45 is een wekelijkse technologiepodcast. In ongeveer 45 minuten loodst een panel geeks je door het interessantste technieuws van de voorbije week."
  },
  {
    "name": "TechSnacks",
    "url": "https://techsnacks.nl/",
    "description": "De enige techpodcast op snackformaat!"
  },
  {
    "name": "Met Nerds om Tafel",
    "url": "https://www.metnerdsomtafel.nl/",
    "description": "Wekelijkse podcast waarin nerds Spa Rood drinken en praten over tech-onderwerpen. Met regelmatig gastnerds en vaste tafelnerds Daniel Kegel, Floris Diemel, Joost Schellevis, Jurian Ubachs en Randal Peelen."
  },
  {
    "name": "ZeepCast",
    "url": "https://twitter.com/Zeepcast",
    "description": "Een podcast over de laatste ontwikkelingen in wetenschap, technologie & popculture. Gehost door Sander Bijleveld & David van Dorsten."
  },
  {
    "name": "Ask Developer",
    "url": "http://www.askdeveloper.com/",
    "description": "An online audio podcast in Egyptian Arabic dialect discusses the technology and software development landscape in Egypt and Middle East."
  },
  {
    "name": "Null++",
    "url": "https://nullplus.plus",
    "description": "An Egyptian Arabic podcast Powered By Cairo's Facebook Developers Circle Co-Leads. This podcast aims to provide valuable techie bites for MENA's Software Professionals and help them step up with their careers."
  },
  {
    "name": "Tech and Coffee",
    "url": "https://anchor.fm/iahmadzain/episodes/S1E10-Tech-Chat-with-Ahmed-Essam--The-Pragmatic-Programmer-eie4eo",
    "description": "About technology and its pioneers."
  },
  {
    "name": "Essam Cafe",
    "url": "https://essamcafe.com/",
    "description": "Weekly episodes with people, possibly we agree or disagree with them, it is important to learn and benefit from some and a small weekly episode on a random topic from the Twitter nominations."
  },
  {
    "name": "Tech Tracks An Egyptian Arabic podcast discussess technology news.",
    "url": "https://podu.me/shows/show/77/tech-tracks"
  },
  {
    "name": "Khedr W Business",
    "url": "https://castbox.fm/channel/id2453686?country=us",
    "description": "Topics are in two axes: 1- Management and entrepreneurship, and what is related to them in terms of investment, operation, marketing, partnership, etc. 2- Life, relationships, success, and methods drawn, and how we live it in a way that ensures reconciliation with oneself."
  },
  {
    "name": "State of E-commerce",
    "url": "https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMTA1ODk1LnJzcw?sa=X&ved=2ahUKEwixm-6X7ITsAhUR_hoKHTmpBaMQjs4CKAB6BAgBEBA",
    "description": "An Arabic podcast for e-commerce, business and marketing to help business owners measure, understand and develop their online sales."
  },
  {
    "name": "Pocket Casts",
    "url": "https://www.pocketcasts.com/"
  },
  {
    "name": "Overcast",
    "url": "https://overcast.fm",
    "description": "An elegant podcast tracker for iOS and the web"
  },
  {
    "name": "AntennaPod",
    "url": "http://antennapod.org",
    "description": "(Android and Open Source)"
  },
  {
    "name": "Soundwaves",
    "url": "https://github.com/bottiger/SoundWaves",
    "description": "(Android and Open Source)"
  },
  {
    "name": "DoggCatcher",
    "url": "http://www.doggcatcher.com",
    "description": "Android Podcast player"
  },
  {
    "name": "gPodder / gPodder Director",
    "url": "https://gpodder.github.io",
    "description": "(Multi-plataform Open Source and Podcast Directory)"
  },
  {
    "name": "RadioPublic",
    "url": "https://radiopublic.com/"
  },
  {
    "name": "Podcast Addict",
    "url": "https://podcastaddict.com/app",
    "description": "Android Podcast player"
  }
]
