[
  {
    "name": "continuousIntegration",
    "url": "http://martinfowler.com/articles/continuousIntegration.html"
  },
  {
    "name": "continuousdelivery",
    "url": "http://continuousdelivery.com"
  },
  {
    "name": "software integration",
    "url": "https://en.wikipedia.org/wiki/System_integration"
  },
  {
    "name": "devopsdays",
    "url": "http://www.devopsdays.org"
  },
  {
    "name": "ci cheatsheet",
    "url": "https://dzone.com/refcardz/continuous-integration"
  },
  {
    "name": "Jenkins  An extendable open source continuous integration server",
    "url": "http://jenkins-ci.org"
  },
  {
    "name": "Solano CI  Faster Continuous Integration and Deployment with patented auto-parallelization. See results 10 to 80x faster. 14-day free trial. No credit card required.",
    "url": "https://www.solanolabs.com"
  },
  {
    "name": "Concourse Rather than a myriad of checkboxes, pipelines are defined as a single declarative config file",
    "url": "https://concourse.ci"
  },
  {
    "name": "BuildForge  Automate and accelerate build and release processes",
    "url": "https://jazz.net/downloads/rational-build-forge/"
  },
  {
    "name": "ElectricFlow  ElectricFlow/ElectricCommander gives distributed teams shared control and visibility into infrastructure, tool chains and processes. It accelerates and automates the software delivery process to enable agility, predictability and security across many build-test-deploy pipelines",
    "url": "http://electric-cloud.com/products/electricflow/"
  },
  {
    "name": "Teamcity  Ready to work, extensible\nand developer-friendly build server out of the box",
    "url": "http://www.jetbrains.com/teamcity/index.html"
  },
  {
    "name": "bamboo  Bamboo does more than just run builds and tests. It connects issues, commits, test results, and deploys so the whole picture is available to your entire product team",
    "url": "https://www.atlassian.com/software/bamboo"
  },
  {
    "name": "go  Automate and streamline the build-test-release cycle for worry-free, continuous delivery of your product",
    "url": "http://www.go.cd"
  },
  {
    "name": "hudson  the previous one of Jenkins",
    "url": "http://hudson-ci.org"
  },
  {
    "name": "openbuildservice  The Open Build Service (OBS) is a generic system to build and distribute binary packages from sources in an automatic, consistent and reproducible way. You can release packages as well as updates, add-ons, appliances and entire distributions for a wide range of operating systems and hardware architectures",
    "url": "http://openbuildservice.org"
  },
  {
    "name": "buildbot   Buildbot is a continuous integration system designed to automate the build/test cycle. By automatically rebuilding and testing the tree each time something has changed, build problems are pinpointed quickly, before other developers are inconvenienced by the failure",
    "url": "http://trac.buildbot.net"
  },
  {
    "name": "Parabuild  Parabuild is an enterprise software build and release management system that helps software teams to release on time by providing them practically unbreakable release builds and Continuous Integration",
    "url": "http://www.viewtier.com/index.htm"
  },
  {
    "name": "FinalBuilder  Automating your Build process is simple with FinalBuilder. With FinalBuilder you don't need to edit xml, or  write scripts. Visually define and debug your build scripts, then schedule them with windows scheduler, or integrate them with Continua CI, Jenkins or any other CI Server",
    "url": "https://www.finalbuilder.com/"
  },
  {
    "name": "VisualBuild  Visual Build enables developers and build masters to easily create an automated, repeatable build process",
    "url": "http://www.kinook.com/VisBuildPro/"
  },
  {
    "name": "cruisecontrol  CruiseControl.NET, an Automated Continuous Integration server, implemented using the .NET Framework",
    "url": "http://www.cruisecontrolnet.org"
  },
  {
    "name": "continuum Apache Continuum™ is an enterprise-ready continuous integration server with features such as automated builds, release management, role-based security, and integration with popular build tools and source control management systems",
    "url": "http://continuum.apache.org/"
  },
  {
    "name": "quickbuild  GitHub integration. Perforce shelve support. Coverity report rendering. Subversion external change retrieval. Resource access info. Display reasons for waiting steps. Custom build and request columns. Favorite dash board list. Inheritable environment variables.And much more...",
    "url": "http://www.pmease.com/"
  },
  {
    "name": "rexify  perl Deployment & Configuration Management",
    "url": "http://www.rexify.org//"
  },
  {
    "name": "SimpleCI Docker-based self-hosted ci system. Supports distributed build cache, external providers (GCE), real-time build log, etc.",
    "url": "https://github.com/simpleci/simpleci"
  },
  {
    "name": "pulse no free version.",
    "url": "http://zutubi.com"
  },
  {
    "name": "PHP Censor PHP Censor is a open source self-hosted continuous integration server for PHP projects (Fork of PHPCI)",
    "url": "https://github.com/corpsee/php-censor"
  },
  {
    "name": "rundeck Rundeck features fine-grain access controls, a built-in job scheduler, and the ability to define workflows that dispatch commands and scripts to your nodes.",
    "url": "http://rundeck.org"
  },
  {
    "name": "closeheat Static website integration with GitHub and Cloud development environment",
    "url": "http://closeheat.com"
  },
  {
    "name": "travis-ci ci server for github and bitbuckets",
    "url": "https://travis-ci.org"
  },
  {
    "name": "cloudbees the Enterprise Jenkins Company",
    "url": "https://www.cloudbees.com/"
  },
  {
    "name": "elasticbox  A DevOps approach that focuses on reusable application components as a service, and enables operations to provide IT as a Service",
    "url": "https://elasticbox.com"
  },
  {
    "name": "coveralls  Track your project's code coverage over time, changes to files, and badge your GitHub repo",
    "url": "https://coveralls.io"
  },
  {
    "name": "shippable  Hosted continuous integration and deployment service built on docker",
    "url": "https://app.shippable.com/"
  },
  {
    "name": "circleci  Continuous Integration for web apps.",
    "url": "https://circleci.com"
  },
  {
    "name": "buildbox  Simple self-hosted Continuous Integration",
    "url": "https://buildkite.com/"
  },
  {
    "name": "drone Open source continuous integration platform built on Docker",
    "url": "https://drone.io"
  },
  {
    "name": "appveyor  Continuous Integration and Deployment service for busy Windows",
    "url": "http://www.appveyor.com"
  },
  {
    "name": "snap-ci Easy builds, deployed when you want",
    "url": "https://snap-ci.com"
  },
  {
    "name": "codeship  Continuous Integration and Delivery made simple",
    "url": "https://codeship.com"
  },
  {
    "name": "githost  Painless GitLab CE & CI Hosting",
    "url": "https://githost.io"
  },
  {
    "name": "testling Automatic browser tests on every push",
    "url": "https://ci.testling.com"
  },
  {
    "name": "magnum-ci  Hosted Continuous Integration and Delivery Platform for private repositories",
    "url": "https://magnum-ci.com"
  },
  {
    "name": "wercker  Test and deploy your applications with ease",
    "url": "http://wercker.com"
  },
  {
    "name": "codecov  Continuous code coverage. Featuring browser extenstions and awesome pull request commentsto track coverage over time on your GitHub/Bitbucket/Gitlab repo",
    "url": "https://codecov.io"
  },
  {
    "name": "GitLab CI",
    "url": "https://about.gitlab.com/gitlab-ci/",
    "description": "Based off of ruby. They also provide GitLab, which manages git repositories."
  },
  {
    "name": "IBM DevOps Services",
    "url": "https://hub.jazz.net",
    "description": "Develop, track, plan, and deploy software onto the IBM Bluemix cloud platform."
  },
  {
    "name": "deploybot",
    "url": "https://deploybot.com",
    "description": "Instantly build and ship code anywhere in one consistent process for your entire team."
  },
  {
    "name": "Semaphore CI — Fast and easy to use continuous integration and deployment service with native Docker support.",
    "url": "https://semaphoreci.com/"
  },
  {
    "name": "flow.ci",
    "url": "https://flow.ci/",
    "description": "flow.ci, hosted continuous integration and delivery service for innovators who shape the future."
  },
  {
    "name": "CatLight  Build status monitor for Jenkins, TeamCity, Travis CI, Appveyor and TFS",
    "url": "https://catlight.io"
  },
  {
    "name": "GridWiki  wiki page for Grid",
    "url": "http://wiki.gridengine.info/wiki/index.php/Main_Page"
  },
  {
    "name": "UGE  Univa workload management solutions maximize the value of existing computing resources by efficiently sharing workloads across thousands of servers",
    "url": "http://www.univa.com"
  },
  {
    "name": "SGE  Grid Engine is typically used on a computer farm or high-performance computing (HPC) cluster and is responsible for accepting, scheduling, dispatching, and managing the remote and distributed execution of large numbers of standalone, parallel or interactive user jobs. It also manages and schedules the allocation of distributed resources such as processors, memory, disk space, and software licenses",
    "url": "http://gridscheduler.sourceforge.net"
  },
  {
    "name": "LSF  Platform Load Sharing Facility (or simply LSF) is a workload management platform, job scheduler, for distributed HPC environments. It can be used to execute batch jobs on networked Unix and Windows systems on many different architectures",
    "url": "http://www-03.ibm.com/systems/platformcomputing/products/lsf/"
  },
  {
    "name": "vmwarevshpere  VMware vSphere (formerly VMware Infrastructure 4) is VMware's cloud computing virtualization operating system",
    "url": "http://www.vmware.com/products/vsphere"
  },
  {
    "name": "ctrixserver  XenServer is the best server virtualization platform for public and private clouds, powering 4 of the 5 largest hosting provider clouds.  Built with scale, security and multi-tenancy in mind, XenServer allows for even greater flexibility and cost efficiency",
    "url": "http://www.citrix.com/products/xenserver/overview.html"
  },
  {
    "name": "amazon Scalable, pay-as-you-go compute capacity in the cloud",
    "url": "http://aws.amazon.com/ec2/"
  },
  {
    "name": "mesosphere-dc/os As a datacenter operating system, DC/OS is itself a distributed system, a cluster manager, a container platform, and an operating system.",
    "url": "mesosphere.com"
  },
  {
    "name": "boxstarter Repeatable, reboot resilient windows environment installations made easy using Chocolatey packages.",
    "url": "http://boxstarter.org/"
  },
  {
    "name": "vagrantup  Create and configure lightweight, reproducible, and portable development environments.",
    "url": "https://www.vagrantup.com/"
  },
  {
    "name": "veewee Easing the building of vagrant boxes",
    "url": "https://github.com/jedi4ever/veewee"
  },
  {
    "name": "git  Git is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency",
    "url": "http://git-scm.com"
  },
  {
    "name": "perforce  Industry’s most reliable and proven platform for versioning code, images, documents... everything",
    "url": "https://www.perforce.com/"
  },
  {
    "name": "clearcase  IBM Rational ClearCase is a software configuration management solution that provides version control, workspace management, parallel development support, and build auditing",
    "url": "http://www-03.ibm.com/software/products/en/clearcase"
  },
  {
    "name": "mercurial  Mercurial is a free, distributed source control management tool. It efficiently handles projects of any size and offers an easy and intuitive interface",
    "url": "https://www.mercurial-scm.org/"
  },
  {
    "name": "svn  Subversion is an open source version control system",
    "url": "http://subversion.apache.org"
  },
  {
    "name": "gitlab  Open source self-hosted Git management software",
    "url": "https://about.gitlab.com/"
  },
  {
    "name": "github  Powerful collaboration, review, and code management for open source and private development projects.",
    "url": "https://github.com"
  },
  {
    "name": "bitbuckets  Plant your code in the cloud. Watch it grow.",
    "url": "https://bitbucket.org"
  },
  {
    "name": "teamfoundationservice  Visual Studio Online, based on the capabilities of Team Foundation Server with additional cloud services, is the online home for your development projects. Get up and running in minutes on our cloud infrastructure without having to install or configure a single server. Visual Studio Online connects to Visual Studio, Eclipse, Xcode, and other Git clients to support development for a variety of platforms and languages",
    "url": "http://tfs.visualstudio.com"
  },
  {
    "name": "phabricator  Phabricator is a collection of open source web applications that help software companies build better software.",
    "url": "http://phabricator.org/"
  },
  {
    "name": "IBM DevOps Services",
    "url": "https://hub.jazz.net",
    "description": "Store, manage, edit, and collaborate on your source code. Then deploy onto the IBM Bluemix cloud platform."
  },
  {
    "name": "codecollaborator Collaborator helps development, testing and management teams work together to produce high quality code",
    "url": "http://smartbear.com/product/collaborator/overview/"
  },
  {
    "name": "crucible  Code reviews = quality code. Review code, discuss changes, share knowledge, and identify defects with Crucible's flexible review workflow. It's code review made easy for Subversion, CVS, Perforce, and more",
    "url": "https://www.atlassian.com/software/crucible/overview"
  },
  {
    "name": "reviewboard  Review Board takes the pain out of code review, saving you time, money, and sanity so you can focus on making great software",
    "url": "https://www.reviewboard.org/"
  },
  {
    "name": "codestriker  Codestriker is an open-sourced web application which supports online code reviewing. Traditional document reviews are supported, as well as reviewing diffs generated by an SCM (Source Code Management) system and plain unidiff patches",
    "url": "http://codestriker.sourceforge.net"
  },
  {
    "name": "getbarkeep a fast, fun way to review code",
    "url": "http://getbarkeep.org"
  },
  {
    "name": "gerrit Gerrit is a web based code review system, facilitating online code reviews for projects using the Git version control system",
    "url": "https://code.google.com/p/gerrit/"
  },
  {
    "name": "Codebrag  Codebrag is a simple code review tool that makes the process work for your team.",
    "url": "http://www.codebrag.com/"
  },
  {
    "name": "Upsource Polyglot Code Review Tool, featuring code insight for PHP, JavaScript and Kotlin, GitHub integration, automated workflows, integration with CI servers",
    "url": "https://www.jetbrains.com/upsource/"
  },
  {
    "name": "Ebert Ebert does continuous static analysis of your GitHub repositories and delivers it straight to your Pull Requests, helping your team to focus on what's important and deliver better software.",
    "url": "https://ebertapp.io"
  },
  {
    "name": "gnumake GNU Make is a tool which controls the generation of executables and other non-source files of a program from the program's source files",
    "url": "http://www.gnu.org/software/make/"
  },
  {
    "name": "gnuautoconf Autoconf is an extensible package of M4 macros that produce shell scripts to automatically configure software source code packages",
    "url": "http://www.gnu.org/software/autoconf/"
  },
  {
    "name": "mozillabuildtools  The Mozilla build system, like the rest of the Mozilla codebase, is cross-platform. It uses traditional Unix-style autoconf and make tools to build the various applications (even on non-unix operating systems)",
    "url": "https://developer.mozilla.org/en-US/docs/Mozilla/Developer_guide/Build_Instructions"
  },
  {
    "name": "scons  SCons is an Open Source software construction tool—that is, a next-generation build tool. Think of SCons as an improved, cross-platform substitute for the classic Make utility with integrated functionality similar to autoconf/automake and compiler caches such as ccache. In short, SCons is an easier, more reliable and faster way to build software",
    "url": "http://www.scons.org"
  },
  {
    "name": "cmake  cmake offers robust, cross-platform software development solutions. Find out how we can help your team efficiently manage the build, test, and package process for your software project",
    "url": "https://cmake.org/"
  },
  {
    "name": "msbuild  The Microsoft Build Engine is a platform for building applications. This engine, which is also known as MSBuild, provides an XML schema for a project file that controls how the build platform processes and builds software. Visual Studio uses MSBuild, but it doesn't depend on Visual Studio. By invoking msbuild.exe on your project or solution file, you can orchestrate and build products in environments where Visual Studio isn't installed",
    "url": "http://msdn.microsoft.com/en-us/library/dd393574.aspx"
  },
  {
    "name": "ant  Ant can be used to pilot any type of process which can be described in terms of targets and tasks. The main known usage of Ant is the build of Java applications.",
    "url": "http://ant.apache.org"
  },
  {
    "name": "maven  Apache Maven is a software project management and comprehension tool. Based on the concept of a project object model (POM), Maven can manage a project's build, reporting and documentation from a central piece of information.",
    "url": "http://maven.apache.org"
  },
  {
    "name": "gradle   Gradle is build automation evolved. Gradle can automate the building, testing, publishing, deployment and more of software packages or other types of projects such as generated static websites, generated documentation or indeed anything else.",
    "url": "http://gradle.org/"
  },
  {
    "name": "ElectricacCelerator   Continuous Delivery isn’t continuous if builds and tests take too long to complete. ElectricAccelerator speeds up builds and tests by up to 20X, improving software time to market, infrastructure utilization and developer productivity",
    "url": "http://electric-cloud.com/products/electricaccelerator"
  },
  {
    "name": "SBT  sbt is an open source build tool for Scala and Java projects.",
    "url": "http://www.scala-sbt.org/index.html"
  },
  {
    "name": "static tools wiki wiki page",
    "url": "https://en.wikipedia.org/wiki/List_of_tools_for_static_code_analysis"
  },
  {
    "name": "coverity  Continually measure and improve code quality and security across your development organization",
    "url": "http://www.coverity.com/"
  },
  {
    "name": "fxcop  FxCop is an application that analyzes managed code assemblies (code that targets the .NET Framework common language runtime) and reports information about the assemblies, such as possible design, localization, performance, and security improvements",
    "url": "http://msdn.microsoft.com/en-us/library/bb429476%28VS.80%29.aspx"
  },
  {
    "name": "cpd Duplicate code can be hard to find, especially in a large project. But PMD's Copy/Paste Detector (CPD) can find it for you",
    "url": "http://pmd.sourceforge.net/pmd-4.3.0/cpd.html"
  },
  {
    "name": "sonar  SonarQube is an open platform to manage code quality",
    "url": "http://www.sonarqube.org"
  },
  {
    "name": "findbugs  Find Bugs in Java Programs",
    "url": "http://findbugs.sourceforge.net"
  },
  {
    "name": "checkstyle  Checkstyle is a development tool to help programmers write Java code that adheres to a coding standard",
    "url": "http://checkstyle.sourceforge.net"
  },
  {
    "name": "dynamic tools wiki  wiki page",
    "url": "https://en.wikipedia.org/wiki/Dynamic_program_analysis"
  },
  {
    "name": "valgrind  automatically detect many memory management and threading bugs, and profile your programs in detail",
    "url": "http://valgrind.org"
  },
  {
    "name": "performance tools wiki  wiki page",
    "url": "https://en.wikipedia.org/wiki/List_of_performance_analysis_tools"
  },
  {
    "name": "code coverage wiki  wiki page",
    "url": "https://en.wikipedia.org/wiki/Code_coverage"
  },
  {
    "name": "Testingautomation  test automation wiki page",
    "url": "https://en.wikipedia.org/wiki/Test_automation"
  },
  {
    "name": "softwareqatest FAQ page",
    "url": "http://www.softwareqatest.com"
  },
  {
    "name": "qaforums  SQA Forums",
    "url": "http://www.qaforums.com"
  },
  {
    "name": "opensourcetesting  open source software testing tools, news and disccussions",
    "url": "http://www.opensourcetesting.org"
  },
  {
    "name": "selenium  Selenium automates browsers",
    "url": "http://www.seleniumhq.org"
  },
  {
    "name": "Monkey Test It Free automated website tester with CURLable API",
    "url": "https://monkeytest.it"
  },
  {
    "name": "Assertible Continuous post deployment testing for GitHub",
    "url": "https://assertible.com"
  },
  {
    "name": "installshield  World's #1 Software Installation Solution-Build Reliable MSI Installers for Windows Applications",
    "url": "http://www.installshield.com"
  },
  {
    "name": "NSIS  NSIS (Nullsoft Scriptable Install System) is a professional open source system to create Windows installers. It is designed to be as small and flexible as possible and is therefore very suitable for internet distribution",
    "url": "http://nsis.sourceforge.net/Main_Page"
  },
  {
    "name": "rpm  The RPM Package Manager (RPM) is a powerful command line driven package management system capable of installing, uninstalling, verifying, querying, and updating computer software packages",
    "url": "http://rpm.org"
  },
  {
    "name": "yum  Yum is an automatic updater and package installer/remover for rpm systems",
    "url": "http://yum.baseurl.org"
  },
  {
    "name": "fpm Effing package management! Build packages for multiple platforms (deb, rpm, etc) with great ease and sanity.",
    "url": "https://github.com/jordansissel/fpm"
  },
  {
    "name": "wix The most powerful set of tools available to create your Windows installation experience.",
    "url": "http://wixtoolset.org/"
  },
  {
    "name": "packer  Packer is a tool for creating identical machine images for multiple platforms from a single source configuration.",
    "url": "https://www.packer.io/"
  },
  {
    "name": "jfrog s the first Binary Repository Management solution, Artifactory has changed the way binaries are controlled, stored and managed throughout the software release cycle",
    "url": "https://www.jfrog.com/"
  },
  {
    "name": "xl-deploy  Agentless, Model-based App Deployment",
    "url": "https://xebialabs.com/products/xl-deploy"
  },
  {
    "name": "Jenkinsdeployplugin   deploy to tomcat",
    "url": "https://wiki.jenkins-ci.org/display/JENKINS/Deploy%20Plugin"
  },
  {
    "name": "bintray  The fastest and most reliable way to automate the distribution of your software releases",
    "url": "https://bintray.com"
  },
  {
    "name": "sl-release  Orchestrate your Continuous Delivery pipelines. Simple. Flexible. End-to-End",
    "url": "https://xebialabs.com/products/xl-release"
  },
  {
    "name": "archiva  Apache Archiva™ is an extensible repository management software that helps taking care of your own personal or enterprise-wide build artifact repository. It is the perfect companion for build tools such as Maven, Continuum, and ANT",
    "url": "http://archiva.apache.org/index.cgi"
  },
  {
    "name": "nexus  The use of repository managers (also known as component managers) is helping software development teams achieve simple gains in speed, efficiency, and quality of their operations",
    "url": "http://www.sonatype.com/nexus"
  },
  {
    "name": "chocolatey Chocolatey NuGet is a Machine Package Manager, somewhat like apt-get, but built with Windows in mind",
    "url": "https://chocolatey.org/"
  },
  {
    "name": "pulp  Pulp is a platform for managing repositories of content, such as software packages, and pushing that content out to large numbers of consumers.",
    "url": "http://www.pulpproject.org/"
  },
  {
    "name": "herd A single-command bittorrent distribution system, based on Twitter's Murder",
    "url": "https://github.com/russss/Herd"
  },
  {
    "name": "murder  Large scale server deploys using BitTorrent and the BitTornado library from twitter.com",
    "url": "https://github.com/lg/murder"
  },
  {
    "name": "Ansible Simple infrastructure management tool via humam readable playbooks",
    "url": "http://www.ansible.com"
  },
  {
    "name": "Chef  Fast, scalable and flexible software for data center automation",
    "url": "https://www.chef.io/chef/"
  },
  {
    "name": "SaltStack Radically simple configuration-management, application deployment, task-execution, and multi-node orchestration engine",
    "url": "http://saltstack.com/community/"
  },
  {
    "name": "apache  Apache httpd has been the most popular web server on the Internet since April 1996",
    "url": "https://httpd.apache.org"
  },
  {
    "name": "nginx A high performance free open source web server powering busiest sites on the Internet",
    "url": "http://nginx.org"
  },
  {
    "name": "tomcat  An open source software implementation of the Java Servlet and JavaServer Pages technologies",
    "url": "http://tomcat.apache.org"
  },
  {
    "name": "jetty\nJetty provides a Web server and javax.servlet container, plus support for SPDY, WebSocket, OSGi, JMX, JNDI, JAAS and many other integrations",
    "url": "http://www.eclipse.org/jetty/"
  },
  {
    "name": "HAProxy",
    "url": "http://www.haproxy.org/",
    "description": "Software based load Balancing, SSL offloading and performance optimization, compression, and general web routing."
  },
  {
    "name": "awesome-shell",
    "url": "https://github.com/itech001/awesome-shell/blob/master/README.md"
  },
  {
    "name": "awesome-python",
    "url": "https://github.com/vinta/awesome-python"
  },
  {
    "name": "awesome-perl",
    "url": "https://github.com/hachiojipm/awesome-perl"
  },
  {
    "name": "awesome-sysadmin",
    "url": "https://github.com/kahun/awesome-sysadmin"
  },
  {
    "name": "docker Docker",
    "url": "https://www.docker.com",
    "description": "An open platform for distributed applications for developers and sysadmins"
  },
  {
    "name": "suseapplication tools to create suse applications",
    "url": "https://www.suse.com/products/susestudio/"
  },
  {
    "name": "liquibase source control for your database",
    "url": "http://www.liquibase.org"
  },
  {
    "name": "flywaydb Database Migrations Made Easy",
    "url": "http://flywaydb.org"
  },
  {
    "name": "nextep NeXtep Softwares provides software solutions for the industrialization of your database developments and deployments. Our goal is to increase the productivity of your development teams by taking control of your developments' lifecycle and by automating your deployment and test processes",
    "url": "http://www.nextep-softwares.com"
  },
  {
    "name": "dbdeploy dbdeploy is a Database Change Management tool. It’s for developers or DBAs who want to evolve their database design – or refactor their database – in a simple, controlled, flexible and frequent manner",
    "url": "http://dbdeploy.com"
  },
  {
    "name": "dbmaestro  Controlled Database Continuous Delivery is Our Business",
    "url": "http://www.dbmaestro.com/"
  },
  {
    "name": "infoq",
    "url": "http://www.infoq.com"
  },
  {
    "name": "stackoverflow",
    "url": "http://stackoverflow.com"
  },
  {
    "name": "devops submit",
    "url": "http://devopssummit.sys-con.com"
  },
  {
    "name": "Securing DevOps",
    "url": "https://manning.com/books/securing-devops?a_aid=securingdevops&a_bid=1353bcd8",
    "description": "A book on utilizing CI/CD techniques to improve the security of web applications and their infrastructure."
  },
  {
    "name": "awesome",
    "url": "https://github.com/sindresorhus/awesome"
  },
  {
    "name": "awesome-awesome",
    "url": "https://github.com/emijrp/awesome-awesome"
  },
  {
    "name": "awesome-awesomeness",
    "url": "https://github.com/bayandin/awesome-awesomeness"
  },
  {
    "name": "sysadmin",
    "url": "https://github.com/itech001/awesome-sysadmin"
  },
  {
    "name": "ci tools compare",
    "url": "https://en.wikipedia.org/wiki/Comparison_of_continuous_integration_software"
  },
  {
    "name": "ci tools compare2",
    "url": "https://github.com/ciandcd/Continuous-Integration-services/blob/master/continuous-integration-services-list.md"
  },
  {
    "name": "ci tools compare 3",
    "url": "https://github.com/ligurio/Continuous-Integration-services"
  },
  {
    "name": "awesome-docker",
    "url": "https://github.com/veggiemonk/awesome-docker"
  }
]
