[
  {
    "name": "Cognito | https://cognitohq.com | @getcognito | Frictionless, modern identity verification that starts with just a phone number.",
    "url": "https://cognitohq.com"
  },
  {
    "name": "BlockScore | https://blockscore.com | @getblockscore | $1/verification",
    "url": "https://blockscore.com",
    "description": "$5/verification | Individual ID verifications and company verifications."
  },
  {
    "name": "BrowserStack | https://www.browserstack.com | @browserstack $35/mo",
    "url": "https://www.browserstack.com",
    "description": "$359/mo | Live, web-based browser testing."
  },
  {
    "name": "Litmus | http://litmus.com | @litmusapp | $79/mo",
    "url": "http://litmus.com",
    "description": "$399/mo | Lets you preview your campaigns across 30+ real email clients and devices in minutes."
  },
  {
    "name": "Sauce Labs | https://saucelabs.com | @saucelabs | $12/mo",
    "url": "https://saucelabs.com",
    "description": "$149/mo | Run your web and mobile app tests across hundreds of real browsers and platforms instantly."
  },
  {
    "name": "EmailOnAcid | https://www.emailonacid.com | @emailonacid | $45/mo",
    "url": "https://www.emailonacid.com",
    "description": "$295/mo | Quickly ensure that your emails don't look like crap in any email client."
  },
  {
    "name": "Rainforest QA | https://www.rainforestqa.com | @rainforestqa | $500/mo",
    "url": "https://www.rainforestqa.com",
    "description": "$2000/mo | Insanely simple integration testing."
  },
  {
    "name": "DebugMail | https://debugmail.io | Free | Easy to use fake mail (SMTP) server for developers.",
    "url": "https://debugmail.io"
  },
  {
    "name": "BitBucket Issues | https://bitbucket.org | @bitbucket | $10/mo",
    "url": "https://bitbucket.org",
    "description": "$200/mo | Unlimited private code repositories | Host, manage, and share Git and Mercurial repositories in the cloud. Free, unlimited private repositories for up to 5 developers give teams the flexibility to grow and code without restrictions."
  },
  {
    "name": "BugHerd | https://bugherd.com | @bugherd | $29/mo",
    "url": "https://bugherd.com",
    "description": "$180/mo | Turn client feedback into actionable tasks. | BugHerd lets you quickly see, at a glance, how your project is going and what everyone is working on. The task board lets you keep team members in sync by assigning and scheduling tasks with a simple drag and drop."
  },
  {
    "name": "Bugify | $59 | https://bugify.com | @bugify | Self hosted issue management system. One-time payment. Written in PHP.",
    "url": "https://bugify.com"
  },
  {
    "name": "GitHub Issues | https://github.com | @GitHub | $7/mo",
    "url": "https://github.com",
    "description": "$50/mo | Build software better, together. | GitHub is the largest code host on the planet with over 13.2 million repositories. Large or small, every repository comes with the same powerful tools. These tools are open to the community for public projects and secure for private projects."
  },
  {
    "name": "GitLab Issues | https://about.gitlab.com | @gitlabhq | free |GitLab is open source software to collaborate on code that is used by more than 100,000 organisations worldwide. Unlimited private repositories on GitLab.com or host your own instance. Enterprise Edition includes deep LDAP support.",
    "url": "https://about.gitlab.com"
  },
  {
    "name": "Huboard | https://huboard.com | @huboard | $7/mo",
    "url": "https://huboard.com",
    "description": "$24/mo | GitHub issues made awesome"
  },
  {
    "name": "JIRA | https://www.atlassian.com/software/jira | @JIRA | $10/mo hosted",
    "url": "https://www.atlassian.com/software/jira",
    "description": "$10/yr self-hosted | JIRA is the tracker for teams planning and building great products. Thousands of teams choose JIRA to capture and organize issues, assign work, and follow team activity. At your desk or on the go with the new mobile interface, JIRA helps your team get the job done."
  },
  {
    "name": "Lighthouse | http://lighthouseapp.com | @lighthouseapp | $25/mo",
    "url": "http://lighthouseapp.com",
    "description": "$100/mo | Whether you're a large company or a small bootstrapped team, Lighthouse is the perfect ticket tracking solution. | Collaborate effortlessly on projects. Whether you’re a team of 5 or studio of 50, Lighthouse will help you keep track of your project development with ease."
  },
  {
    "name": "Pinitto.me | https://pinitto.me | Post It Notes on a virtual corkboard (OSS)",
    "url": "https://pinitto.me"
  },
  {
    "name": "Sifter | http://sifterapp.com | @sifterapp | $29/mo",
    "url": "http://sifterapp.com",
    "description": "$149/mo | Less configuring. More doing. | We've put in the time researching bug tracking to help create the simplest possible workflow for you to get work done. From time-to-time we even blog about some of our ideas around this optimal bug tracking process…"
  },
  {
    "name": "Usersnap | https://usersnap.com | @usersnap | $19/mo-$99/mo | Usersnap is visual bug reporting for anyone working on web projects. | Get visual feedback and precious browser information with every bug report to reproduce and fix them even faster.",
    "url": "https://usersnap.com"
  },
  {
    "name": "Aha! | https://www.aha.io | @aha_io | $69/mo, Ask about startup plan | The new way to create brilliant product strategy and visual roadmaps.",
    "url": "https://www.aha.io"
  },
  {
    "name": "Sprintly | http://sprint.ly | @sprintly | $49/mo- $399/mo | Don't ask how projects are going.\nWatch how they're going in real-time. | Use our elegant interface to prioritize, tag, manage, estimate,\nand measure your software developers' progress in real-time.",
    "url": "http://sprint.ly"
  },
  {
    "name": "Podio | https://podio.com | @Podio | free | Teamwork made easy | News and views from the team behind Podio",
    "url": "https://podio.com",
    "description": "changing the way the world works since 2009."
  },
  {
    "name": "Flow | https://www.getflow.com | @flowapp | $19/mo",
    "url": "https://www.getflow.com",
    "description": "$249/mo | Stop managing projects from your inbox. | Flow is a collaborative task management app for the web and iPhone."
  },
  {
    "name": "Basecamp | https://basecamp.com | @37signals | $20/mo",
    "url": "https://basecamp.com",
    "description": "$150/mo | The official account for Basecamp®. Helping Basecamp customers every Mon-Fri 9am-6pm CT! | Basecamp to help organize the store design, develop fixtures, and manage craftspeople. Primarily through word-of-mouth alone, Basecamp has become the world’s #1 project management tool."
  },
  {
    "name": "Apollo | http://www.apollohq.com | @applicomhq | $23/mo",
    "url": "http://www.apollohq.com",
    "description": "$148/mo | Integrated Project and Contact Management Done Right | Apollo is project and contact management done right. Using Apollo, you will realise that it's built to help you get things done, quickly and efficiently. With Apollo, you will always know where your projects, your contacts and your life are at and you will feel on top of everything — regardless of how hectic your schedule is."
  },
  {
    "name": "Pivotal Tracker | https://www.pivotaltracker.com | @pivotaltracker | $7/mo",
    "url": "https://www.pivotaltracker.com",
    "description": "$175/mo | BUILD BETTER SOFTWARE FASTER | Break your project down into bite-sized stories, which get your product closer to the business goal. Use points to estimate each story’s relative complexity and prioritize it in the backlog."
  },
  {
    "name": "Asana | https://asana.com | @asana | $50/mo",
    "url": "https://asana.com",
    "description": "$800/mo | Teamwork without email | Asana is our go-to for prioritizing projects, keeping up w/orders & staying on top of a growing to-do list"
  },
  {
    "name": "WeekPlan | https://weekplan.net | @weekplan | $7/mo- $19/mo | Time management inspired by the \"7 habits of highly effective people\"\nFeatures: goals of the week, week view and quadrant matrix, pomodoro timer, shared workspaces, etc...",
    "url": "https://weekplan.net"
  },
  {
    "name": "Trello | https://trello.com | @trello | $5/mo | Organize anything, together Trello is the fastest, easiest way to organize anything, from your day-to-day work, to a favorite side project, to your greatest life plans.",
    "url": "https://trello.com"
  },
  {
    "name": "Blossom | https://www.blossom.co | @blossom_io | $19/mo",
    "url": "https://www.blossom.co",
    "description": "$149/mo | Agile Project Management | Blossom gives each member of the team clear overview about who’s doing what & why and at the same time it helps you to focus on what matters most. With Blossom you can efficiently manage your whole development process in one place, built with simplicity in mind. Blossom is based on the principles ofKanban, a way of working that emphasizes iterative delivery cycles and continuously improves the workflow of your team or organization."
  },
  {
    "name": "Redmine | http://www.redmine.org | Flexible project management web application. Written using Ruby on Rails framework, it is cross-platform and cross-database.",
    "url": "http://www.redmine.org"
  },
  {
    "name": "JIRA Agile | https://www.atlassian.com/software/jira/agile | @jira | $10/mo",
    "url": "https://www.atlassian.com/software/jira/agile",
    "description": "$30/mo | Dream big, work smart, deliver fast | Makers of @JIRA, @Confluence, @Bitbucket and more. Software to plan, collaborate, code, and support. Built for teams"
  },
  {
    "name": "Tom's Planner | https://www.tomsplanner.com | @tomsplanner | $9/mo",
    "url": "https://www.tomsplanner.com",
    "description": "$19/mo |  | Tom's Planner is online Gantt chart software that allows anyone to create, collaborate and share Gantt Charts online with drag and drop simplicity. It's web based, extremely intuitive and easy-to-use."
  },
  {
    "name": "LeanKit | https://leankit.com | @leankit | $15/mo",
    "url": "https://leankit.com",
    "description": "$19/mo | Instant Project visibility | In LeanKit, you map your organization’s processes onto virtual whiteboards. On each board the process steps are represented as vertical and horizontal lanes. Cards represent work items, which team members update and move from across the board as they complete their share of the work. Rather than having to ask for status reports, managers and customers can just look at the board. Board updates are visible in seconds around the globe and e-mail alerts and RSS feeds are available, so you and your team can take immediate action to resolve issues before they turn into serious problems."
  },
  {
    "name": "Breeze | https://www.breeze.pm | @BreezeTeam | $29/mo",
    "url": "https://www.breeze.pm",
    "description": "$129/mo | Organize and track everything. Breeze shows you what's being worked on, who's working on what, where things are in the workflow and how much time it took."
  },
  {
    "name": "Toggl | https://toggl.com | @toggl | free-$59/mo | Toggl’s time tracker is built for speed and ease of use. Time logging with Toggl is so simple that you’ll actually use it.",
    "url": "https://toggl.com"
  },
  {
    "name": "Clockify | https://clockify.me | @clockify | free | Clockify is the only 100% free time tracking software that lets you and your team track time with one click. It works like Toggl but offers unlimited features and unlimited users.",
    "url": "https://clockify.me"
  },
  {
    "name": "Hubstaff | https://hubstaff.com | @hubstaff | free-$9/mo | Hubstaff is time tracking software designed to make remote team management more effective and efficient. You just have to sign up, download our intuitive desktop app and push the start button to begin tracking time.",
    "url": "https://hubstaff.com"
  },
  {
    "name": "Tickspot | https://www.tickspot.com/ | @tickspot | free-$149/mo | Straightforward time tracking software to help your team run more profitable projects. Whether you prefer iOS, Android, the Apple Watch, or your desktop computer, Tick is the easiest way to track your time.",
    "url": "https://www.tickspot.com/"
  },
  {
    "name": "Kimai | https://www.kimai.org/ | @kimai_org | Kimai is a free open source timetracker. It tracks work time and prints out a summary of your activities on demand. Yearly, monthly, daily, by customer, by project, by action, etc. | self-hosted",
    "url": "https://www.kimai.org/"
  },
  {
    "name": "App Annie | https://www.appannie.com | @appannie/ | free |  | Make better decisions with our app store data. We are the leader for app store analytics, app rankings, and market intelligence.",
    "url": "https://www.appannie.com"
  },
  {
    "name": "App Figures | https://appfigures.com | @appfigures | $9/mo | A beautiful app tracking platform for app developers and publishers.",
    "url": "https://appfigures.com"
  },
  {
    "name": "Localize.js | https://localizejs.com | $25/mo",
    "url": "https://localizejs.com",
    "description": "$150/mo | Website translation with just a few lines of code."
  },
  {
    "name": "Gengo | https://gengo.com | $0.06",
    "url": "https://gengo.com",
    "description": "$0.17 per word | Human translation API"
  },
  {
    "name": "Google Website Translator | https://translate.google.com/manager/website/ | Make your website instantly available in 90+ languages",
    "url": "https://translate.google.com/manager/website/"
  },
  {
    "name": "KISSmetrics | https://www.kissmetrics.com | @kissmetrics/ | $150/mo",
    "url": "https://www.kissmetrics.com",
    "description": "$500/mo | KISSmetrics tells you who’s doing it. | Every last piece gets connected to a real person. All of it. It doesn’t matter if people bounce around between different browsers and devices. Or even if it takes them 6 months to come back. You’ll see what real people do."
  },
  {
    "name": "Localytics | https://www.localytics.com | @localytics/  |  Free up to 10k MAUs, $200/mo",
    "url": "https://www.localytics.com",
    "description": "$2700/mo above that  |  Find out what works in your mobile or web app.  Do more of it.  All in one place | Advanced analytics provide data and insight to help you build more successful apps.  Integrated Marketing helps you easily engage and acquire more customers."
  },
  {
    "name": "Mixpanel | https://mixpanel.com | @mixpanel/ | $150/mo",
    "url": "https://mixpanel.com",
    "description": "$2000/mo | Actions speak louder than page views. | For years, companies have pushed page views as a primary measure of success. Page view counts are popular because they are easy to report, but ultimately cannot tell you how engaged your visitors are. Mixpanel lets you measure what customers do in your app by reporting actions, not page views."
  },
  {
    "name": "Amplitude | https://amplitude.com | $299/mo | Mobile Analytics for decision makers",
    "url": "https://amplitude.com"
  },
  {
    "name": "Snowplow | https://snowplowanalytics.com | @SnowPlowData |  | Snowplow is the most powerful, flexible, scalable web analytics platform in the world. | Snowplow enables analysts to perform a wide variety of both simple and sophisticated analytics on your web analytics data.",
    "url": "https://snowplowanalytics.com"
  },
  {
    "name": "Segment | https://segment.com |  | $29/mo",
    "url": "https://segment.com",
    "description": "$349/mo | The right way to manage your tools. | The idea is simple: one pipeline for all your data. Send data to any third-party tool with a single integration."
  },
  {
    "name": "Clicky | https://clicky.com | @clicky | $9.99/mo",
    "url": "https://clicky.com",
    "description": "$19.99/mo | Real Time Web Analytics | Clicky lets you see every visitor and every action they take on your web site, with the option to attach custom data to visitors, such as usernames or email addresses. Analyze each visitor individually and see their full history."
  },
  {
    "name": "Google Analytics | http://www.google.com/analytics/ | Google Analytics lets you measure your advertising ROI as well as track your Flash, video, and social networking sites and applications.",
    "url": "http://www.google.com/analytics/"
  },
  {
    "name": "Matomo | https://matomo.org | @matomo_org | Whether you are an individual blogger, a small business, or a large corporation, Matomo helps you gain valuable insights to help your business or readership grow.",
    "url": "https://matomo.org"
  },
  {
    "name": "Chartio | https://chartio.com | @chartio |  | Visualize and explore your data with Chartio. | Create interactive charts and perfect dashboards through an intuitive drag and drop interface. Switch from basic tables to sophisticated data visualizations in a single click. Powerful filters let you slice and dice your data, and you can drill down into most charts without configuring a thing.",
    "url": "https://chartio.com"
  },
  {
    "name": "Chartbeat | https://chartbeat.com | @chartbeat | $9.95/mo",
    "url": "https://chartbeat.com",
    "description": "$49.95/mo | Build a loyal and valuable audience for your site. | Chartbeat's real-time traffic and audience-behavior data shows you who's on your site and how they're engaging with your content right now — so you can take action on what matters when it matters."
  },
  {
    "name": "Calq | https://calq.io | @CalqAnalytics | $0",
    "url": "https://calq.io",
    "description": "$2500/mo | Advanced custom analytics for mobile and web applications. | Calq is an analytics platform that measures user actions rather than page views. An action can be anything a user does: reviewing a product, playing a level on a mobile game, making a purchase on your site, anything. Calq's ability to work with custom events AND custom data is what raises it above more traditional analytics platforms."
  },
  {
    "name": "GoSquared | https://www.gosquared.com | @gosquared | £21.60",
    "url": "https://www.gosquared.com",
    "description": "£396/mo | Easy to use real-time web analytics."
  },
  {
    "name": "Improvely | https://www.improvely.com | @improvelycom | $29",
    "url": "https://www.improvely.com",
    "description": "$899/mo | Conversion tracking and click fraud monitoring platform. The easiest way to track the performance of marketing campaigns and monitor them for click fraud."
  },
  {
    "name": "Keen IO | https://keen.io | @keen_io | $0",
    "url": "https://keen.io",
    "description": "$2000+/mo | Custom analytics shouldn't be a pain in the backend. Keen IO's powerful APIs do the heavy lifting for you, so you can gather all the data you want and start getting the answers you need."
  },
  {
    "name": "Heap Analytics | https://heapanalytics.com | @heap | 0",
    "url": "https://heapanalytics.com",
    "description": "$599+ | Instant, retroactive analytics for web and iOS. No code required."
  },
  {
    "name": "Gauges | https://get.gaug.es | @GaugesApp | $6-$48/mo | Gauges provides real time web analytics such as how many people visit your site, where they come from, and where they go.",
    "url": "https://get.gaug.es"
  },
  {
    "name": "Wisdom | https://getWisdom.io | Free",
    "url": "https://getWisdom.io",
    "description": "$2000+/mo | Session Replay | Wisdom is the most accurate live visitor session recorder service available. Focusing only on session replay, Wisdom reconstructs a virtual desktop screen for every visitor, across all tabs, to capture the true feel of every visitor's experience."
  },
  {
    "name": "Optimizely | https://www.optimizely.com | @optimizely | $17/mo",
    "url": "https://www.optimizely.com",
    "description": "$359/mo | A/B testing you'll actually use | Track engagement, clicks, conversions, sign ups, or anything else that matters to you and your business. Optimizely's custom goal tracking provides an endless range of measurable actions that you can define. Just tell Optimizely what to measure, and we will do the rest."
  },
  {
    "name": "Visual Website Optimizer | https://vwo.com | @wingify | $49/mo",
    "url": "https://vwo.com",
    "description": "$129/mo | Increase your website sales and conversions | Using Visual Website Optimizer, they A/B test different versions of their website and landing pages to find out which one works best. Made for marketers, our tool is incredibly easy to use, and doesn't need IT resources."
  },
  {
    "name": "EyeQuant | http://www.eyequant.com | @eyequant | $199/mo",
    "url": "http://www.eyequant.com",
    "description": "$999/mo | Instantly understand what your visitors will see and miss in their first seconds on your site, and improve your conversions. Analyse live sites or mockups within seconds, no code required."
  },
  {
    "name": "Stormpath | https://stormpath.com | @gostormpath | free | Securely create, store, and manage user accounts, API keys, and user data for your web applications.",
    "url": "https://stormpath.com"
  },
  {
    "name": "Silverback 2.0 | http://silverbackapp.com | @silverbackapp | 69.95 | Guerrilla usability testing software for designers and developers | Silverback makes it easy, quick and cheap for everyone to perform guerrilla usability tests with no setup and no expense, using hardware already in your Mac.",
    "url": "http://silverbackapp.com"
  },
  {
    "name": "HotJar | https://www.hotjar.com | @hotjar | Free",
    "url": "https://www.hotjar.com",
    "description": "$29/mo (personal) | Records videos and collects heatmaps of your site visitor actions."
  },
  {
    "name": "Wisdom | https://getWisdom.io | Free",
    "url": "https://getWisdom.io",
    "description": "$2000+/mo | Session Replay | Wisdom is the most accurate live visitor session recorder service available. Focusing only on session replay, Wisdom reconstructs a virtual desktop screen for every visitor, across all tabs, to capture the true feel of every visitor's experience."
  },
  {
    "name": "Workday | https://www.workday.com | @workday |  | Workday works the way people work—collaboratively, on the go, and in real-time. Explore the product previews below to learn how Workday can change the way you work. | With powerful business applications and a user experience that's unmatched in enterprise software, Workday gives you everything you need to transform your business.",
    "url": "https://www.workday.com"
  },
  {
    "name": "Lever | https://www.lever.co | @lever | A modern web app for hiring | Leverage your entire company – interviewers, managers, and recruiters – to source, vet, and close.",
    "url": "https://www.lever.co"
  },
  {
    "name": "Zenefits | https://www.zenefits.com | @zenefits | $0/mo | The #1 All-In-One HR Platform | Payroll. Benefits. Time. Compliance. All online, all in one place.",
    "url": "https://www.zenefits.com"
  },
  {
    "name": "TestDome | https://www.testdome.com/ | @TestDome | $8/candidate",
    "url": "https://www.testdome.com/",
    "description": "$20/candidate | Automated testing of programming skills, ask candidates to write real code before calling them for an interview."
  },
  {
    "name": "HackerRank | https://www.hackerrank.com/ | @hackerrank | paid | End-to-end technical recruiting platform for hiring engineers.",
    "url": "https://www.hackerrank.com/"
  },
  {
    "name": "Gusto | https://gusto.com | @gustohq | $29/mo + $6/user | Payroll and benefits that put people first, easy setup, automated tax filings and thoughtful support.",
    "url": "https://gusto.com"
  },
  {
    "name": "WagePoint | https://wagepoint.com | @wagepoint | $20 + $2/employy | The Simple, Fast & Friendly way to pay your employees.",
    "url": "https://wagepoint.com"
  },
  {
    "name": "Travis | https://travis-ci.org | @travisci | free",
    "url": "https://travis-ci.org",
    "description": "$489/mo | Hi I’m Travis CI, a hosted continuous integration service for open source and private projects: travis-ci.com  System status updates: @traviscistatus"
  },
  {
    "name": "AppVeyor | https://www.appveyor.com | @appveyor | AppVeyor automates building, testing and deployment of .NET applications, helping your team to focus on delivering great apps.",
    "url": "https://www.appveyor.com"
  },
  {
    "name": "Codeship | https://codeship.com | @codeship | Continuous Delivery as a service, start testing and deploying your code immediately | Start with 100 builds per month free, Unlimited plans start at 49$",
    "url": "https://codeship.com"
  },
  {
    "name": "Circle | http://circleci.com | @circleci | $19/mo",
    "url": "http://circleci.com",
    "description": "$269/mo | Ship better code, faster | Easy, fast, continuous integration and deployment for web apps."
  },
  {
    "name": "Nevercode | https://nevercode.io | @nevercodehq",
    "url": "https://nevercode.io"
  },
  {
    "name": "Hound | https://houndci.com | @houndci | Free | Automated Code Review | Take care of pesky code reviews with a trusty Hound",
    "url": "https://houndci.com"
  },
  {
    "name": "CodeClimate | https://codeclimate.com | @codeclimate | $0/mo",
    "url": "https://codeclimate.com",
    "description": "$399/mo | Automated  Code Review | Code Climate hosted software metrics help you ship quality Ruby and JavaScript code faster. Get control of your technical debt with real time static analysis of your code."
  },
  {
    "name": "Codacy | https://www.codacy.com | $0-$150/mo | Automated Code Review | Continuous Static Analysis designed to complement your unit tests. Similar to CodeClimate.",
    "url": "https://www.codacy.com"
  },
  {
    "name": "Codecov | https://codecov.io | $0-$5/mo | Hosted Code Coverage | Code coverage reporting done right.",
    "url": "https://codecov.io"
  },
  {
    "name": "Semaphore | https://semaphoreci.com | @semaphoreci | $14/mo",
    "url": "https://semaphoreci.com",
    "description": "$899/mo | Create an Amazing Workflow. | Semaphore assumes that your private or open source project is on GitHub. There are no new dependencies, hooks or SSH keys to manage. It works without any change in source code."
  },
  {
    "name": "Solano CI | https://www.solanolabs.com | @SolanoLabs | $15/mo",
    "url": "https://www.solanolabs.com",
    "description": "$100/mo | Faster Continuous Integration and Deployment with patented auto-parallelization | Solano CI sets up Continuous Integration in minutes, frees you from managing a build server, and lets you deploy software 10x - 80x faster by running tests in parallel safely and automatically. It also lets you use our massively scalable environment even before you push to CI. Seamlessly integrates into existing workflows. Free 14-day trial, no credit card required. Formerly loved as tddium."
  },
  {
    "name": "Jenkins | https://jenkins.io | @jenkinsci | Jenkins provides continuous integration services for software development. It is a server-based system that supports SCM tools including AccuRev, CVS, Subversion, Git, Mercurial, Perforce, Clearcase and RTC, and can execute Apache Ant and Apache Maven based projects as well as arbitrary shell scripts and Windows batch commands. Released under the MIT License, Jenkins is free software.",
    "url": "https://jenkins.io"
  },
  {
    "name": "Bamboo | https://www.atlassian.com/software/bamboo | @atlassian | $10/mo",
    "url": "https://www.atlassian.com/software/bamboo",
    "description": "$1000/mo |  | Bamboo does more than just run builds and tests. It connects issues, commits, test results, and deploys so the whole picture is available to your entire product team – from project managers, to devs and testers, to sys admins."
  },
  {
    "name": "Buildkite (Buildbox) | https://buildkite.com | @buildkite | $15/dev/mo | Semi-hosted continuous integration and deployment | Buildkite uses your own infrastructure to run builds so you can test any language or run any deployment scripts. You can run as many parallel agents (and builds) as you want.",
    "url": "https://buildkite.com"
  },
  {
    "name": "Crucible | https://www.atlassian.com/software/crucible | @atlassian | $10/mo",
    "url": "https://www.atlassian.com/software/crucible",
    "description": "$8000/mo | Code review system | Review code, discuss changes, share knowledge, and identify defects with Crucible's flexible review workflow. It's code review made easy for Git, Subversion, CVS, Perforce, and more."
  },
  {
    "name": "Coveralls | https://coveralls.io | @coverallsapp | $0/mo",
    "url": "https://coveralls.io",
    "description": "$50/mo | Coveralls works with your continuous integration server to give you test coverage history and statistics. It integrates with any langauge and is free for open source."
  },
  {
    "name": "Testributor | http://about.testributor.com | @testributor | Free | Testributor is an open source Continuous Integration platform. A hosted version is available for free, both for open source and private projects.",
    "url": "http://about.testributor.com"
  },
  {
    "name": "Wercker | http://www.wercker.com | @wercker | $0/mo",
    "url": "http://www.wercker.com",
    "description": "$350/mo | Wercker is a Docker-Native CI/CD Automation platform for Kubernetes & Microservice Deployments."
  },
  {
    "name": "Geckoboard | https://www.geckoboard.com | @geckoboard | $17/mo",
    "url": "https://www.geckoboard.com",
    "description": "$899/mo | Meet Geckoboard. It's Your Key Data, In One Place. | Geckoboard monitors your business’s vital signs – don’t wait, see it live on a business dashboard as it happens. Focus on what matters and react faster to important events."
  },
  {
    "name": "Telemetry | https://www.telemetrytv.com | @telemetrytv | $9/mo",
    "url": "https://www.telemetrytv.com",
    "description": "$749/mo | Build realtime dashboard with powerful visualizations that look beautiful on big screen TVs, desktop computers, mobile devices, and embedded systems—all using a simple REST API that works with all modern languages."
  },
  {
    "name": "Dashing | http://dashing.io | Dashing is a Sinatra based framework that lets you build beautiful dashboards.",
    "url": "http://dashing.io"
  },
  {
    "name": "Klipfolio | https://www.klipfolio.com | @klipfolio | $5/user/mo",
    "url": "https://www.klipfolio.com",
    "description": "$20/user/mo | Meet Your Business Dashboard | Connect to any data service to bring your key numbers together on one dashboard. Assign your data to visualizations to show the story behind the numbers. Cultivate a data-driven culture by sharing dashboards with everyone on your team."
  },
  {
    "name": "Crashlytics | http://try.crashlytics.com | @crashlytics | Free | Crash reports and grouping for easier analysis. Basic analytics and reports. | iOS & Android",
    "url": "http://try.crashlytics.com"
  },
  {
    "name": "Sentry | https://sentry.io/welcome/ | @getsentry | $24/mo",
    "url": "https://sentry.io/welcome/",
    "description": "$199/mo | Sentry notifies you when your users experience errors. | Know immediately when things happen in your application. Engage users before they have a chance to report a problem."
  },
  {
    "name": "HoneyBadger | https://www.honeybadger.io | @honeybadgerapp | $39/mo",
    "url": "https://www.honeybadger.io",
    "description": "$249/mo | Exception, uptime, and performance monitoring for Ruby. | It tells you about errors, downtime and performance issues as they happen. And it gives you the tools you need to fix them ...without burying you in data. Without silly rate limits or per-server fees."
  },
  {
    "name": "BugSnag | https://www.bugsnag.com | @bugsnag | $29/mo",
    "url": "https://www.bugsnag.com",
    "description": "$249/mo | Automatic, full-stack error monitoring | Web app monitoring for Rails, PHP, Node.js, Java, and every other leading platform."
  },
  {
    "name": "Raygun | https://raygun.com | @raygunio | $14/mo",
    "url": "https://raygun.com",
    "description": "$199/mo | Exceptional Error Tracking | Your software faults get automatically sent to the Raygun service and analysis begins immediately. Raygun intelligently groups your errors so you're dealing with root causes, not every single error instance!"
  },
  {
    "name": "Airbrake | https://airbrake.io | @airbrake | $49-249/mo | No More Searching Log Files Capture and Track Your Application's Exceptions in 3 Minutes | Airbrake is the leading exception reporting service, currently providing error tracking for 50,000 applications with support for 18 programming languages.",
    "url": "https://airbrake.io"
  },
  {
    "name": "Atatus | https://www.atatus.com | @atatusapp | $12/mo",
    "url": "https://www.atatus.com",
    "description": "$159/mo | Simple JavaScript Error Tracking | Atatus is a simple error tracking and uptime monitoring system. Add two lines of code and get alerted on any errors that occurs in your application in realtime."
  },
  {
    "name": "Rollbar | https://rollbar.com | @rollbar | $12/mo",
    "url": "https://rollbar.com",
    "description": "$1249/mo | Take control of your errors | Rollbar is platform-agnostic and can accept data from anything that can speak HTTP and JSON. You can use our official libraries for Ruby, Python, PHP, Node.js, JavaScript, Android, iOS, or Flash, or roll your own with our API."
  },
  {
    "name": "Errorception | https://errorception.com | @errorception | $5/mo",
    "url": "https://errorception.com",
    "description": "$59/mo | Painless JavaScript Error Tracking | Errorception is a simple and painless way to find out about JavaScript errors, as they occur in your users' browsers. All you need to do is insert a script tag on your page, and you will start recording errors as they happen in real-time."
  },
  {
    "name": "Errbit | OSS | https://errbit.com | The open source error catcher that's Airbrake API compliant.",
    "url": "https://errbit.com"
  },
  {
    "name": "OverOps | https://www.overops.com | @overopshq | God Mode in Production Code for java and scala applications.",
    "url": "https://www.overops.com"
  },
  {
    "name": "HockeyApp | https://www.hockeyapp.net | @hockeyapp | Free",
    "url": "https://www.hockeyapp.net",
    "description": "$129/mo depending on number of apps and number of owners | Distribution of iOS, Android, Windows Phone and Mac OS apps | Includes analytics, user feedback and crash reports."
  },
  {
    "name": "Fluentd | https://www.fluentd.org | @fluentd |  | Set Up Once, Collect More | Fluentd is an open source data collector designed for processing data streams. 150+ plugins instantly enable you to store the data for Log Management, Big Data Analytics, etc",
    "url": "https://www.fluentd.org"
  },
  {
    "name": "Flume | https://github.com/cloudera/flume",
    "url": "https://github.com/cloudera/flume"
  },
  {
    "name": "Graylog | https://www.graylog.org | @graylog2 | Field-tested open source data analytics system used and trusted all around the world. Search your logs, create charts, send reports and be alerted when something happens. All running on the existing JVM in your datacenter.",
    "url": "https://www.graylog.org"
  },
  {
    "name": "LogEntries | https://logentries.com | @logentries | $16/mo",
    "url": "https://logentries.com",
    "description": "$245/mo | Log Management & Analytics Made Easy | Logentries provides an easy-to-use cloud service for log management and analytics."
  },
  {
    "name": "Loggly | https://www.loggly.com | @loggly | $49/mo",
    "url": "https://www.loggly.com",
    "description": "$349/mo | Solve operational problems faster. | Loggly helps cloud-centric organizations—organizations that build and manage cloud-facing applications—to solve operational problems faster."
  },
  {
    "name": "Logstash | https://www.elastic.co/products/logstash | @logstash |  | Ship logs from any source, parse them, get the right timestamp, index them, and search them. | logstash is a tool for managing events and logs. You can use it to collect logs, parse them, and store them for later use (like, for searching). Speaking of searching, logstash comes with a web interface for searching and drilling into all of your logs.",
    "url": "https://www.elastic.co/products/logstash"
  },
  {
    "name": "Papertrail | https://papertrailapp.com | @papertrailapp | $7/mo",
    "url": "https://papertrailapp.com",
    "description": "$230/mo | Frustration-free log management. Get started in seconds. | Use Papertrail's time-saving log tools, flexible system groups, team-wide access, long-term archives, charts and analytics exports, monitoring webhooks, and 45-second setup."
  },
  {
    "name": "Stackify | https://stackify.com | @Stackify | $15/ mo | Connecting the dots for you | Stackify focuses on application health, magnifying critical insights for developers, operations, and support teams.",
    "url": "https://stackify.com"
  },
  {
    "name": "statsd | https://github.com/etsy/statsd/",
    "url": "https://github.com/etsy/statsd/"
  },
  {
    "name": "Sumo Logic | https://www.sumologic.com | @SumoLogic |  | Log Data is Big Data | Once enabled by the administrator, the new data will be searchable in the customer account. Sumo Logic  provides an Application for Data Volume for out-of–the-box dashboards and searches that deliver a comprehensive view of data usage volume by category, collector, source name, and hosts.",
    "url": "https://www.sumologic.com"
  },
  {
    "name": "AppNeta | https://www.appneta.com | @AppNeta | Free to $119 / mo | Full-stack application monitoring for web apps | Get visibility into code, network, and end user, especially for polyglot and service-oriented applications, by looking at transactions, errors, browser metrics, host metrics, and more.",
    "url": "https://www.appneta.com"
  },
  {
    "name": "DripStat | https://dripstat.com | @DripStat | $20/ mo | Application monitoring for Java | Next gen Java APM. Full visibility across your stack.  Specificially designed for Java. Supports SQL databases, MongoDB and Cassandra.",
    "url": "https://dripstat.com"
  },
  {
    "name": "New Relic | https://newrelic.com | @NewRelic | $149/ mo | Application monitoring for all your web apps. | It’s about gaining actionable, real-time business insights from the billions of metrics your software is producing, including user click streams, mobile activity, end user experiences and transactions.",
    "url": "https://newrelic.com"
  },
  {
    "name": "AppSignal | https://appsignal.com | @AppSignal | $49/mo",
    "url": "https://appsignal.com",
    "description": "$259/mo | Better monitoring for your Rails applications. | Get detailled statistics on your site's performance with mean and 90th percentile measurements."
  },
  {
    "name": "Instrumental | https://instrumentalapp.com | @instrumental | $150/mo",
    "url": "https://instrumentalapp.com",
    "description": "$750/mo | Monitor Your App in Realtime | Instrumental’s made to monitor metrics at a ridiculously high scale. At rates of 500,000 metrics per second and higher, it doesn’t even break a sweat"
  },
  {
    "name": "Blitz | https://www.blitz.io | @blitz_io | $19.99/mo",
    "url": "https://www.blitz.io",
    "description": "$399.99/mo | LOAD TESTING FROM THE CLOUD | Building mobile applications, websites or APIs is an iterative process. New features and capabilities are being added constantly. Your application is rapidly and iteratively going through several distinct phases - Development, Staging, Production and Operations. At every step of the way, the ability to ensure that your application meets the highest levels of user satisfaction is critical."
  },
  {
    "name": "Bees with Machine Guns! | https://github.com/newsapps/beeswithmachineguns",
    "url": "https://github.com/newsapps/beeswithmachineguns"
  },
  {
    "name": "Flood.io | https://flood.io | @flood_io | Free to $399/mo | Auto setup and results summaries/graphs of JMeter and Gatling load tests.  Can easily scale to 100K+ reqs/min.",
    "url": "https://flood.io"
  },
  {
    "name": "Neustar Website Load Testing | https://www.neustar.biz/services/web-performance/load-testing | @Neustar | $80/mo |  | Tackle performance problems such as bandwidth limitations, error rates exceeding thresholds, server PU limitations and much more.",
    "url": "https://www.neustar.biz/services/web-performance/load-testing"
  },
  {
    "name": "Loader.io | https://loader.io | Free to 100.00$ / mo | Loader.io is a free load testing service that allows you to stress test your web-apps/apis with thousands of concurrent connections.",
    "url": "https://loader.io"
  },
  {
    "name": "Locust.io | https://locust.io | @locustio | Open Source",
    "url": "https://locust.io"
  },
  {
    "name": "Server Density | https://www.serverdensity.com | @serverdensity |  | Premium hosted website and server monitoring tool. | All your activity syncs in real time",
    "url": "https://www.serverdensity.com",
    "description": "from starting new instances to upgrading or deleting old ones. Work wherever you want - through web, mobile, API or directly with your provider. Everything stays in sync."
  },
  {
    "name": "Datadog | https://www.datadoghq.com | @datadoghq | $0/mo",
    "url": "https://www.datadoghq.com",
    "description": "$15/host/mo | Datadog is a monitoring service for IT, Operations and Development teams who write and run applications at scale, and want to turn the massive amounts of data produced by their apps, tools and services into actionable insight."
  },
  {
    "name": "Circonus | https://www.circonus.com | @circonus | $15/host/mo",
    "url": "https://www.circonus.com",
    "description": "$25/host/mo | Circonus combines multiple monitoring, alerting, event reporting, and analytical tools into one unified solution. Use any data, in any application, from any system, and visualize it in real-time."
  },
  {
    "name": "TrueSight Pulse | http://truesightpulse.bmc.com | @truesightpulse | | Real-time visibility into cloud and server infrastructure",
    "url": "http://truesightpulse.bmc.com"
  },
  {
    "name": "Librato | https://www.librato.com | @Librato | $0.05/metric/mo to $0.30/metric/mo | Librato provides a complete solution for monitoring and understanding the metrics that impact your business at all levels of the stack.",
    "url": "https://www.librato.com"
  },
  {
    "name": "Scout | https://scoutapp.com/",
    "url": "https://scoutapp.com/"
  },
  {
    "name": "Desk | https://www.desk.com | @desk | $3/mo",
    "url": "https://www.desk.com",
    "description": "$50/mo | Deliver Customer Service That Wows | Desk.com creates the leading customer service application, which helps fast-growing companies deliver outstanding customer support. Desk.com's intuitive user interface and powerful features make solving customers' problems more efficient for the entire company. Plus, Desk.com is the only Customer Service Application backed by Salesforce, providing easy integration with other Salesforce services and robust security. There are thousands of companies using Desk.com as their help desk software application, from household names like Square and Instagram to the burrito shop down the street. Give it a try for free."
  },
  {
    "name": "HelpScout | https://www.helpscout.net | @helpscout | $15/ mo | Scalable customer support, no help desk headaches | Based on conditions you specify, Help Scout automatically performs one or more actions.",
    "url": "https://www.helpscout.net"
  },
  {
    "name": "ZenDesk | https://www.zendesk.com | @zendesk | $1/mo",
    "url": "https://www.zendesk.com",
    "description": "$195/mo | Relationships between businesses and their customers can be hard. | Better customer service starts with better communication"
  },
  {
    "name": "Groove | https://www.groovehq.com | @groove | $15/ mo | Everything you need to deliver awesome,\npersonal support to every customer. | Your customers will never know that you’re using a helpdesk. To them, your messages look like regular emails. It feels like personal support, and it helps you build deeper relationships with\nyour customers.",
    "url": "https://www.groovehq.com"
  },
  {
    "name": "Intercom | https://www.intercom.com | @intercom | $49/mo",
    "url": "https://www.intercom.com",
    "description": "$449/mo | The easiest way to see and talk to your users | Intercom is a single platform where you can see in real-time who is using your product and send personalized messages to the right users at the right time based on their behavior."
  },
  {
    "name": "Tender | http://tenderapp.com | @tenderapp | $9/mo",
    "url": "http://tenderapp.com",
    "description": "$99/mo | Better, Simpler, Customer Support Software. | Support your customers in the open! With public forums, you can offer a public space to your users to discuss common issues and get feedback, while still keeping certain categories private (billing, orders, ...). Power users can subscribe to categories and new discussions, and help out other customers."
  },
  {
    "name": "Enchant | https://www.enchant.com | @enchanthq | $9/ mo | It's like gmail on steroids! | Enchant is a powerful helpdesk that helps your team deliver awesome support to each and every customer. To your customers, it's just email. They will never see a ticket number and will never have to log into anything!",
    "url": "https://www.enchant.com"
  },
  {
    "name": "Freshdesk | https://freshdesk.com | @freshdesk | $16/mo",
    "url": "https://freshdesk.com",
    "description": "$70/mo | Everything you need to deliver Exceptional Customer Support | Freshdesk keeps you from running behind issues blindly and gets your customer support issues under control."
  },
  {
    "name": "UserDeck | https://userdeck.com | @user_deck | $0",
    "url": "https://userdeck.com",
    "description": "$25/mo | Customer support software that embeds into your existing website."
  },
  {
    "name": "Sirportly | https://sirportly.com | @sirportly | £0",
    "url": "https://sirportly.com",
    "description": "£15/mo | Grow your business and provide world class customer support. Simply setup your helpdesk in less than a few minutes. Integrate with your other software tools and take advantage of the automated rules and macros to scale your customer support to a new level, become more professional and customer focused and turn your customers into raving fans with Sirportly."
  },
  {
    "name": "Olark | https://www.olark.com/",
    "url": "https://www.olark.com/"
  },
  {
    "name": "SnapEngage | https://snapengage.com/",
    "url": "https://snapengage.com/"
  },
  {
    "name": "Get Satisfaction! | https://getsatisfaction.com/corp/ | Customer communities for social support, social marketing & customer feedback",
    "url": "https://getsatisfaction.com/corp/",
    "description": "online community software | Get Satisfaction is the leading customer engagement platform that helps companies build better relationships with their customers and prospects, through the best online customer community."
  },
  {
    "name": "Reamaze | https://www.reamaze.com | @reamaze | $15/mo | Lightweight, Lightspeed Help Desk. Email, Social, Branded, Integrated. | Reamaze provides your team with helpdesk functionality that integrates with your application, as well as integrations with popular 3rd party tools in your workflow.",
    "url": "https://www.reamaze.com"
  },
  {
    "name": "Jitbit Helpdesk | https://www.jitbit.com/helpdesk/ | @jitbithelpdesk | $29/mo",
    "url": "https://www.jitbit.com/helpdesk/",
    "description": "$199/mo | A help desk app that actually makes your work easier, not harder. | Comes in both hosted and on-premise versions. Very well designed and easy to use. Has all the must-have features and doesn't get in your way."
  },
  {
    "name": "Drift | https://www.drift.com | @drift | free for < 100 contacts, paid from $49/mo | Stop wasting your website traffic. | Sales-oriented live chat and in-app messaging, with chatbot automation.",
    "url": "https://www.drift.com"
  },
  {
    "name": "Postmark | https://postmarkapp.com | @postmarkapp | $1.50 | Email delivery for web apps – done right. | Postmark removes the headaches of delivering and parsing transactional email for webapps with minimal setup time and zero maintenance. We have years of experience getting email to the inbox, so you can work and rest easier.",
    "url": "https://postmarkapp.com"
  },
  {
    "name": "Mandrill | http://mandrill.com | @mandrillapp | $0.20/mo",
    "url": "http://mandrill.com",
    "description": "$0.10/mo | THE FASTEST WAY TO DELIVER EMAIL | Mandrill is a scalable and affordable email infrastructure service. Whether you're just getting started, have some questions, or are looking for a quick reference, we've got you covered."
  },
  {
    "name": "MailGun | https://www.mailgun.com | @Mail_Gun | $20.00 | The Email Service For Developers | Easy SMTP integration and a simple, RESTful API abstracts away the messy details of email. Scale quickly, whether you need to send 10 or 10 million emails.",
    "url": "https://www.mailgun.com"
  },
  {
    "name": "SendGrid | https://sendgrid.com | @SendGrid | $9.95/mo",
    "url": "https://sendgrid.com",
    "description": "$399.95 | Email Delivery. Simplified. | SendGrid delivers billions of emails for companies of all sizes every month. Select the package that best fits with your sending volume, set-up your account, and let SendGrid take care of the rest!"
  },
  {
    "name": "CritSend | https://www.critsend.com | @critsend | $50/mo",
    "url": "https://www.critsend.com",
    "description": "$3000/Mo | The Best SMTP Relay for Developers | Use the most reliable infrastructure for your transactional and bulk emails. It only takes 5 minutes to setup Critsend and start enjoying fast delivery time and automatic scalability."
  },
  {
    "name": "Postage | http://postageapp.com | @postagebird | $9/mo",
    "url": "http://postageapp.com",
    "description": "$399/mo | The easier way"
  },
  {
    "name": "Sendwithus | https://www.sendwithus.com | @sendwithus | Free 'Hacker' plan of 1000 messages/month | Transactional email A/B testing and drip campaigns |",
    "url": "https://www.sendwithus.com"
  },
  {
    "name": "Filestack | https://www.filestack.com | @FileStack | $0/mo",
    "url": "https://www.filestack.com",
    "description": "$49/mo | Easy, Powerful File Uploads | Connect, Store, and Process any file from anywhere on the Internet"
  },
  {
    "name": "Open Exchange Rates | https://openexchangerates.org |  | $12/mo",
    "url": "https://openexchangerates.org",
    "description": "$97/mo | Real-time exchange rates &"
  },
  {
    "name": "Elasticsearch | https://www.elastic.co/products/elasticsearch | @elasticsearch |  | an end-to-end search and analytics platform. infinitely versatile. | By combining the massively popular Elasticsearch, Logstash and Kibana we have created an end-to-end stack that delivers actionable insights in real-time from almost any type of structured and unstructured data source. Built and supported by the engineers behind each of these open source products, the Elasticsearch ELK stack makes searching and analyzing data easier than ever before.",
    "url": "https://www.elastic.co/products/elasticsearch"
  },
  {
    "name": "Swiftype | https://swiftype.com | @Swiftype | Free",
    "url": "https://swiftype.com",
    "description": "$250/mo, Enterprise Plans available | Swiftype is a hosted website search service, available as a web crawler or as an API integration. API clients are available for major frameworks and languages, plugins are available for major third party platforms."
  },
  {
    "name": "Algolia | https://www.algolia.com | @Algolia | $49/mo",
    "url": "https://www.algolia.com",
    "description": "$449/mo | Build Realtime Search | Algolia is a fully hosted search service, available as a REST API. API clients are also available for all major frameworks, platforms and languages."
  },
  {
    "name": "Apache Solr | http://lucene.apache.org/solr/",
    "url": "http://lucene.apache.org/solr/",
    "description": "an open source search platform, based and co-released with Apache Lucene."
  },
  {
    "name": "Amazon Cloudsearch | https://aws.amazon.com/cloudsearch/ | Search SaaS",
    "url": "https://aws.amazon.com/cloudsearch/"
  },
  {
    "name": "MailCharts | https://www.mailcharts.com | @mailcharts | $30/mo | Track & understand how your competitors use email marketing | MailCharts tracks over a thousand companies, bringing you actionable insights to help you improve your email marketing strategy, make data-driven decisions and gain design and content inspiration.",
    "url": "https://www.mailcharts.com"
  },
  {
    "name": "Customer.io | https://customer.io |  | $50/mo",
    "url": "https://customer.io",
    "description": "$1250/Mo | Send email based on what people do or don't do in your app | Customer.io lets you send newsletters to segments of customers using data from your site."
  },
  {
    "name": "Vero | https://www.getvero.com | @veroapp | $99/mo | Send emails based on what your customers do | Vero makes it easy to create segments of customers based on the attributes you capture (e.g. age, location, gender) and the actions your customers take (e.g. logged in, used feature x, checked out, etc.).",
    "url": "https://www.getvero.com"
  },
  {
    "name": "MailChimp | https://mailchimp.com",
    "url": "https://mailchimp.com"
  },
  {
    "name": "Campaign Monitor | https://www.campaignmonitor.com | @ | $9/mo",
    "url": "https://www.campaignmonitor.com",
    "description": "$699/mo | CAMPUnbounce Feature Tour |"
  },
  {
    "name": "Sendy | https://sendy.co | @getsendy | $59 one time fee, host yourselfor use a hosted sendy instance from a variety of providers.",
    "url": "https://sendy.co"
  },
  {
    "name": "Image-Charts | https://image-charts.com | @imagecharts | free",
    "url": "https://image-charts.com",
    "description": "$49/mo, self-hosted plan available | Include animated charts as image into emails, no server-side rendering, 1 URL = 1 chart, compatible with Google Image Charts."
  },
  {
    "name": "Drip | https://www.drip.com | @getdrip | free for < 100 subscribers, paid plans from $49/mo | Advanced marketing automation with workflows, drip campaigns, conversion tracking etc..",
    "url": "https://www.drip.com"
  },
  {
    "name": "MailerLite | https://www.mailerlite.com | @mailerlite | free",
    "url": "https://www.mailerlite.com",
    "description": "$140/month | free plan offers a lot of features"
  },
  {
    "name": "Launchrock | https://www.launchrock.com | @launchrock | $49/mo",
    "url": "https://www.launchrock.com",
    "description": "$199/mo |  | Even if you know how to code a web page with HTML, you'll love how much faster it is with our landing page builder. Load up your logo and graphic assets, set up a few base colors from your brand palette and publish away."
  },
  {
    "name": "Unbounce | https://unbounce.com | @unbounce | $49/mo",
    "url": "https://unbounce.com",
    "description": "$199/mo |  | Unbounce empowers marketers to act independently from technical teams, improving their efficiency and their ability to generate sales. Produce high-converting landing pages without dealing with I.T. bottlenecks. See how Unbounce can enhance your campaigns and maximize your marketing spend."
  },
  {
    "name": "LeadPages | https://www.leadpages.net/ | $25/mo",
    "url": "https://www.leadpages.net/",
    "description": "$199/mo | Generate leads and increase revenue using the industry-leading landing page builder with accompanying suite of lead generation and opt-in tools."
  },
  {
    "name": "Instapge | https://instapage.com/ | $29/mo",
    "url": "https://instapage.com/",
    "description": "$127/mo | A landing page solution for optimizing your ad spend. Build, Integrate, Collaborate & Optimize."
  },
  {
    "name": "KickoffLabs | https://kickofflabs.com | @kickofflabs | $29/mo",
    "url": "https://kickofflabs.com",
    "description": "$99/mo | Stop building landing pages."
  },
  {
    "name": "Prefinery | https://www.prefinery.com | @prefinery | $19/mo-  $399/mo | Stress-free Beta Invitation and Management | Prefinery is beta invitations & management for serious product launches. You need more than just a landing page -- outsource your beta to Prefinery!",
    "url": "https://www.prefinery.com"
  },
  {
    "name": "Salesforce | http://www.salesforce.com | @salesforce |  | TRANSFORM CONSUMERS INTO CUSTOMERS ACROSS ALL DIGITAL CHANNELS. | The ExactTarget Marketing Cloud, built on the Salesforce1 Platform, allows marketers to create 1:1 campaigns like never before. So you can combine traditional digital channels like email, mobile, social, and the web with any conceivable IP-addressable product to turn consumers into customers.",
    "url": "http://www.salesforce.com"
  },
  {
    "name": "SalesforceIQ | https://www.salesforceiq.com | @salesforceiq | £17-85/user/mo | Helps businesses build stronger relationships using Relationship Intelligence.",
    "url": "https://www.salesforceiq.com"
  },
  {
    "name": "SugarCRM | https://www.sugarcrm.com | @sugarcrm | $35/mo",
    "url": "https://www.sugarcrm.com",
    "description": "$150/mo | Sugar's open, flexible platform easily solves real business problems. From automating sales, marketing and customer support to creating a custom CRM application, we've got you covered. | By placing the individual at the center of its solution, SugarCRM puts the \"i\" in CRM and empowers every customer-facing individual to create extraordinary customer relationships."
  },
  {
    "name": "Insight.ly | https://www.insightly.com | @insightly | $7/mo | Small Business CRM | Manage contacts, organizations, partners, vendors and suppliers. See everything from background, email history, events, projects or opportunities",
    "url": "https://www.insightly.com"
  },
  {
    "name": "Close.io | https://close.io | @closeio | $59/mo",
    "url": "https://close.io",
    "description": "$299/mo | Sales Communication Platform | Close.io automatically logs sent and received emails with your leads. You can send/receive emails painlessly from Close.io. Or, by entering your IMAP and SMTP mail settings, Close.io can track emails that you send from Gmail or any email client."
  },
  {
    "name": "Streak | https://www.streak.com | @streak |  | Manage email support\ninside Gmail | Streak lets you keep track of all your deals right from your inbox. We let you group emails from the same customer together into one view and push that customer through your pipeline. When a new email comes in, you'll have all the context you need.",
    "url": "https://www.streak.com"
  },
  {
    "name": "Base | https://getbase.com | @getbase | $15/mo",
    "url": "https://getbase.com",
    "description": "$125/mo | The Sales and CRM Software Your Team Will Actually Use | Base is designed to significantly boost your team’s sales productivity and give you the core sales tools you need to grow your business. Your leads come from a variety of sources. Lead management in Base helps you organize leads and assign them to the right sales reps so they can be followed up on and qualified quickly. After being qualified, convert a lead in Base and all of the contact information you have about your lead is transferred your new customer contact card. Optionally, you can specify follow up tasks and even create a deal at the same time."
  },
  {
    "name": "Pipedrive | https://www.pipedrive.com | | $9/ mo | Pipeline software that gets you organized. | Pipedrive is built for salespeople who need to put in serious effort to turn leads into sales. It helps to organize the work and spend less time on admin.",
    "url": "https://www.pipedrive.com"
  },
  {
    "name": "Contactually | https://www.contactually.com | @Contactually | $17.99/mo",
    "url": "https://www.contactually.com",
    "description": "$99.99/mo | Maximize your network ROI. More referrals. More repeat business | Contactually helps businesses follow up with the right people, at the right time, to maximize relationship ROI."
  },
  {
    "name": "Buffer | https://buffer.com | @buffer | $10/mo | Buffer is the easiest way to publish on social media | Buffer helps you share to Twitter, Facebook and more. ",
    "url": "https://buffer.com"
  },
  {
    "name": "HootSuite | https://hootsuite.com | @HootSuite | $8.99/mo | Add speed and agility to your social media strategy | From one dashboard you’ll schedule Tweets and Facebook posts, monitor conversations, and more. When you need to prove your social ROI, quickly create and customize ready-to-present analytics reports.",
    "url": "https://hootsuite.com"
  },
  {
    "name": "Claim.io | http://claim.io/welcome | @claimio | $189/mo-  $499/mo |  | Owning your name on 300 Social media sites not only makes it easier for people to find you or your business online",
    "url": "http://claim.io/welcome",
    "description": "it also works as a \"social media identity insurance\", protecting you from name squatting and identity fraud, minimizing risk to your brand."
  },
  {
    "name": "Exacttarget Marketing Cloud/Buddy Media | http://www.salesforce.com/products/marketing-cloud/overview/ | @marketingcloud |  | Bringing you closer to your social customers with an integrated social content solution. | Run integrated campaigns across Facebook, Twitter, YouTube and your websites Increase fans, followers and advocates. Publish engaging and interactive social apps. Easily create landing pages and microsites and extend social to your websites. Understand engagement trends, demographics, conversions and business metrics with powerful analytics.",
    "url": "http://www.salesforce.com/products/marketing-cloud/overview/"
  },
  {
    "name": "Sprout Social | https://sproutsocial.com | @sproutsocial | $59/mo-  $1500/mo | Powerful Social Media Software | Sprout lets you post messages on Facebook, Twitter, Google+ and LinkedIn simultaneously from one easy-to-use message composition tool. Shorten links, attach photos, target your audience on Facebook, customize your posts and much more.",
    "url": "https://sproutsocial.com"
  },
  {
    "name": "Trademarkia | https://www.trademarkia.com | @trademarkia |  | Trademarkia is one of the largest trademark search engines in the world. | LegalForce's network of licensed patent attorneys and agents have filed hundreds of patent applications for companies of every size.",
    "url": "https://www.trademarkia.com"
  },
  {
    "name": "NameRobot | https://www.namerobot.com | @namerobotEN] | 0$",
    "url": "https://www.namerobot.com",
    "description": "300$/mo | Find, create and check the name for your project. NameRobot offers everything you need to create suitable naming ideas in a short time."
  },
  {
    "name": "DomainTools Whois Lookup | http://whois.domaintools.com | @DomainTools | free / $99/mo | Go beyond ordinary Whois to discover the people or organizations behind a domain name or IP address.",
    "url": "http://whois.domaintools.com"
  },
  {
    "name": "42Floors | https://42floors.com | @42floors |  | The Best Place to Find Office & Commercial Space Rentals | We're gathering listing data from everyone in the market. Even including off-market listings that landlords haven't yet posted on 42Floors.com or anywhere else.",
    "url": "https://42floors.com"
  },
  {
    "name": "Liquidspace | https://liquidspace.com | @LiquidSpace |  | Optimize Real Estate\nfor Your Enterprise | Whether planning ahead or booking on the fly, find and reserve a great place to work. Rent professional conference and meeting rooms, private offices, or coworking spaces daily or hourly.",
    "url": "https://liquidspace.com"
  },
  {
    "name": "PivotDesk | https://www.pivotdesk.com | @PivotDesk | | An office sharing marketplace that helps startups that need space find host companies that have excess space.",
    "url": "https://www.pivotdesk.com"
  },
  {
    "name": "Discourse | https://www.discourse.org | @discourse |  | Ready for a new discussion platform? | Discussion software is a group of people interested in a common topic who are willing to type paragraphs to each other on a web page.",
    "url": "https://www.discourse.org"
  },
  {
    "name": "Tomatoes | http://www.tomato.es/ | @tomatoesapp |  | Track your time and be productive with the Pomodoro Technique | Tomatoes is a \"pomodoro tracker\", a Pomodoro technique® driven time tracker. Track your time using 25 minutes slots called \"pomodoros\".",
    "url": "http://www.tomato.es/"
  },
  {
    "name": "RescueTime | https://www.rescuetime.com | @rescuetime | $9/mo | RescueTime gives you an accurate picture of how you spend your time to help you become more productive every day.",
    "url": "https://www.rescuetime.com"
  },
  {
    "name": "Qbserve | https://qotoqot.com/qbserve/ | @Qbserve | $40 one-time | Qbserve is a time tracker for Mac that does whatever RescueTime can but also tracks project time automatically, generates invoices, and stores tracked data locally.",
    "url": "https://qotoqot.com/qbserve/"
  },
  {
    "name": "Timing | https://timingapp.com/ | @TimingApp | $29",
    "url": "https://timingapp.com/",
    "description": "$79 | Automatic time and productivity tracking for Mac. Helps you stay on track with your work and ensures no billable hours get lost (if you are billing hourly)."
  },
  {
    "name": "fman | https://fman.io | @m_herrmann | $14 | Manage and transfer your files with ease. For Windows, Mac and Linux.",
    "url": "https://fman.io"
  },
  {
    "name": "Creately | https://creately.com | @creately | Free",
    "url": "https://creately.com",
    "description": "$750/mo | Creately | Web based diagramming tool for fast easy diagrams. Supports flowcharts, mock-ups, wire-frames, mind maps, organizational charts, network diagrams, AWS diagrams, UML diagrams and many other diagram types. Real-time collaboration plus innovative productivity features to create diagrams 3 times faster."
  },
  {
    "name": "Keynote | https://www.apple.com/keynote/ | $19.99 | Easily create gorgeous presentations with the all-new Keynote, featuring powerful yet easy-to-use tools and dazzling effects that will make you a very hard act to follow. Also checkout the Keynotopia Themes to get all the common UI elements for iOS, Android etc.",
    "url": "https://www.apple.com/keynote/"
  },
  {
    "name": "OmniGraffle | https://www.omnigroup.com/omniGraffle | @omniGraffle | $99.99 | Diagramming Worth a Thousand Words | Need a diagram, process chart, quick page-layout, website wireframe or graphic design? OmniGraffle can help you make eye-popping graphic documents quickly by keeping lines connected to shapes even when they're moved, providing powerful styling tools, and magically organizing diagrams with just one click. Whether you need a quick ",
    "url": "https://www.omnigroup.com/omniGraffle"
  },
  {
    "name": "moqups | https://moqups.com | @moqups | $9/mo-  $39/mo | Moqups is a nifty HTML5 App used to create wireframes, mockups or UI concepts, prototypes\ndepending on how you like to call them. | The most stunning HTML5 app for creating resolution-independent SVG mockups & wireframes for your next project.",
    "url": "https://moqups.com"
  },
  {
    "name": "Balsamiq | https://balsamiq.com | @balsamiq | Life's too short for bad software! | Balsamiq Mockups is a rapid wireframing tool that helps you Work Faster & Smarter. It reproduces the experience of sketching on a whiteboard, but using a computer.",
    "url": "https://balsamiq.com"
  },
  {
    "name": "Proto.io | https://proto.io | @protoio | $24/mo- $199/mo | Silly-fast mobile prototyping | Build high-fidelity fully interactive mobile app prototypes in minutes. Prototypes can be viewed on browser or device giving a real experience to the user how the app will look like and behave. Multiple devices like smart phones and tablets/pads are supported including iPhone, iPad and Android devices.",
    "url": "https://proto.io"
  },
  {
    "name": "invision | https://www.invisionapp.com | @InVisionApp | $0/mo- $100+/mo | Free Web & Mobile (iOS, Android) Prototyping and UI Mockup Tool | Transform your Web & Mobile (iOS, Android) designs into clickable, interactive Prototypes and Mockups. Share and Collaborate on them with others.",
    "url": "https://www.invisionapp.com"
  },
  {
    "name": "Sketch | https://www.sketchapp.com | @sketchapp | $99 | Professional digital design for Mac. Sketch gives you the power, flexibility and speed you always wanted in a lightweight and easy-to-use package. Finally you can focus on what you do best: Design.",
    "url": "https://www.sketchapp.com"
  },
  {
    "name": "Visual.ly | https://visual.ly | @Visually | $195/mo-  $994/mo | ORIGINAL VISUAL CONTENT FOR BRANDS | We only work with the best creative talent available. Thousands of designers,\njournalists, animators and developers are standing by to help you achieve\nyour goals and take your project to the next level.",
    "url": "https://visual.ly"
  },
  {
    "name": "Canva | https://www.canva.com | @canva | Design great social media images with text and graphics for free or a few bucks depending on the images you select",
    "url": "https://www.canva.com"
  },
  {
    "name": "PickFu | https://www.pickfu.com | @pickfu | $20/mo-  $299/mo | REAL CONSUMER FEEDBACK\nIN MINUTES | PickFu is a tool that provides instant, unbiased and insightful public opinion on questions that you care about.",
    "url": "https://www.pickfu.com"
  },
  {
    "name": "Promoter.io | https://www.promoter.io | @Promoter_io | $50/mo",
    "url": "https://www.promoter.io",
    "description": "$500/mo | Helps companies quickly gain predictive customer intelligence & insights driven by NPS (Net Promoter) to increase revenue and reduce churn."
  },
  {
    "name": "Factual | https://www.factual.com | @Factual |  | GLOBAL DATA. LOCAL CONTEXT. | Factual’s location platform enriches mobile location signals with definitive global data, enabling personalized and contextually relevant mobile experiences. Built from billions of inputs, the data is constantly updated by Factual’s real-time data stack.",
    "url": "https://www.factual.com"
  },
  {
    "name": "Bulbs | http://bulbflow.com",
    "url": "http://bulbflow.com"
  },
  {
    "name": "Datomic | https://www.datomic.com | @datomic_team | The fully transactional, cloud-ready, immutable database. | Immutable data means strong consistency combined with horizontal read scalability, plus built-in caching. Datomic is a distributed database designed to enable scalable, flexible and intelligent applications, running on next-generation cloud architectures.",
    "url": "https://www.datomic.com"
  },
  {
    "name": "Tinkerpop | http://tinkerpop.apache.org | Open source software products in the graph space.",
    "url": "http://tinkerpop.apache.org"
  },
  {
    "name": "Vertabelo | http://www.vertabelo.com | Web-based tool for database design | @vertabelo | Vertabelo allows you to visually design database models for PostgreSQL, MySQL, Oracle, SQL Server, SQLite, and IBM DB2. You can import the existing database structure from SQL, XML, or using reverse engineering tool. After you design a model, you can generate SQL script or ready-to-use code for various ORMs (Propel, jOOQ, SQLAlchemy, or Vertabelo Mobile ORM).",
    "url": "http://www.vertabelo.com"
  },
  {
    "name": "Harvest | https://www.getharvest.com | @harvest | $12/mo-  $99/mo | Time Tracking Made Easy | Time tracking is simple and lightning fast with Harvest. Set up takes seconds, and there’s nothing to install. We’ve simplified the timesheet and timesheets approval process so you can stay focused on work.",
    "url": "https://www.getharvest.com"
  },
  {
    "name": "Ballpark | https://www.getballpark.com |  | $12/mo-  $99/mo | Stop sending your clients ugly paper invoices. Go paperless today, with Ballpark. | Our beautiful, web-based invoices and estimates make it easier than ever to get paid and discuss projects with your clients and colleagues.",
    "url": "https://www.getballpark.com"
  },
  {
    "name": "PaySimple | https://paysimple.com | @PaySimple | $34.95/mo | Simplify how you bill and collect | PaySimple is an industry-leading provider of payment management solutions. PaySimple simplifies billing and collection processes by enabling you to bill, collect and deposit all of your payments automatically. Our customized, secure ASP solution includes auto-recurring billing, electronic check processing, direct debit and credit card processing at some of the lowest rates available.",
    "url": "https://paysimple.com"
  },
  {
    "name": "FreshBooks | https://www.freshbooks.com | @freshbooks | $19.95/mo-  $39.95/mo | Accounting Made for You, the Non-Accountant | FreshBooks is simple and intuitive, so accounting isn't intimidating. Plus you can talk to a real, live person anytime you have a question, 9am-6pm EDT, Mon-Fri.",
    "url": "https://www.freshbooks.com"
  },
  {
    "name": "FreeAgent | https://www.freeagent.com | @freeagent | US $20 /mo | Accounting software trusted by over 35,000 freelancers and small businesses | Reconcile money in and out of the business via your electronic bank statements and build monthly balance charts.",
    "url": "https://www.freeagent.com"
  },
  {
    "name": "Blinksale | https://www.blinksale.com | @blinksale | $15.00 | INTRODUCING BLINKSALE UNLIMITED. ONE PLAN. ONE PRICE. UNLIMITED EVERYTHING. | Blinksale makes you look your best. With over a dozen invoice designs & thank you notes, you’re sure to put your best foot forward. Every time.",
    "url": "https://www.blinksale.com"
  },
  {
    "name": "Cashboard | http://cashboardapp.com | @cashboard | $8.25/mo-  $250/mo | FREELANCE TIME TRACKING & INVOICE SOFTWARE\nTRUSTED BY THOUSANDS, WORLDWIDE | Cashboard is the tool we designed to remedy that situation. It works for our software consultancy and we think it’ll work for you too. We launched Cashboard in Spring of 2007after many sleepless nights of hard work. It was the first solution to combine estimates, invoices, time tracking, and online payments into one tool.",
    "url": "http://cashboardapp.com"
  },
  {
    "name": "Paydirt | https://paydirtapp.com | @paydirtapp | $8/mo-  $149/mo | Smart Time Tracking\nEasier Invoicing\nOnline Payments | In Paydirt, you can start a timer from any page in one click. No fiddly menus. No navigating around. Just a start button for each task.",
    "url": "https://paydirtapp.com"
  },
  {
    "name": "iubenda | http://www.iubenda.com | @iubenda | free",
    "url": "http://www.iubenda.com",
    "description": "$27/year - customization services | The easiest way to generate a professional, customizable, self-updating privacy policy. Choose between 6 languages. Documents hosted and kept up to date. Backed by real lawyers. Additional assistance service with premium legal team for custom Privacy Policy and Terms & Conditions."
  },
  {
    "name": "Baremetrics | https://baremetrics.com | @Baremetrics | $79/mo-  $249/mo | One click and you get dozens of valuable metrics from your Stripe account |",
    "url": "https://baremetrics.com"
  },
  {
    "name": "getMetrics | https://getmetrics.io | @getMetrics | $25/mo-  $39/mo | Stripe metrics and notifications for Stripe events |",
    "url": "https://getmetrics.io"
  },
  {
    "name": "PayPal | https://www.paypal.com | @PayPal | PayPal is an international e-commerce business allowing payments and money transfers to be made through the Internet. Online money transfers serve as electronic alternatives to paying with traditional paper methods, such as checks and money orders",
    "url": "https://www.paypal.com"
  },
  {
    "name": "Gumroad | https://gumroad.com | @gumroad |  | See higher conversion, lower fees, and more customer control.\nSell films directly to your viewers. | Creating digital products is hard, selling them shouldn't be. We let you start selling downloads in seconds.",
    "url": "https://gumroad.com"
  },
  {
    "name": "FetchApp | https://www.fetchapp.com | @fetchapp | $5/mo-  $500/mo | The Simpler way to Fetch. | Simply put, FetchApp allows you to sell and digitally delivery downloadable goods",
    "url": "https://www.fetchapp.com"
  },
  {
    "name": "Chargify | https://www.chargify.com | @chargify | $459/mo-  $65/mo | Easily Manage Your Recurring Revenue Business | Customers sign up, make payments, use coupons, upgrade... You bill one-time & recurring fees using whatever pricing model you need, charge cards, send invoices & reminders, etc.",
    "url": "https://www.chargify.com"
  },
  {
    "name": "Recurly | https://recurly.com | @Recurly | $99/mo-  $259/mo | Subscription Billing Automation | As the leading recurring billing platform, Recurly ensures setup is easy, integrations are quick, and our service scales with the needs of your business. With Recurly you'll be ready to accept payments and focus on growing your sales in no time.",
    "url": "https://recurly.com"
  },
  {
    "name": "ChargeBee | https://www.chargebee.com | @chargebee | $49/mo-  $249/mo | ChargeBee is an easy to use recurring billing and invoicing solution for online businesses",
    "url": "https://www.chargebee.com"
  },
  {
    "name": "Braintree | https://www.braintreepayments.com | @braintree |  | Accept payments in\nyour app or website | Braintree handles transactions for some of the fastest growing mobile companies like Uber, Airbnb, HotelTonight and Fab. With native, easy-to-follow SDKs for iOS, Android and Windows Phone you can quickly add native payments to your app.",
    "url": "https://www.braintreepayments.com"
  },
  {
    "name": "Dwolla | https://www.dwolla.com | @dwolla | 25¢ per transaction | The best way to move money. | Dwolla, Inc. is an agent of Veridian Credit Union and all funds associated with your account in the Dwolla network are held in a pooled account at Veridian Credit Union. These funds are not eligible for individual insurance, and may not be eligible for share insurance by the National Credit Union Share Insurance Fund. Dwolla, Inc. is the operator of a software platform that communicates user instructions for funds transfers to Veridian Credit Union.",
    "url": "https://www.dwolla.com"
  },
  {
    "name": "Stripe | https://stripe.com | @stripe | 2.9% + 30¢\nper successful charge. | Feature-packed payments | No need to design payment forms from scratch. Stripe Checkout offers a beautiful, customizable payment flow that works great across desktop and mobile. When you use Checkout, you’re always up-to-date, with no extra code required.",
    "url": "https://stripe.com"
  },
  {
    "name": "Pin | https://pinpayments.com | @pin_payments | 2.9% + 30¢\nper successful charge. | Payments, Rebooted. | Accepting credit card payments from a global audience typically requires a merchant acount. The process of establishing a merchant account for each currency can be too difficult and costly for small businesses.",
    "url": "https://pinpayments.com"
  },
  {
    "name": "PayMill | https://www.paymill.com | @Paymill | 0.28 €",
    "url": "https://www.paymill.com",
    "description": "0.25 € | Online payments made easy | Make payments personal by customising the checkout according to the flow of your website"
  },
  {
    "name": "Spreedly | https://www.spreedly.com | @spreedly | $150/mo",
    "url": "https://www.spreedly.com",
    "description": "$1500/mo | Payments as a Platform | One of Spreedly's major benefits is reaching a large number of merchant accounts by working across multiple payment gateways. As a direct merchant you can transact globally but deposit funds in unique merchant accounts based on geographic or other business rules. As a SaaS platform you can support the unique merchant accounts of your individual customers. A payment gateway token is your way to indicate to us which unique merchant account this particular transaction will go against. Each unique merchant account = one unique payment gateway token."
  },
  {
    "name": "WePay | https://go.wepay.com | @wepay | 2.9% + 30¢ per transaction. | WePay is the first payments engine to offer platforms — marketplaces, crowdfunding, and business software/tools — a way to own their customer experience while still shielding them from 100 percent of fraud and regulatory risk.",
    "url": "https://go.wepay.com"
  },
  {
    "name": "Paddle | https://paddle.com | @PaddleHQ | 5% + 50¢ per transaction. | Payment processing and fulfillment, specialized for desktop apps and SaaS subscription services. Handles VAT and invoicing for you, so your accounting becomes easier.",
    "url": "https://paddle.com"
  },
  {
    "name": "Simple | https://www.simple.com @simple | The way banking should be.",
    "url": "https://www.simple.com"
  },
  {
    "name": "Plivo | https://www.plivo.com/",
    "url": "https://www.plivo.com/"
  },
  {
    "name": "Tropo | https://www.tropo.com/",
    "url": "https://www.tropo.com/"
  },
  {
    "name": "Twilio | https://www.twilio.com/",
    "url": "https://www.twilio.com/"
  },
  {
    "name": "PhoneBooth | http://www.phonebooth.com/",
    "url": "http://www.phonebooth.com/"
  },
  {
    "name": "TalkDesk | https://www.talkdesk.com/",
    "url": "https://www.talkdesk.com/"
  },
  {
    "name": "HelloFax | https://www.hellofax.com/",
    "url": "https://www.hellofax.com/"
  },
  {
    "name": "Dialpad | https://www.dialpad.com | @DialpadHQ | $15/user/mo | people-first phone and meeting system that includes internet fax and follows you where you work",
    "url": "https://www.dialpad.com"
  },
  {
    "name": "AppNeta (Tracelytics) | https://www.appneta.com/",
    "url": "https://www.appneta.com/"
  },
  {
    "name": "Sensu | https://sensuapp.org/",
    "url": "https://sensuapp.org/"
  },
  {
    "name": "Riemann | http://riemann.io",
    "url": "http://riemann.io"
  },
  {
    "name": "Pingdom | https://www.pingdom.com/",
    "url": "https://www.pingdom.com/"
  },
  {
    "name": "UptimeRobot | https://uptimerobot.com/",
    "url": "https://uptimerobot.com/"
  },
  {
    "name": "Where's It Up? | https://wheresitup.com/",
    "url": "https://wheresitup.com/"
  },
  {
    "name": "Bonsai | https://bonsai.io/",
    "url": "https://bonsai.io/"
  },
  {
    "name": "WebSolr | https://www.websolr.com",
    "url": "https://www.websolr.com"
  },
  {
    "name": "Searchify | http://www.searchify.com/",
    "url": "http://www.searchify.com/"
  },
  {
    "name": "SearchBlox | https://www.searchblox.com",
    "url": "https://www.searchblox.com"
  },
  {
    "name": "Burp | https://portswigger.net/burp",
    "url": "https://portswigger.net/burp"
  },
  {
    "name": "DuoSecurity | https://duo.com/",
    "url": "https://duo.com/"
  },
  {
    "name": "Authy | https://authy.com/",
    "url": "https://authy.com/"
  },
  {
    "name": "AnchorFree | https://www.anchorfree.com",
    "url": "https://www.anchorfree.com"
  },
  {
    "name": "Encrypt.me | https://encrypt.me",
    "url": "https://encrypt.me"
  },
  {
    "name": "Tinfoil Security | https://www.tinfoilsecurity.com/",
    "url": "https://www.tinfoilsecurity.com/"
  },
  {
    "name": "Shipwire | https://www.shipwire.com/",
    "url": "https://www.shipwire.com/"
  },
  {
    "name": "Shyp | https://www.shyp.com/",
    "url": "https://www.shyp.com/"
  },
  {
    "name": "Whiplash | https://www.getwhiplash.com",
    "url": "https://www.getwhiplash.com"
  },
  {
    "name": "Uservoice | https://www.uservoice.com/",
    "url": "https://www.uservoice.com/"
  },
  {
    "name": "Userecho | https://userecho.com/",
    "url": "https://userecho.com/"
  },
  {
    "name": "Dribbble | https://dribbble.com",
    "url": "https://dribbble.com"
  },
  {
    "name": "Sortfolio | http://sortfolio.com",
    "url": "http://sortfolio.com"
  },
  {
    "name": "Behance | https://www.behance.net",
    "url": "https://www.behance.net"
  },
  {
    "name": "Evernote | https://evernote.com/",
    "url": "https://evernote.com/"
  },
  {
    "name": "Google Keep | https://www.google.com/keep/",
    "url": "https://www.google.com/keep/"
  },
  {
    "name": "Workflowy | https://workflowy.com/",
    "url": "https://workflowy.com/"
  },
  {
    "name": "Quip | https://quip.com/",
    "url": "https://quip.com/"
  },
  {
    "name": "Etherpad | http://etherpad.org/",
    "url": "http://etherpad.org/"
  },
  {
    "name": "Kami | https://www.kamihq.com | View, edit, annotate, and collaborate on documents on your browser",
    "url": "https://www.kamihq.com"
  },
  {
    "name": "OneNote | http://www.onenote.com/ | @msonenote | free | The digital note-taking app for your devices",
    "url": "http://www.onenote.com/"
  },
  {
    "name": "Taskade | https://www.taskade.com | @taskade | free | Real-time collaborative notes, checklists, and outlines for teams.",
    "url": "https://www.taskade.com"
  },
  {
    "name": "Kandan | http://kandanapp.com/",
    "url": "http://kandanapp.com/"
  },
  {
    "name": "Yammer | https://www.yammer.com/",
    "url": "https://www.yammer.com/"
  },
  {
    "name": "Limechat | http://limechat.net/",
    "url": "http://limechat.net/"
  },
  {
    "name": "Flowdock | Free for teams up to 5 people | https://www.flowdock.com/",
    "url": "https://www.flowdock.com/"
  },
  {
    "name": "Stride | Free | https://www.stride.com",
    "url": "https://www.stride.com"
  },
  {
    "name": "Slack | https://slack.com/ | Free",
    "url": "https://slack.com/",
    "description": "$12.5/user | Team collaboration and chat tool. Supports webhooks and has integrations with other tools."
  },
  {
    "name": "Skype | https://www.skype.com | Free | Video conference, chat and voice call VOIP application.",
    "url": "https://www.skype.com"
  },
  {
    "name": "Google Hangouts | https://hangouts.google.com/ | Free | Video conference and chat application by Google. It is browser based and supports multiple participants on the same video call.",
    "url": "https://hangouts.google.com/"
  },
  {
    "name": "GoToMeeting | https://www.gotomeeting.com",
    "url": "https://www.gotomeeting.com"
  },
  {
    "name": "IRCCloud | https://www.irccloud.com/",
    "url": "https://www.irccloud.com/"
  },
  {
    "name": "Buddycloud | http://buddycloud.com",
    "url": "http://buddycloud.com"
  },
  {
    "name": "Gitter | https://gitter.im | Chat for open-source and private development teams, with strong Github integration features",
    "url": "https://gitter.im"
  },
  {
    "name": "Convo | https://www.convo.com/",
    "url": "https://www.convo.com/"
  },
  {
    "name": "Zoom | https://www.zoom.us/",
    "url": "https://www.zoom.us/"
  },
  {
    "name": "Telegram | https://telegram.org/",
    "url": "https://telegram.org/"
  },
  {
    "name": "TeamViewer | https://www.teamviewer.com",
    "url": "https://www.teamviewer.com"
  },
  {
    "name": "Screenmailer | https://www.screenmailer.com",
    "url": "https://www.screenmailer.com"
  },
  {
    "name": "Screenhero | https://screenhero.com/",
    "url": "https://screenhero.com/"
  },
  {
    "name": "DynDNS | https://dyn.com/dns/",
    "url": "https://dyn.com/dns/"
  },
  {
    "name": "Cloudflare | https://www.cloudflare.com/",
    "url": "https://www.cloudflare.com/"
  },
  {
    "name": "Amazon Route 53 | https://aws.amazon.com/route53/",
    "url": "https://aws.amazon.com/route53/"
  },
  {
    "name": "DNSimple | https://dnsimple.com/",
    "url": "https://dnsimple.com/"
  },
  {
    "name": "ClouDNS | https://www.cloudns.net/",
    "url": "https://www.cloudns.net/"
  },
  {
    "name": "FreeDNS | http://freedns.afraid.org",
    "url": "http://freedns.afraid.org"
  },
  {
    "name": "StatusPage.io | https://www.statuspage.io/",
    "url": "https://www.statuspage.io/"
  },
  {
    "name": "Tumblr | https://www.tumblr.com/",
    "url": "https://www.tumblr.com/"
  },
  {
    "name": "HelloBar | https://www.hellobar.com |",
    "url": "https://www.hellobar.com"
  },
  {
    "name": "Status.io | https://status.io | @statusio | Hosted system status pages",
    "url": "https://status.io"
  },
  {
    "name": "Wufoo | https://www.wufoo.com",
    "url": "https://www.wufoo.com"
  },
  {
    "name": "Typeform | https://www.typeform.com | @typeform | $0/mo",
    "url": "https://www.typeform.com",
    "description": "$25/mo | Ask Awesomely! | Typeform makes asking questions easy, human & beautiful. A user experience that makes your questions look & feel great everywhere. Stimulated, inspired, excited, happy respondents boost completion rates. Gain insights with integrated analysis tools."
  },
  {
    "name": "Qualaroo | https://qualaroo.com | @qualarooinc | $63/mo -499/mo | Qualaroo website surveys uncover customer insights that lead to better business results.",
    "url": "https://qualaroo.com"
  },
  {
    "name": "Formcarry | https://formcarry.com | $0/mo",
    "url": "https://formcarry.com",
    "description": "$99/mo | Handle forms without a single line of back-end code."
  },
  {
    "name": "BitBucket | https://bitbucket.org/",
    "url": "https://bitbucket.org/"
  },
  {
    "name": "Codebase | https://www.codebasehq.com/",
    "url": "https://www.codebasehq.com/"
  },
  {
    "name": "GitHub | https://github.com/",
    "url": "https://github.com/"
  },
  {
    "name": "Unfuddle | https://unfuddle.com/",
    "url": "https://unfuddle.com/"
  },
  {
    "name": "GitLab | https://about.gitlab.com/",
    "url": "https://about.gitlab.com/"
  },
  {
    "name": "Launchpad | https://launchpad.net/",
    "url": "https://launchpad.net/"
  },
  {
    "name": "TuxFamily | https://www.tuxfamily.org",
    "url": "https://www.tuxfamily.org"
  },
  {
    "name": "KForge | https://pypi.python.org/pypi/kforge",
    "url": "https://pypi.python.org/pypi/kforge"
  },
  {
    "name": "VersionShelf | https://www.versionshelf.com | 30-day Free trial, free for students/teachers.",
    "url": "https://www.versionshelf.com"
  },
  {
    "name": "Assembla | https://www.assembla.com/home | @assembla | $24/m",
    "url": "https://www.assembla.com/home",
    "description": "$99/m | Git hosting, all tightly integrated with your tasks. Browse files online, compare revisions, merge code and maintain a sustainable codebase."
  },
  {
    "name": "ConceptShare | https://www.conceptshare.com",
    "url": "https://www.conceptshare.com"
  },
  {
    "name": "Framebench | http://www.framebench.com | @framebench | The 'smooth' way to Share, Review & Discuss any file online.",
    "url": "http://www.framebench.com"
  },
  {
    "name": "Notable | http://www.notableapp.com/",
    "url": "http://www.notableapp.com/"
  },
  {
    "name": "Heroku | https://www.heroku.com | 1000 free hours/month for verified accounts",
    "url": "https://www.heroku.com"
  },
  {
    "name": "Cloud Foundry | https://www.cloudfoundry.org | host it yourself, or use one of MANY hosting services",
    "url": "https://www.cloudfoundry.org"
  },
  {
    "name": "Pagodabox | https://pagodabox.io |",
    "url": "https://pagodabox.io"
  },
  {
    "name": "Clever Cloud | https://www.clever-cloud.com |",
    "url": "https://www.clever-cloud.com"
  },
  {
    "name": "Google App Engine |  https://cloud.google.com/appengine/docs/ |",
    "url": "https://cloud.google.com/appengine/docs/"
  },
  {
    "name": "OpenShift | https://www.openshift.com | OpenShift gives you all the tools you need to develop, host and scale your apps in the public or private cloud. Get started today.",
    "url": "https://www.openshift.com"
  },
  {
    "name": "Engine Yard | https://www.engineyard.com",
    "url": "https://www.engineyard.com"
  },
  {
    "name": "AppFog | https://www.ctl.io/appfog/",
    "url": "https://www.ctl.io/appfog/"
  },
  {
    "name": "Jelastic | https://jelastic.com/",
    "url": "https://jelastic.com/"
  },
  {
    "name": "CloudBees | https://www.cloudbees.com",
    "url": "https://www.cloudbees.com"
  },
  {
    "name": "Microsoft Azure | https://azure.microsoft.com | Known for IaaS",
    "url": "https://azure.microsoft.com"
  },
  {
    "name": "Amazon Web Services | https://aws.amazon.com/elasticbeanstalk/ | Like Azure, it's more known for IaaS",
    "url": "https://aws.amazon.com/elasticbeanstalk/"
  },
  {
    "name": "Deis | http://deis.io (DIY PaaS)",
    "url": "http://deis.io"
  },
  {
    "name": "Linode |  https://www.linode.com/",
    "url": "https://www.linode.com/"
  },
  {
    "name": "Ramnode | http://www.ramnode.com/",
    "url": "http://www.ramnode.com/"
  },
  {
    "name": "DigitalOcean | https://www.digitalocean.com/",
    "url": "https://www.digitalocean.com/"
  },
  {
    "name": "Vultr | https://www.vultr.com/",
    "url": "https://www.vultr.com/"
  },
  {
    "name": "OVH | https://www.ovh.com",
    "url": "https://www.ovh.com"
  },
  {
    "name": "Hirefire | https://hirefire.io/",
    "url": "https://hirefire.io/"
  },
  {
    "name": "Ylastic | http://ylastic.com/",
    "url": "http://ylastic.com/"
  },
  {
    "name": "Skeddly | https://www.skeddly.com",
    "url": "https://www.skeddly.com"
  },
  {
    "name": "HumongouS.io | https://www.humongous.io | HumongouS.io is a web-based user interface (GUI) for MongoDB.",
    "url": "https://www.humongous.io"
  },
  {
    "name": "mLab | https://mlab.com |",
    "url": "https://mlab.com"
  },
  {
    "name": "Compose | https://www.compose.com | Compose is a fully-managed platform used by developers to deploy, host and scale databases (Elasticsearch and MongoDB.)",
    "url": "https://www.compose.com"
  },
  {
    "name": "RedisLabs | https://redislabs.com | @RedisLabsInc | free",
    "url": "https://redislabs.com",
    "description": "$338+/mo | RedisLabs offers fully-managed cloud service for hosting and running your redis or memcache datasets in a highly-available and scalable manner, with predictable and stable top performance."
  },
  {
    "name": "Firebase | https://firebase.google.com | @Firebase | A powerful API to store and sync data in realtime. | Build realtime mobile and web apps in minutes using client-side code and the powerful Firebase API. When data changes, apps built with Firebase update instantly across every device -- web or mobile.",
    "url": "https://firebase.google.com"
  },
  {
    "name": "Hoodie | http://hood.ie/",
    "url": "http://hood.ie/"
  },
  {
    "name": "BaasBox | https://www.baasbox.com",
    "url": "https://www.baasbox.com"
  },
  {
    "name": "LoopBack | http://loopback.io/",
    "url": "http://loopback.io/"
  },
  {
    "name": "Pusher | https://pusher.com |",
    "url": "https://pusher.com"
  },
  {
    "name": "ScaleDrone | https://www.scaledrone.com |",
    "url": "https://www.scaledrone.com"
  },
  {
    "name": "PagerDuty | https://www.pagerduty.com/",
    "url": "https://www.pagerduty.com/"
  },
  {
    "name": "Opsgenie | https://www.opsgenie.com | @opsgenie | $0",
    "url": "https://www.opsgenie.com",
    "description": "$16 user/month | We make alerts work for you | We provide the tools you need to design meaningful, actionable alerts and ensure the right people are notified."
  },
  {
    "name": "inDinero | https://www.indinero.com",
    "url": "https://www.indinero.com"
  },
  {
    "name": "QuickBooks Online | https://qbo.intuit.com/qbo27/login?webredir",
    "url": "https://qbo.intuit.com/qbo27/login?webredir"
  },
  {
    "name": "Xero | https://www.xero.com",
    "url": "https://www.xero.com"
  },
  {
    "name": "Wistia | https://wistia.com |",
    "url": "https://wistia.com"
  },
  {
    "name": "Confluence | https://www.atlassian.com/software/confluence",
    "url": "https://www.atlassian.com/software/confluence"
  },
  {
    "name": "Confluence Questions (Q&A for your team) | https://www.atlassian.com/software/confluence/questions",
    "url": "https://www.atlassian.com/software/confluence/questions"
  },
  {
    "name": "SlimWiki | https://slimwiki.com |",
    "url": "https://slimwiki.com"
  },
  {
    "name": "Tarsnap | http://www.tarsnap.com",
    "url": "http://www.tarsnap.com"
  },
  {
    "name": "SpiderOak | https://spideroak.com | @spideroak | First 2gb free",
    "url": "https://spideroak.com",
    "description": "$100/100gb/year (check their twitter for deals) | Store. Sync. Share. Privately."
  },
  {
    "name": "Crashplan | https://www.crashplan.com",
    "url": "https://www.crashplan.com"
  },
  {
    "name": "oDesk | https://www.upwork.com",
    "url": "https://www.upwork.com"
  },
  {
    "name": "Freelancer | https://www.freelancer.com/",
    "url": "https://www.freelancer.com/"
  },
  {
    "name": "TaskArmy | https://taskarmy.com",
    "url": "https://taskarmy.com"
  },
  {
    "name": "99Designs | https://99designs.com/",
    "url": "https://99designs.com/"
  },
  {
    "name": "Fiverr | https://www.fiverr.com",
    "url": "https://www.fiverr.com"
  },
  {
    "name": "Chef | https://www.chef.io",
    "url": "https://www.chef.io"
  },
  {
    "name": "Fabric | http://www.fabfile.org",
    "url": "http://www.fabfile.org"
  },
  {
    "name": "Puppet | https://puppet.com",
    "url": "https://puppet.com"
  },
  {
    "name": "Ansible | https://www.ansible.com",
    "url": "https://www.ansible.com"
  },
  {
    "name": "Vagrant | https://www.vagrantup.com",
    "url": "https://www.vagrantup.com"
  },
  {
    "name": "Salt | https://saltstack.com/community/",
    "url": "https://saltstack.com/community/"
  },
  {
    "name": "Prelang | http://prelang.com | Free | Automatic Rails Development",
    "url": "http://prelang.com"
  },
  {
    "name": "AccuRanker | https://www.accuranker.com/",
    "url": "https://www.accuranker.com/"
  },
  {
    "name": "Ahrefs | https://ahrefs.com | @ahrefs | $79/mo",
    "url": "https://ahrefs.com",
    "description": "$2500/mo | Ahrefs provide a complete digital marketing suite with tools for analyzing back links, analizing websites, rank tracking, content exploring and more."
  },
  {
    "name": "SerpBook | https://serpbook.com",
    "url": "https://serpbook.com"
  },
  {
    "name": "WooRank | https://www.woorank.com | @woorank | Free",
    "url": "https://www.woorank.com",
    "description": "$49/mo | WooRank analyzes your website for optimization best practices and shows how it ranks against your competition. Its real-time brandable reports, consisting of over 150 data-points, help you to instantly spot critical issues that impact traffic, usability and conversions. Sync your analytics, social accounts and keywords for even more robust tracking."
  },
  {
    "name": "Moz | https://moz.com | @moz | $99/mo",
    "url": "https://moz.com",
    "description": "$599/mo | Moz provides you all the tools you need to effectively do search engine optimization. On site optimization graders, competitor tracking, back link analysis, rank trakcing and many more features available to users."
  },
  {
    "name": "Deployd | http://deployd.com | @deploydapp | Free (OSS) | Design, build, and scale APIs for web and mobile apps in minutes instead of days.",
    "url": "http://deployd.com"
  },
  {
    "name": "Apiary | https://apiary.io | @apiary | Free",
    "url": "https://apiary.io",
    "description": "$99/mo | Powerful API Design Stack. Built for Developers. | Work together to quickly design, prototype, document and test APIs."
  },
  {
    "name": "Lastpass | https://www.lastpass.com",
    "url": "https://www.lastpass.com"
  },
  {
    "name": "1Password  | https://1password.com",
    "url": "https://1password.com"
  },
  {
    "name": "Passpack | https://www.passpack.com",
    "url": "https://www.passpack.com"
  },
  {
    "name": "KeePassX | https://www.keepassx.org | Recommended by EFF",
    "url": "https://www.keepassx.org"
  },
  {
    "name": "Enpass | https://www.enpass.io",
    "url": "https://www.enpass.io"
  },
  {
    "name": "KeePass | https://keepass.info",
    "url": "https://keepass.info"
  },
  {
    "name": "NeoReach | https://neoreach.com/",
    "url": "https://neoreach.com/"
  },
  {
    "name": "SiteScout | http://www.sitescout.com/",
    "url": "http://www.sitescout.com/"
  },
  {
    "name": "Bing Ads | http://advertise.bingads.microsoft.com",
    "url": "http://advertise.bingads.microsoft.com"
  },
  {
    "name": "Taboola | https://www.taboola.com/",
    "url": "https://www.taboola.com/"
  },
  {
    "name": "Outbrain | https://www.outbrain.com/",
    "url": "https://www.outbrain.com/"
  },
  {
    "name": "Google Adwords | http://www.google.com/adwords/",
    "url": "http://www.google.com/adwords/"
  },
  {
    "name": "Facebook Advertising | https://www.facebook.com/business/",
    "url": "https://www.facebook.com/business/"
  },
  {
    "name": "Kloudless | https://kloudless.com | @Kloudless | $10/10k API requests/month | Kloudless provides developers with a single cloud storage API in the place of many | Kloudless is the last cloud storage API you'll ever need. Integrate a single REST API instead of many and use our UI tools to quickly build cloud storage support into your app. We maintain all the integrations so you can focus on building awesome products.",
    "url": "https://kloudless.com"
  },
  {
    "name": "EasyCron | https://www.easycron.com",
    "url": "https://www.easycron.com"
  },
  {
    "name": "IFTTT | https://ifttt.com",
    "url": "https://ifttt.com"
  },
  {
    "name": "Zapier | https://zapier.com | Zapier | $99/mo",
    "url": "https://zapier.com",
    "description": "$15/mo | Superpowers to get your work done. | A Zap is a link between two apps (a \"trigger\" and an \"action\"). Zaps run automatically in the background every few minutes to move and manage data on your behalf. Only live Zaps count against your limit — you can have as many paused and unfinished Zaps as you'd like. For example, one Zap might be \"Send me an SMS every time I get a new email\"."
  },
  {
    "name": "Dash | https://kapeli.com/dash",
    "url": "https://kapeli.com/dash"
  },
  {
    "name": "Zeal | https://zealdocs.org | @zealdocs | Free | Offline documentation browser",
    "url": "https://zealdocs.org"
  },
  {
    "name": "Moo | https://www.moo.com",
    "url": "https://www.moo.com"
  },
  {
    "name": "PSPrint | https://www.psprint.com",
    "url": "https://www.psprint.com"
  },
  {
    "name": "Vista Print | http://vistaprint.com",
    "url": "http://vistaprint.com"
  },
  {
    "name": "Prezi | https://prezi.com/",
    "url": "https://prezi.com/"
  },
  {
    "name": "markpress | https://github.com/gamell/markpress | HTML presentations from Markdown files",
    "url": "https://github.com/gamell/markpress"
  },
  {
    "name": "Reveal.js | https://github.com/hakimel/reveal.js | Flexible HTML presenation framework for creating beautiful slides",
    "url": "https://github.com/hakimel/reveal.js"
  },
  {
    "name": "Slides | https://slides.com/ | Free",
    "url": "https://slides.com/",
    "description": "$20/mo | Online editor built with Reveal.js that includes a graphical interface"
  }
]
