[
  {
    "name": "Entrez Direct: E-utilities on the UNIX command line",
    "url": "http://www.ncbi.nlm.nih.gov/books/NBK179288/",
    "description": "UNIX command line tools to access NCBI's databases programmatically. Instructions to install and examples are found in the link."
  },
  {
    "name": "What is a bioinformatician",
    "url": "http://blog.fejes.ca/?p=2418"
  },
  {
    "name": "Bioinformatics Curriculum Guidelines: Toward a Definition of Core Competencies",
    "url": "http://www.ploscompbiol.org/article/info:doi%2F10.1371%2Fjournal.pcbi.1003496"
  },
  {
    "name": "Top N Reasons To Do A Ph.D. or Post-Doc in Bioinformatics/Computational Biology",
    "url": "http://caseybergman.wordpress.com/2012/07/31/top-n-reasons-to-do-a-ph-d-or-post-doc-in-bioinformaticscomputational-biology/"
  },
  {
    "name": "A 10-Step Guide to Party Conversation For Bioinformaticians",
    "url": "https://genomebiology.biomedcentral.com/articles/10.1186/gb-2013-14-1-104",
    "description": "Here is a step-by-step guide on how to convey concepts to people not involved in the field when asked the question: 'So, what do you do?'"
  },
  {
    "name": "A History Of Bioinformatics (In The Year 2039)",
    "url": "https://www.youtube.com/watch?v=uwsjwMO-TEA",
    "description": "A talk by C. Titus Brown on his take of looking back at bioinformatics from the year 2039. His notes for this talk can be found here."
  },
  {
    "name": "A farewell to bioinformatics",
    "url": "http://madhadron.com/posts/2012-03-26-a-farewell-to-bioinformatics.html",
    "description": "A critical view of the state of bioinformatics."
  },
  {
    "name": "A Series of Interviews with Notable Bioinformaticians",
    "url": "http://www.acgt.me/blog/2014/3/25/101-questions-a-new-series-of-interviews-with-notable-bioinformaticians",
    "description": "Dr. Keith Bradnam \"thought it might be instructive to ask a simple series of questions to a bunch of notable bioinformaticians to assess their feelings on the current state of bioinformatics research, and maybe get any tips they have about what has been useful to their bioinformatics careers.\""
  },
  {
    "name": "Open Source Society University on Bioinformatics",
    "url": "https://github.com/ossu/bioinformatics",
    "description": "Solid path for those of you who want to complete a Bioinformatics course on your own time, for free, with courses from the best universities in the World."
  },
  {
    "name": "Rosalind",
    "url": "http://rosalind.info/",
    "description": "Rosalind is a platform for learning bioinformatics through problem solving."
  },
  {
    "name": "A guide for the lonely bioinformatician",
    "url": "http://www.opiniomics.org/a-guide-for-the-lonely-bioinformatician/",
    "description": "This guide is aimed at bioinformaticians, and is meant to guide them towards better career development."
  },
  {
    "name": "Next-Generation Sequencing Technologies",
    "url": "https://youtu.be/6Is3W7JkFp8",
    "description": "Elaine Mardis (2014) [1:34:35] - Excellent (technical) overview of next-generation and third-generation sequencing technologies, along with some applications in cancer research."
  },
  {
    "name": "Annotated bibliography of *Seq assays",
    "url": "https://liorpachter.wordpress.com/seq/",
    "description": "List of ~100 papers on various sequencing technologies and assays ranging from transcription to transposable element discovery."
  },
  {
    "name": "For all you seq... (PDF) (3456x5471)",
    "url": "http://www.illumina.com/content/dam/illumina-marketing/documents/applications/ngs-library-prep/ForAllYouSeqMethods.pdf",
    "description": "Massive infographic by Illumina on illustrating how many sequencing techniques work. Techniques cover protein-protein interactions, RNA transcription, RNA-protein interactions, RNA low-level detection, RNA modifications, RNA structure, DNA rearrangements and markers, DNA low-level detection, epigenetics, and DNA-protein interactions. References included."
  },
  {
    "name": "Review papers on RNA-seq (Biostars)",
    "url": "https://www.biostars.org/p/52152/",
    "description": "Includes lots of seminal papers on RNA-seq and analysis methods."
  },
  {
    "name": "Informatics for RNA-seq: A web resource for analysis on the cloud",
    "url": "https://github.com/griffithlab/rnaseq_tutorial",
    "description": "Educational resource on performing RNA-seq analysis in the cloud using Amazon AWS cloud services. Topics include preparing the data, preprocessing, differential expression, isoform discovery, data visualization, and interpretation."
  },
  {
    "name": "RNA-seqlopedia",
    "url": "http://rnaseq.uoregon.edu/",
    "description": "RNA-seqlopedia provides an awesome overview of RNA-seq and of the choices necessary to carry out a successful RNA-seq experiment."
  },
  {
    "name": "A survey of best practices for RNA-seq data analysis",
    "url": "http://genomebiology.biomedcentral.com/articles/10.1186/s13059-016-0881-8",
    "description": "Gives awesome roadmap for RNA-seq computational analyses, including challenges/obstacles and things to look out for, but also how you might integrate RNA-seq data with other data types."
  },
  {
    "name": "Stories from the Supplement [46:39]",
    "url": "https://www.youtube.com/watch?v=5NiFibnbE8o",
    "description": "Dr. Lior Pachter shares his stories from the supplement for well-known RNA-seq analysis software CuffDiff and Cufflinks and explains some of their methodologies."
  },
  {
    "name": "List of RNA-seq Bioinformatics Tools",
    "url": "https://en.wikipedia.org/wiki/List_of_RNA-Seq_bioinformatics_tools",
    "description": "Extensive list on Wikipedia of RNA-seq bioinformatics tools needed in analysis, ranging from all parts of an analysis pipeline from quality control, alignment, splice analysis, and visualizations."
  },
  {
    "name": "RNA-seq Analysis",
    "url": "https://github.com/crazyhottommy/RNA-seq-analysis",
    "description": "@crazyhottommy's notes on various steps and considerations when doing RNA-seq analysis."
  },
  {
    "name": "ChIP-seq analysis notes from Tommy Tang",
    "url": "https://github.com/crazyhottommy/ChIP-seq-analysis",
    "description": "Resources on ChIP-seq data which include papers, methods, links to software, and analysis."
  },
  {
    "name": "Current Topics in Genome Analysis 2016",
    "url": "https://www.genome.gov/12514288/current-topics-in-genome-analysis-2016-course-syllabus-handouts-and-videos/",
    "description": "Excellent series of fourteen lectures given at NIH about current topics in genomics ranging from sequence analysis, to sequencing technologies, and even more translational topics such as genomic medicine."
  },
  {
    "name": "GenomeTV",
    "url": "https://www.youtube.com/user/GenomeTV",
    "description": "\"GenomeTV is NHGRI's collection of official video resources from lectures, to news documentaries, to full video collections of meetings that tackle the research, issues and clinical applications of genomic research.\""
  },
  {
    "name": "Leading Strand",
    "url": "https://www.youtube.com/user/LeadingStrand",
    "description": "Keynote lectures from Cold Spring Harbor Laboratory (CSHL) Meetings. More on The Leading Strand."
  },
  {
    "name": "Genomics, Big Data and Medicine Seminar Series",
    "url": "https://www.youtube.com/playlist?list=PLqLDR0CTP9_pboZCk6gR9Zn4kW7h9XWJI",
    "description": "\"Our seminars are dedicated to the critical intersection of GBM, delving into 'bleeding edge' technology and approaches that will deeply shape the future.\""
  },
  {
    "name": "Rafael Irizarry's Channel",
    "url": "https://www.youtube.com/user/RafalabChannel/videos",
    "description": "Dr. Rafael Irizarry's lectures and academic talks on statistics for genomics."
  },
  {
    "name": "NIH VideoCasting and Podcasting",
    "url": "https://www.youtube.com/user/nihvcast",
    "description": "\"NIH VideoCast broadcasts seminars, conferences and meetings live to a world-wide audience over the Internet as a real-time streaming video.\" Not exclusively genomics and bioinformatics video but many great talks on domain specific use of bioinformatics and genomics."
  },
  {
    "name": "ACGT",
    "url": "http://www.acgt.me/",
    "description": "Dr. Keith Bradnam writes about this \"thoughts on biology, genomics, and the ongoing threat to humanity from the bogus use of bioinformatics acroynums.\""
  },
  {
    "name": "Opiniomics",
    "url": "http://www.opiniomics.org/",
    "description": "Dr. Mick Watson write on bioinformatics, genomes, and biology."
  },
  {
    "name": "Bits of DNA",
    "url": "https://liorpachter.wordpress.com/",
    "description": "Dr. Lior Pachter writes review and commentary on computational biology."
  },
  {
    "name": "it is NOT junk",
    "url": "http://www.michaeleisen.org/blog/",
    "description": "Dr. Michael Eisen writes \"a blog about genomes, DNA, evolution, open science, baseball and other important things\""
  },
  {
    "name": "The Leek group guide to genomics papers",
    "url": "https://github.com/jtleek/genomicspapers/",
    "description": "Expertly curated genomics papers to get up to speed on genomics, RNA-seq, statistics (used in genomics), software development, and more."
  },
  {
    "name": "A New Online Computational Biology Curriculum",
    "url": "https://doi.org/10.1371/journal.pcbi.1003662",
    "description": "\"This article introduces a catalog of several hundred free video courses of potential interest to those wishing to expand their knowledge of bioinformatics and computational biology. The courses are organized into eleven subject areas modeled on university departments and are accompanied by commentary and career advice.\""
  },
  {
    "name": "How Perl Saved the Human Genome Project",
    "url": "http://www.foo.be/docs/tpj/issues/vol1_2/tpj0102-0001.html",
    "description": "An anecdote by Lincoln D. Stein on the importance of the Perl programming language in the Human Genome Project."
  },
  {
    "name": "Educational Papers from Nature Biotechnology and PLoS Computational Biology",
    "url": "https://liacs.leidenuniv.nl/%7Ehoogeboomhj/mcb/nature_primer.html",
    "description": "Page of links to primers and short educational articles on various methods used in computational biology and bioinformatics."
  },
  {
    "name": "The PeerJ Bioinformatics Software Tools Collection",
    "url": "https://peerj.com/collections/45-bioinformatics-software/",
    "description": "Collection of tools curated by Keith Crandall and Claus White, aimed at collating the most interesting, innovative, and relevant bioinformatics tools articles in PeerJ."
  }
]
