[
  {
    "name": "Contact Congress (Open Source)",
    "url": "https://github.com/EFForg/contact-congress",
    "description": "Send emails to members of the US Congress. This was developed by EFF as an open source project. They use it for their own campaigns internally. There is also a hosted version run by Fight for the Future (see below."
  },
  {
    "name": "Call Congress",
    "url": "https://github.com/fightforthefuture/call-congress",
    "description": "Coordinate call-in days to US Congress, the President, or local or corporate targets. Original project from Fight for the Future and Taskforce.is, but with lots of development from Mozilla and the EFF. The updated website is http://callpower.org. A hosted version is available, and the code is AGPL available on Github."
  },
  {
    "name": "Twilio.org's Rapid Response Kit",
    "url": "https://github.com/Twilio-org/rapid-response-kit",
    "description": "Collection phone-related tools using Twilio's service. Kit includes: Auto-Respond (inbound voice/sms responder), Broadcast (simple way to broadcast texts/calls to a list), Conference Line, Forwarder, Ringdown (call down a list of people, if 1st person doesn't answer go on to the next), Help Line (Press 1 for..., Press 2 for...)"
  },
  {
    "name": "Ushahidi",
    "url": "https://www.ushahidi.com/",
    "description": "Platform for data management and visualization. Other tools include CrowdMap, CrisisNET (data about world crises), Ping (tool for checking is someone is ok after an emergency), SMSsync (two-way SMS gateway). Check out their github repos."
  },
  {
    "name": "Crowdring",
    "url": "https://github.com/therules/CrowdRing",
    "description": "web app where people around the world can place a free missed call to sign a petition"
  },
  {
    "name": "Self Starter",
    "url": "https://github.com/lockitron/selfstarter",
    "description": "roll your own crowdfunding site"
  },
  {
    "name": "TakeCharge.io",
    "url": "https://github.com/controlshift/prague-server",
    "description": "opensource or SaaS online donations powered by Stripe."
  },
  {
    "name": "VictoryKit",
    "url": "http://www.victorykitapp.com",
    "description": "Optimize petition campaign content. Not actively maintained."
  },
  {
    "name": "Countdown",
    "url": "https://github.com/drewrwilson/countdown",
    "description": "A quick & simple tool for making your own webpage with a countdown to your upcoming event."
  },
  {
    "name": "CiviCRM",
    "url": "https://civicrm.org/",
    "description": "Contact management system for non-profit / activist sector, including donations, memberships, events, SMS, bulk mail & full CRM."
  },
  {
    "name": "Thunderclap",
    "url": "http://thunderclap.it",
    "description": "use this to coordinate a group sharing the same message on social media at the same time. You write a tweet, make a campaign, and ask people to pledge to support your campaign. When you reach your goal of a certain number of pledgers, your tweet will automatically be posted to each pledger's social media."
  },
  {
    "name": "Loomio",
    "url": "https://www.loomio.org/",
    "description": "Tool for collaborative decision-making in groups. Note: Loomio's code is also open source, but it's generally used as a hosted service."
  },
  {
    "name": "Change.org Petition site. Chose a target, make a petition, send it to your friends. If they get traction, Change.org has staff that can provide support. (They also have org accounts, that allow groups to do branded pages and export contact info of signers.)",
    "url": "https://www.change.org/"
  },
  {
    "name": "Contact Congress (FFTF)",
    "url": "http://congress.fightforthefuture.org/",
    "description": "Used to send emails to members of the US Congress. This is Fight for the Future's hosted-version of the open sources Contact Congress. Ideal for organizations that send a lot of emails to congress, but who don't have tech staff who can install and maintain their own version of the open source software."
  },
  {
    "name": "ControlShift",
    "url": "https://www.controlshiftlabs.com/",
    "description": "Distributed petitions, events and local groups for progressive advocacy organizations. Tools to help make campaigns more participatory."
  },
  {
    "name": "Riseup",
    "url": "http://riseup.net/",
    "description": "A provider of communication tools for activists, including free webmail, chat, and VPN"
  },
  {
    "name": "Action Network",
    "url": "https://actionnetwork.org",
    "description": "A nonprofit digital organizing toolset for progressive organizations. Includes petitions, advocacy, fundraising, mass email, and more for free or cheap."
  },
  {
    "name": "Tails",
    "url": "https://tails.boum.org/",
    "description": "A live media, Linux-based operating system that is designed to allow the use of a computer without leaving a digital footprint."
  },
  {
    "name": "Tor Browser",
    "url": "https://github.com/TheTorProject/gettorbrowser",
    "description": "Free software for enabling anonymous communication. It prevents somebody watching your Internet connection from learning what sites you visit, it prevents the sites you visit from learning your physical location, and it lets you access sites which are blocked."
  },
  {
    "name": "Where@",
    "url": "https://github.com/the-learning-collective/whereat-macroid",
    "description": "a mobile app to help protesters communicate with each other in realtime during marches"
  },
  {
    "name": "Stencil Validator (code)",
    "url": "https://drewrwilson.com/stencilvalidator/",
    "description": "a design tool for determining if your artwork is a valid stencil"
  },
  {
    "name": "Day of Action",
    "url": "https://github.com/handsupwalkout/handsupwalkout.github.io",
    "description": "very rough tool used to coordinate a day of action for high school students. the starting point for a more generalized tool to run a day of action campaign"
  }
]
