[
  {
    "name": "Olival et al. 2017",
    "url": "https://zenodo.org/record/807517#.Wv7kuFMvzOQ",
    "description": "Mammal-virus database with analysis."
  },
  {
    "name": "PREDICT",
    "url": "http://data.predict.global/",
    "description": "Field data from the USAID PREDICT project 2008-2019, a global emerging virus surveillance program. This data is downloadable if you have a healthmap account."
  },
  {
    "name": "Global Mammal Parasite Database 2.0- A database of the parasites of wild ungulates (artiodactyls and perissodactyls), carnivores, and primates.",
    "url": "https://esajournals.onlinelibrary.wiley.com/doi/full/10.1002/ecy.1799"
  },
  {
    "name": "PEARL",
    "url": "http://pearl.berkeley.edu/",
    "description": "Conservation assessments of macroparasitic invertebrates."
  },
  {
    "name": "Virus-Host DB",
    "url": "http://www.genome.jp/virushostdb/view/",
    "description": "A synthesis of host-virus associations from genomes posted in NCBI/RefSeq and GenBank."
  },
  {
    "name": "NHM Host-parasite database",
    "url": "http://www.nhm.ac.uk/research-curation/scientific-resources/taxonomy-systematics/host-parasites/",
    "description": "A database of parasitic worms maintained by London Natural History Museum. Wells et al. 2018 provides a broad analysis of this database, and you can access data through the R package helmithR."
  },
  {
    "name": "Arctos",
    "url": "http://arctos.database.museum/SpecimenSearch.cfm",
    "description": "A collective management database for museum specimens. See below for specific collections. Data includes locality and collection dates, and is downloadable for any registered accounts."
  },
  {
    "name": "ENHanCEd Infectious Diseases Database (EID2)",
    "url": "https://eid2.liverpool.ac.uk/",
    "description": "A database that pulls organism associations from NCBI sequences and PubMed."
  },
  {
    "name": "Arbovirus Catalog (ARBOCAT)",
    "url": "https://wwwn.cdc.gov/arbocat/",
    "description": "The CDC-curated arbovirus information including dates of first isolation and wildlife hosts."
  },
  {
    "name": "Global Biotic Interactions (GloBI)",
    "url": "https://www.globalbioticinteractions.org/data.html",
    "description": "A species interaction repository that can be searched by 'parasite of', 'pathogen of', or 'host of'."
  },
  {
    "name": "DBatVir",
    "url": "www.mgc.ac.cn/DBatVir",
    "description": "A bat virus database curated from Genbank with host traits and summaries by location."
  },
  {
    "name": "DRodVir",
    "url": "http://www.mgc.ac.cn/DRodVir/",
    "description": "A rodent virus database curated from Genbank with host traits."
  },
  {
    "name": "PHI-base",
    "url": "http://www.phi-base.org/index.jsp",
    "description": "A database with information on specific genes of fungal, Oomycete and bacterial pathogens that affect pathogenicity. Focused on agricultural and medical pathogens of importance."
  },
  {
    "name": "Denver Museum of Nature and Science",
    "url": "https://science.dmns.org/integrative-collections/dmns-zoology-collections/",
    "description": "Collection of mammalian ecto- and endo- parasites primarily focused on the Rocky Mountain and Great Plains regions. Accessible through Arctos."
  },
  {
    "name": "Harold W. Manter Laboratory of Parasitology Collection",
    "url": "http://hwml.unl.edu/resources/database-68",
    "description": "Specimen collection focused \"on the helminth parasites of mammals of the Nearctic and Neotropical regions stressing studies of the phylogeny and diversity of parasites of Rodentia, Marsupialia, Xenarthra, and Chiroptera.\" The archive site for the American Society of Parasitologists. Accessible through Arctos."
  },
  {
    "name": "Meguro Parasite Museum",
    "url": "https://www.kiseichu.org/e-top",
    "description": "Museum in Tokyo, Japan focused on human parasites with over 60,000 specimens. Data is not digitized, though the museum's founder, Dr. S. Yamaguti, described many of the specimens in 10 volumes of Systema Helminthum. Collections primarily from Japan, Indonesia and Hawaii."
  },
  {
    "name": "Museum of Southwestern Biology, Division of Parasites",
    "url": "https://msb.unm.edu/divisions/parasites/index.html",
    "description": "Specimen collection of parasites amphibians, reptiles, birds, and mammals. Particular focus on parasites of small mammals in high altidude locations and Sevilleta Long Term Ecological Research Station in New Mexico, and parasites of seabirds in the artic and Antartica. Accessible through Arctos."
  },
  {
    "name": "The International Outbreak Museum",
    "url": "http://www.outbreakmuseum.com",
    "description": "Museum focused on human food-borne outbreaks, with each exhibit being a different historical outbreak. Part of The Northwest Center for Foodborne Outbreak Management, Epidemiology, and Surveillance."
  },
  {
    "name": "U.S. National Parasite Collection",
    "url": "https://www.nal.usda.gov/exhibits/speccoll/exhibits/show/parasitic-diseases-with-econom/u-s--national-animal-parasite-",
    "description": "Specimen collection maintained by USDA that focuses on agriculturally important helminths and protozoans from North America. Accessible through Arctos."
  },
  {
    "name": "Ohio State University Acarology Collection",
    "url": "https://acarology.osu.edu/database",
    "description": "Nearly 70,000 vouchered specimens of mites from around the globe starting from 1864. Information includes host species, collection gps points, collection location (e.g. ear), and collection method. Can also be accessed through GBIF."
  },
  {
    "name": "Biological Collections of Oswaldo Cruz Institute in Rio de Janeiro, Brazil",
    "url": "https://portal.fiocruz.br/en/biological-collections",
    "description": "scientific institution with the largest helminth collection in Latin America with nearly 40,000 specimens. The institute also houses several other open-access catalogues of protozoa and medically important vector species."
  },
  {
    "name": "Garden Wildlife Health",
    "url": "https://www.gardenwildlifehealth.org",
    "description": "This is a UK collaborative project between the Zoological Society of London (ZSL), the British Trust for Ornithology (BTO), Froglife and the Royal Society for the Protection of Birds (RSPB) that historically has been running since the 1980's (previously as Garden Bird Health initiative and Frog Mortality Project). Citizens can submit sickness and mortality reports, as well as animal wildlife samples, for wild birds, amphibians, reptiles, and hedgehogs."
  },
  {
    "name": "Project Monarch Health",
    "url": "https://www.monarchparasites.org/",
    "description": "A citizen science project running since 2006 to test adult monarch butterflies from the U.S. and Canada for the protozoan parasite Ophryocystis elektroscirrha. Participants submit spore samples collected from adult abdomems with tape for laboratory assessment at University of Georgia."
  },
  {
    "name": "World Animal Health Information System (WAHIS)",
    "url": "http://www.oie.int/wahis_2/public/wahid.php/Diseaseinformation/reportarchive",
    "description": "The OIE archive of country alerts and regular reports of certain pathogens. They also have some nice interfaces to show disease distribution and timelines."
  },
  {
    "name": "Healthmap",
    "url": "https://www.healthmap.org/en/",
    "description": "A web platform that provides infectious disease outbreak alerts for humans and animals."
  },
  {
    "name": "Program for Monitoring Emerging Diseases (ProMed)",
    "url": "http://www.promedmail.org/",
    "description": "An early warning of outbreaks of emerging and re-emerging diseases. Sources of information include media reports, official reports, online summaries, local observers, and others."
  },
  {
    "name": "GBIF Backbone Taxonomy",
    "url": "https://www.gbif.org/en/dataset/d7dddbf4-2cf0-4f39-9b2a-bb099caae36c",
    "description": "Aggregation and synonymization of taxonomy for animals, bacteria, protozoa, and viruses that synthesizes 56 taxonomy sources."
  },
  {
    "name": "NCBI Taxonomy",
    "url": "https://www.ncbi.nlm.nih.gov/taxonomy",
    "description": "The Taxonomy Database is a curated classification and nomenclature for all of the organisms in the public sequence databases, both parasites and hosts."
  },
  {
    "name": "ICTV",
    "url": "https://talk.ictvonline.org/taxonomy/",
    "description": "The viral taxonomy authority with excellent archives and open reports."
  },
  {
    "name": "IUCN Redlist",
    "url": "http://www.iucnredlist.org/",
    "description": "Online database that provides taxonomic information for wild hosts. You can use the R package rredlist and the API to access the data directly."
  },
  {
    "name": "Journal of Wildlife Diseases",
    "url": "http://www.jwildlifedis.org/loi/jwdi",
    "description": "JWD provides many open-access articles on new parasite expansions or discoveries."
  },
  {
    "name": "American Journal of Tropical Medicine and Hygiene",
    "url": "http://www.ajtmh.org/",
    "description": "AJTMH publishes a broad range of papers covering topics in tropical medicine. Their archive is open-access after a 12-month embargo."
  },
  {
    "name": "Emerging Infectious Diseases",
    "url": "https://wwwnc.cdc.gov/eid/",
    "description": "The CDC open-access journal."
  }
]
