[
  {
    "name": "Active Fairness Auditing",
    "url": "https://proceedings.mlr.press/v162/yan22c/yan22c.pdf",
    "description": "(ICML) Studies of query-based auditing algorithms that can estimate the demographic parity of ML models in a query-efficient manner."
  },
  {
    "name": "Look at the Variance! Efficient Black-box Explanations with Sobol-based Sensitivity Analysis",
    "url": "https://proceedings.neurips.cc/paper/2021/file/da94cbeff56cfda50785df477941308b-Paper.pdf",
    "description": "(NeurIPS) Sobol indices provide an efficient way to capture higher-order interactions between image regions and their contributions to a (black box) neural network’s prediction through the lens of variance."
  },
  {
    "name": "Your Echos are Heard: Tracking, Profiling, and Ad Targeting in the Amazon Smart Speaker Ecosystem",
    "url": "https://arxiv.org/pdf/2204.10920.pdf",
    "description": "(arxiv) Infers a link between the Amazon Echo system and the ad targeting algorithm."
  },
  {
    "name": "Everyday Algorithm Auditing: Understanding the Power of Everyday Users in Surfacing Harmful Algorithmic Behaviors",
    "url": "https://arxiv.org/pdf/2105.02980.pdf",
    "description": "(CHI) Makes the case for \"everyday algorithmic auditing\" by users."
  },
  {
    "name": "Auditing Black-Box Prediction Models for Data Minimization Compliance",
    "url": "https://www.cs.bu.edu/faculty/crovella/paper-archive/minimization-audit-Neurips21.pdf",
    "description": "(NeurIPS) Measures the level of data minimization satisfied by the prediction model using a limited number of queries."
  },
  {
    "name": "Setting the Record Straighter on Shadow Banning",
    "url": "https://arxiv.org/abs/2012.05101",
    "description": "(INFOCOM)  (Code) Considers the possibility of shadow banning in Twitter (ie, the moderation black-box algorithm), and measures the probability of several hypothesis."
  },
  {
    "name": "Extracting Training Data from Large Language Models",
    "url": "https://arxiv.org/pdf/2012.07805.pdf",
    "description": "(USENIX Security) Extract verbatim text sequences from the GPT-2 model’s training data."
  },
  {
    "name": "FairLens: Auditing black-box clinical decision support systems",
    "url": "https://www.sciencedirect.com/science/article/pii/S030645732100145X?casa_token=oyjFKij269MAAAAA:w_ohScpMPNMnkDdzBqAIod5QfBgQlq5Ht9mMRSOydZpOgNG-i1yuqEmBjWN__38gOGmjNL7dVT0",
    "description": "(Information Processing & Management) Presents a pipeline to detect and explain potential fairness issues in Clinical DSS, by comparing different multi-label classification disparity measures."
  },
  {
    "name": "Auditing Algorithmic Bias on Twitter",
    "url": "https://dl.acm.org/doi/abs/10.1145/3447535.3462491",
    "description": "(WebSci)."
  },
  {
    "name": "Bayesian Algorithm Execution: Estimating Computable Properties of Black-box Functions Using Mutual Information",
    "url": "https://proceedings.mlr.press/v139/neiswanger21a.html",
    "description": "(ICML) A budget constrained and Bayesian optimization procedure to extract properties out of a black-box algorithm."
  },
  {
    "name": "Black-Box Ripper: Copying black-box models using generative evolutionary algorithms",
    "url": "https://proceedings.neurips.cc/paper/2020/file/e8d66338fab3727e34a9179ed8804f64-Paper.pdf",
    "description": "(NeurIPS) Replicates the functionality of a black-box neural model, yet with no limit on the amount of queries (via a teacher/student scheme and an evolutionary search)."
  },
  {
    "name": "Auditing radicalization pathways on YouTube",
    "url": "https://dl.acm.org/doi/pdf/10.1145/3351095.3372879",
    "description": "(FAT*) Studies the reachability of radical channels from each others, using random walks on static channel recommendations."
  },
  {
    "name": "Adversarial Model Extraction on Graph Neural Networks",
    "url": "https://arxiv.org/abs/1912.07721",
    "description": "(AAAI Workshop on Deep Learning on Graphs: Methodologies and Applications) Introduces GNN model extraction and presents a preliminary approach for this."
  },
  {
    "name": "Remote Explainability faces the bouncer problem",
    "url": "https://rdcu.be/b6qB4",
    "description": "(Nature Machine Intelligence volume 2, pages529–539)  (Code) Shows the impossibility (with one request) or the difficulty to spot lies on the explanations of a remote AI decision."
  },
  {
    "name": "GeoDA: a geometric framework for black-box adversarial attacks",
    "url": "https://openaccess.thecvf.com/content_CVPR_2020/papers/Rahmati_GeoDA_A_Geometric_Framework_for_Black-Box_Adversarial_Attacks_CVPR_2020_paper.pdf",
    "description": "(CVPR)  (Code) Crafts adversarial examples to fool models, in a pure blackbox setup (no gradients, inferred class only)."
  },
  {
    "name": "The Imitation Game: Algorithm Selectionby Exploiting Black-Box Recommender",
    "url": "https://github.com/erwanlemerrer/erwanlemerrer.github.io/raw/master/files/imitation_blackbox_recommenders_netys-2020.pdf",
    "description": "(Netys)  (Code) Parametrize a local recommendation algorithm by imitating the decision of a remote and better trained one."
  },
  {
    "name": "Auditing News Curation Systems:A Case Study Examining Algorithmic and Editorial Logic in Apple News",
    "url": "https://ojs.aaai.org/index.php/ICWSM/article/view/7277",
    "description": "(ICWSM) Audit study of Apple News as a sociotechnical news curation system (trending stories section)."
  },
  {
    "name": "Auditing Algorithms:  On Lessons Learned and the Risks of DataMinimization",
    "url": "https://dl.acm.org/doi/pdf/10.1145/3375627.3375852",
    "description": "(AIES) A practical audit for a well-being recommendation app developed by Telefónica (mostly on bias)."
  },
  {
    "name": "Extracting Training Data from Large Language Models",
    "url": "https://arxiv.org/pdf/2012.07805",
    "description": "(arxiv) Performs a training data extraction attack to recover individual training examples by querying the language model."
  },
  {
    "name": "Adversarial Frontier Stitching for Remote Neural Network Watermarking",
    "url": "https://arxiv.org/abs/1711.01894",
    "description": "(Neural Computing and Applications) (Alternative implementation) Check if a remote machine learning model is a \"leaked\" one: through standard API requests to a remote model, extract (or not) a zero-bit watermark, that was inserted to watermark valuable models (eg, large deep neural networks)."
  },
  {
    "name": "Knockoff Nets: Stealing Functionality of Black-Box Models",
    "url": "https://arxiv.org/abs/1812.02766.pdf",
    "description": "(CVPR) Ask to what extent can an adversary steal functionality of such \"victim\" models based solely on blackbox interactions: image in, predictions out."
  },
  {
    "name": "Opening Up the Black Box:Auditing Google's Top Stories Algorithm",
    "url": "https://par.nsf.gov/servlets/purl/10101277",
    "description": "(Flairs-32) Audit of the Google's Top stories panel that pro-vides insights into its algorithmic choices for selectingand ranking news publisher"
  },
  {
    "name": "Making targeted black-box evasion attacks effective andefficient",
    "url": "https://arxiv.org/pdf/1906.03397.pdf",
    "description": "(arXiv) Investigates how an adversary can optimally use its query budget for targeted evasion attacks against deep neural networks."
  },
  {
    "name": "Online Learning for Measuring Incentive Compatibility in Ad Auctions",
    "url": "https://research.fb.com/wp-content/uploads/2019/05/Online-Learning-for-Measuring-Incentive-Compatibility-in-Ad-Auctions.pdf",
    "description": "(WWW) Measures the incentive compatible- (IC) mechanisms (regret) of black-box auction platforms."
  },
  {
    "name": "TamperNN: Efficient Tampering Detection of Deployed Neural Nets",
    "url": "https://arxiv.org/abs/1903.00317",
    "description": "(ISSRE) Algorithms to craft inputs that can detect the tampering with a remotely executed classifier model."
  },
  {
    "name": "Neural Network Model Extraction Attacks in Edge Devicesby Hearing Architectural Hints",
    "url": "https://arxiv.org/pdf/1903.03916.pdf",
    "description": "(arxiv) Through the acquisition of memory access events from bus snooping, layer sequence identification bythe LSTM-CTC model, layer topology connection according to the memory access pattern, and layer dimension estimation under data volume constraints, it demonstrates one can accurately recover the a similar network architecture as the attack starting point"
  },
  {
    "name": "Stealing Knowledge from Protected Deep Neural Networks Using Composite Unlabeled Data",
    "url": "https://ieeexplore.ieee.org/abstract/document/8851798",
    "description": "(ICNN) Composite method which can be used to attack and extract the knowledge ofa black box model even if it completely conceals its softmaxoutput."
  },
  {
    "name": "Neural Network Inversion in Adversarial Setting via Background Knowledge Alignment",
    "url": "https://dl.acm.org/citation.cfm?id=3354261",
    "description": "(CCS) Model inversion approach in the adversary setting based on training an inversion model that acts as aninverse of the original model. With no fullknowledge about the original training data, an accurate inversion is still possible by training the inversion model on auxiliary samplesdrawn from a more generic data distribution."
  },
  {
    "name": "Distill-and-Compare: Auditing Black-Box Models Using Transparent Model Distillation",
    "url": "https://arxiv.org/abs/1710.06169",
    "description": "(AIES) Treats black box models as teachers, training transparent student models to mimic the risk scores assigned by black-box models."
  },
  {
    "name": "Towards Reverse-Engineering Black-Box Neural Networks",
    "url": "https://arxiv.org/abs/1711.01768",
    "description": "(ICLR) (Code) Infer inner hyperparameters (eg number of layers, non-linear activation type) of a remote neural network model by analysing its response patterns to certain inputs."
  },
  {
    "name": "Data driven exploratory attacks on black box classifiers in adversarial domains",
    "url": "https://www.sciencedirect.com/science/article/pii/S092523121830136X",
    "description": "(Neurocomputing) Reverse engineers remote classifier models (e.g., for evading a CAPTCHA test)."
  },
  {
    "name": "xGEMs: Generating Examplars to Explain Black-Box Models",
    "url": "https://arxiv.org/pdf/1806.08867.pdf",
    "description": "(arXiv) Searches bias in the black box model by training an unsupervised implicit generative model. Thensummarizes the black-box model behavior quantitatively by perturbing data samples along the data manifold."
  },
  {
    "name": "Learning Networks from Random Walk-Based Node Similarities",
    "url": "https://arxiv.org/pdf/1801.07386",
    "description": "(NIPS) Reversing graphs by observing some random walk commute times."
  },
  {
    "name": "Identifying the Machine Learning Family from Black-Box Models",
    "url": "https://rd.springer.com/chapter/10.1007/978-3-030-00374-6_6",
    "description": "(CAEPIA) Determines which kind of machine learning model is behind the returned predictions."
  },
  {
    "name": "Stealing Neural Networks via Timing Side Channels",
    "url": "https://arxiv.org/pdf/1812.11720.pdf",
    "description": "(arXiv) Stealing/approximating a model through timing attacks usin queries."
  },
  {
    "name": "Copycat CNN: Stealing Knowledge by Persuading Confession with Random Non-Labeled Data",
    "url": "https://arxiv.org/abs/1806.05476",
    "description": "(IJCNN)  (Code) Stealing black-box models (CNNs) knowledge by querying them with random natural images (ImageNet and Microsoft-COCO)."
  },
  {
    "name": "Auditing the Personalization and Composition of Politically-Related Search Engine Results Pages",
    "url": "https://dl.acm.org/doi/10.1145/3178876.3186143",
    "description": "(WWW) A Chrome extension to survey participants and collect the Search Engine Results Pages (SERPs) and autocomplete suggestions, for studying personalization and composition."
  },
  {
    "name": "Uncovering Influence Cookbooks : Reverse Engineering the Topological Impact in Peer Ranking Services",
    "url": "https://dl.acm.org/authorize.cfm?key=N21772",
    "description": "(CSCW) Aims at identifying which centrality metrics are in use in a peer ranking service."
  },
  {
    "name": "The topological face of recommendation: models and application to bias detection",
    "url": "https://arxiv.org/abs/1704.08991",
    "description": "(Complex Networks) Proposes a bias detection framework for items recommended to users."
  },
  {
    "name": "Membership Inference Attacks Against Machine Learning Models",
    "url": "http://ieeexplore.ieee.org/document/7958568/",
    "description": "(Symposium on Security and Privacy) Given a machine learning model and a record, determine whether this record was used as part of the model's training dataset or not."
  },
  {
    "name": "Practical Black-Box Attacks against Machine Learning",
    "url": "https://dl.acm.org/citation.cfm?id=3053009",
    "description": "(Asia CCS) Understand how vulnerable is a remote service to adversarial classification attacks."
  },
  {
    "name": "Bias in Online Freelance Marketplaces: Evidence from TaskRabbit",
    "url": "http://datworkshop.org/papers/dat16-final22.pdf",
    "description": "(dat workshop) Measures the TaskRabbit's search algorithm rank."
  },
  {
    "name": "Stealing Machine Learning Models via Prediction APIs",
    "url": "https://www.usenix.org/conference/usenixsecurity16/technical-sessions/presentation/tramer",
    "description": "(Usenix Security)  (Code) Aims at extracting machine learning models in use by remote services."
  },
  {
    "name": "“Why Should I Trust You?”Explaining the Predictions of Any Classifier",
    "url": "https://arxiv.org/pdf/1602.04938v3.pdf",
    "description": "(arXiv)  (Code) Explains a blackbox classifier model by sampling around data instances."
  },
  {
    "name": "Back in Black: Towards Formal, Black Box Analysis of Sanitizers and Filters",
    "url": "http://ieeexplore.ieee.org/document/7546497/",
    "description": "(Security and Privacy) Black-box analysis of sanitizers and filters."
  },
  {
    "name": "Algorithmic Transparency via Quantitative Input Influence: Theory and Experiments with Learning Systems",
    "url": "http://ieeexplore.ieee.org/document/7546525/",
    "description": "(Security and Privacy) Introduces measures that capture the degree of influence of inputs on outputs of the observed system."
  },
  {
    "name": "An Empirical Analysis of Algorithmic Pricing on Amazon Marketplace",
    "url": "https://mislove.org/publications/Amazon-WWW.pdf",
    "description": "(WWW) (Code) Develops a methodology for detecting algorithmic pricing, and use it empirically to analyze their prevalence and behavior on Amazon Marketplace."
  },
  {
    "name": "Peeking Beneath the Hood of Uber",
    "url": "https://dl.acm.org/citation.cfm?id=2815681",
    "description": "(IMC) Infer implementation details of Uber's surge price algorithm."
  },
  {
    "name": "XRay: Enhancing the Web's Transparency with Differential Correlation",
    "url": "https://www.usenix.org/node/184394",
    "description": "(USENIX Security) Audits which user profile data were used for targeting a particular ad, recommendation, or price."
  },
  {
    "name": "Measuring Personalization of Web Search",
    "url": "https://dl.acm.org/citation.cfm?id=2488435",
    "description": "(WWW) Develops a methodology for measuring personalization in Web search result."
  },
  {
    "name": "Query Strategies for Evading Convex-Inducing Classifiers",
    "url": "http://www.jmlr.org/papers/v13/nelson12a.html",
    "description": "(JMLR) Evasion methods for convex classifiers. Considers evasion complexity."
  },
  {
    "name": "Privacy Oracle: a System for Finding Application Leakswith Black Box Differential Testing",
    "url": "https://dl.acm.org/citation.cfm?id=1455806",
    "description": "(CCS) Privacy Oracle: a system that uncovers applications' leaks of personal information in transmissions to remoteservers."
  },
  {
    "name": "Adversarial Learning",
    "url": "https://dl.acm.org/citation.cfm?id=1081950",
    "description": "(KDD) Reverse engineering of remote linear classifiers, using membership queries."
  }
]
