[
  {
    "name": "Ansible Lockdown",
    "url": "https://ansiblelockdown.io/",
    "description": "Curated collection of information security themed Ansible roles that are both vetted and actively maintained."
  },
  {
    "name": "Clevis",
    "url": "https://github.com/latchset/clevis",
    "description": "Plugable framework for automated decryption, often used as a Tang client."
  },
  {
    "name": "DShell",
    "url": "https://github.com/USArmyResearchLab/Dshell",
    "description": "Extensible network forensic analysis framework written in Python that enables rapid development of plugins to support the dissection of network packet captures."
  },
  {
    "name": "Dev-Sec.io",
    "url": "https://dev-sec.io/",
    "description": "Server hardening framework providing Ansible, Chef, and Puppet implementations of various baseline security configurations."
  },
  {
    "name": "peepdf",
    "url": "https://eternal-todo.com/tools/peepdf-pdf-analysis-tool",
    "description": "Scriptable PDF file analyzer."
  },
  {
    "name": "PyREBox",
    "url": "https://talosintelligence.com/pyrebox",
    "description": "Python-scriptable reverse engineering sandbox, based on QEMU."
  },
  {
    "name": "Watchtower",
    "url": "https://containrrr.dev/watchtower/",
    "description": "Container-based solution for automating Docker container base image updates, providing an unattended upgrade experience."
  },
  {
    "name": "MultiScanner",
    "url": "https://github.com/mitre/multiscanner",
    "description": "File analysis framework written in Python that assists in evaluating a set of files by automatically running a suite of tools against them and aggregating the output."
  },
  {
    "name": "Posh-VirusTotal",
    "url": "https://github.com/darkoperator/Posh-VirusTotal",
    "description": "PowerShell interface to VirusTotal.com APIs."
  },
  {
    "name": "censys-python",
    "url": "https://github.com/censys/censys-python",
    "description": "Python wrapper to the Censys REST API."
  },
  {
    "name": "libcrafter",
    "url": "https://github.com/pellegre/libcrafter",
    "description": "High level C++ network packet sniffing and crafting library."
  },
  {
    "name": "python-dshield",
    "url": "https://github.com/rshipp/python-dshield",
    "description": "Pythonic interface to the Internet Storm Center/DShield API."
  },
  {
    "name": "python-sandboxapi",
    "url": "https://github.com/InQuest/python-sandboxapi",
    "description": "Minimal, consistent Python API for building integrations with malware sandboxes."
  },
  {
    "name": "python-stix2",
    "url": "https://github.com/oasis-open/cti-python-stix2",
    "description": "Python APIs for serializing and de-serializing Structured Threat Information eXpression (STIX) JSON content, plus higher-level APIs for common tasks."
  },
  {
    "name": "Shuffle",
    "url": "https://shuffler.io/",
    "description": "Graphical generalized workflow (automation) builder for IT professionals and blue teamers."
  },
  {
    "name": "Checkov",
    "url": "https://www.checkov.io/",
    "description": "Static analysis for Terraform (infrastructure as code) to help detect CIS policy violations and prevent cloud security misconfiguration."
  },
  {
    "name": "Falco",
    "url": "https://falco.org/",
    "description": "Behavioral activity monitor designed to detect anomalous activity in containerized applications, hosts, and network packet flows by auditing the Linux kernel and enriched by runtime data such as Kubernetes metrics."
  },
  {
    "name": "Kata Containers",
    "url": "https://katacontainers.io/",
    "description": "Secure container runtime with lightweight virtual machines that feel and perform like containers, but provide stronger workload isolation using hardware virtualization technology as a second layer of defense."
  },
  {
    "name": "Prowler",
    "url": "https://github.com/toniblyx/prowler",
    "description": "Tool based on AWS-CLI commands for Amazon Web Services account security assessment and hardening."
  },
  {
    "name": "Scout Suite",
    "url": "https://github.com/nccgroup/ScoutSuite",
    "description": "Open source multi-cloud security-auditing tool, which enables security posture assessment of cloud environments."
  },
  {
    "name": "gVisor",
    "url": "https://github.com/google/gvisor",
    "description": "Application kernel, written in Go, that implements a substantial portion of the Linux system surface to provide an isolation boundary between the application and the host kernel."
  },
  {
    "name": "Cortex",
    "url": "https://cortexmetrics.io/",
    "description": "Provides horizontally scalable, highly available, multi-tenant, long term storage for Prometheus."
  },
  {
    "name": "Jaeger",
    "url": "https://www.jaegertracing.io/",
    "description": "Distributed tracing platform backend used for monitoring and troubleshooting microservices-based distributed systems."
  },
  {
    "name": "OpenTelemetry",
    "url": "https://opentelemetry.io/",
    "description": "Observability framework for cloud-native software, comprising a collection of tools, APIs, and SDKs for exporting application performance metrics to a tracing backend (formerly maintained by the OpenTracing and OpenCensus projects)."
  },
  {
    "name": "Prometheus",
    "url": "https://prometheus.io/",
    "description": "Open-source systems monitoring and alerting toolkit originally built at SoundCloud."
  },
  {
    "name": "Zipkin",
    "url": "https://zipkin.io/",
    "description": "Distributed tracing system backend that helps gather timing data needed to troubleshoot latency problems in service architectures."
  },
  {
    "name": "KubeSec",
    "url": "https://kubesec.io/",
    "description": "Static analyzer of Kubernetes manifests that can be run locally, as a Kuberenetes admission controller, or as its own cloud service."
  },
  {
    "name": "Kyverno",
    "url": "https://kyverno.io/",
    "description": "Policy engine designed for Kubernetes."
  },
  {
    "name": "Linkerd",
    "url": "https://linkerd.io/",
    "description": "Ultra light Kubernetes-specific service mesh that adds observability, reliability, and security to Kubernetes applications without requiring any modification of the application itself."
  },
  {
    "name": "Managed Kubernetes Inspection Tool (MKIT)",
    "url": "https://github.com/darkbitio/mkit",
    "description": "Query and validate several common security-related configuration settings of managed Kubernetes cluster objects and the workloads/resources running inside the cluster."
  },
  {
    "name": "Polaris",
    "url": "https://polaris.docs.fairwinds.com/",
    "description": "Validates Kubernetes best practices by running tests against code commits, a Kubernetes admission request, or live resources already running in a cluster."
  },
  {
    "name": "certificate-expiry-monitor",
    "url": "https://github.com/muxinc/certificate-expiry-monitor",
    "description": "Utility that exposes the expiry of TLS certificates as Prometheus metrics."
  },
  {
    "name": "k-rail",
    "url": "https://github.com/cruise-automation/k-rail",
    "description": "Workload policy enforcement tool for Kubernetes."
  },
  {
    "name": "kube-forensics",
    "url": "https://github.com/keikoproj/kube-forensics",
    "description": "Allows a cluster administrator to dump the current state of a running pod and all its containers so that security professionals can perform off-line forensic analysis."
  },
  {
    "name": "kube-hunter",
    "url": "https://kube-hunter.aquasec.com/",
    "description": "Open-source tool that runs a set of tests (\"hunters\") for security issues in Kubernetes clusters from either outside (\"attacker's view\") or inside a cluster."
  },
  {
    "name": "kubernetes-event-exporter",
    "url": "https://github.com/opsgenie/kubernetes-event-exporter",
    "description": "Allows exporting the often missed Kubernetes events to various outputs so that they can be used for observability or alerting purposes."
  },
  {
    "name": "Consul",
    "url": "https://consul.io/",
    "description": "Solution to connect and configure applications across dynamic, distributed infrastructure and, with Consul Connect, enabling secure service-to-service communication with automatic TLS encryption and identity-based authorization."
  },
  {
    "name": "Istio",
    "url": "https://istio.io/",
    "description": "Open platform for providing a uniform way to integrate microservices, manage traffic flow across microservices, enforce policies and aggregate telemetry data."
  },
  {
    "name": "GPG Sync",
    "url": "https://github.com/firstlookmedia/gpgsync",
    "description": "Centralize and automate OpenPGP public key distribution, revocation, and updates amongst all members of an organization or team."
  },
  {
    "name": "Geneva (Genetic Evasion)",
    "url": "https://censorship.ai/",
    "description": "Novel experimental genetic algorithm that evolves packet-manipulation-based censorship evasion strategies against nation-state level censors to increase availability of otherwise blocked content."
  },
  {
    "name": "GlobaLeaks",
    "url": "https://www.globaleaks.org/",
    "description": "Free, open source software enabling anyone to easily set up and maintain a secure whistleblowing platform."
  },
  {
    "name": "SecureDrop",
    "url": "https://securedrop.org/",
    "description": "Open source whistleblower submission system that media organizations and NGOs can install to securely accept documents from anonymous sources."
  },
  {
    "name": "Teleport",
    "url": "https://goteleport.com/",
    "description": "Allows engineers and security professionals to unify access for SSH servers, Kubernetes clusters, web applications, and databases across all environments."
  },
  {
    "name": "Bane",
    "url": "https://github.com/genuinetools/bane",
    "description": "Custom and better AppArmor profile generator for Docker containers."
  },
  {
    "name": "BlackBox",
    "url": "https://github.com/StackExchange/blackbox",
    "description": "Safely store secrets in Git/Mercurial/Subversion by encrypting them \"at rest\" using GnuPG."
  },
  {
    "name": "Cilium",
    "url": "https://cilium.io/",
    "description": "Open source software for transparently securing the network connectivity between application services deployed using Linux container management platforms like Docker and Kubernetes."
  },
  {
    "name": "Clair",
    "url": "https://github.com/coreos/clair",
    "description": "Static analysis tool to probe for vulnerabilities introduced via application container (e.g., Docker) images."
  },
  {
    "name": "CodeQL",
    "url": "https://securitylab.github.com/tools/codeql",
    "description": "Discover vulnerabilities across a codebase by performing queries against code as though it were data."
  },
  {
    "name": "DefectDojo",
    "url": "https://www.defectdojo.org/",
    "description": "Application vulnerability management tool built for DevOps and continuous security integration."
  },
  {
    "name": "Gauntlt",
    "url": "http://gauntlt.org/",
    "description": "Pentest applications during routine continuous integration build pipelines."
  },
  {
    "name": "Git Secrets",
    "url": "https://github.com/awslabs/git-secrets",
    "description": "Prevents you from committing passwords and other sensitive information to a git repository."
  },
  {
    "name": "SOPS",
    "url": "https://github.com/mozilla/sops",
    "description": "Editor of encrypted files that supports YAML, JSON, ENV, INI and binary formats and encrypts with AWS KMS, GCP KMS, Azure Key Vault, and PGP."
  },
  {
    "name": "Snyk",
    "url": "https://snyk.io/",
    "description": "Finds and fixes vulnerabilities and license violations in open source dependencies and container images."
  },
  {
    "name": "SonarQube",
    "url": "https://sonarqube.org",
    "description": "Continuous inspection tool that provides detailed reports during automated testing and alerts on newly introduced security vulnerabilities."
  },
  {
    "name": "Trivy",
    "url": "https://github.com/aquasecurity/trivy",
    "description": "Simple and comprehensive vulnerability scanner for containers and other artifacts, suitable for use in continuous integration pipelines."
  },
  {
    "name": "Vault",
    "url": "https://www.vaultproject.io/",
    "description": "Tool for securely accessing secrets such as API keys, passwords, or certificates through a unified interface."
  },
  {
    "name": "git-crypt",
    "url": "https://www.agwa.name/projects/git-crypt/",
    "description": "Transparent file encryption in git; files which you choose to protect are encrypted when committed, and decrypted when checked out."
  },
  {
    "name": "helm-secrets",
    "url": "https://github.com/jkroepke/helm-secrets",
    "description": "Helm plugin that helps manage secrets with Git workflow and stores them anywhere, backed by SOPS."
  },
  {
    "name": "DynInst",
    "url": "https://dyninst.org/dyninst",
    "description": "Tools for binary instrumentation, analysis, and modification, useful for binary patching."
  },
  {
    "name": "DynamoRIO",
    "url": "https://dynamorio.org/",
    "description": "Runtime code manipulation system that supports code transformations on any part of a program, while it executes, implemented as a process-level virtual machine."
  },
  {
    "name": "Egalito",
    "url": "https://egalito.org/",
    "description": "Binary recompiler and instrumentation framework that can fully disassemble, transform, and regenerate ordinary Linux binaries designed for binary hardening and security research."
  },
  {
    "name": "Valgrind",
    "url": "https://www.valgrind.org/",
    "description": "Instrumentation framework for building dynamic analysis tools."
  },
  {
    "name": "Chef InSpec",
    "url": "https://www.chef.io/products/chef-inspec",
    "description": "Language for describing security and compliance rules, which become automated tests that can be run against IT infrastructures to discover and report on non-compliance."
  },
  {
    "name": "OpenSCAP Base",
    "url": "https://www.open-scap.org/tools/openscap-base/",
    "description": "Both a library and a command line tool (oscap) used to evaluate a system against SCAP baseline profiles to report on the security posture of the scanned system(s)."
  },
  {
    "name": "Atheris",
    "url": "https://pypi.org/project/atheris/",
    "description": "Coverage-guided Python fuzzing engine based off of libFuzzer that supports fuzzing of Python code but also native extensions written for CPython."
  },
  {
    "name": "FuzzBench",
    "url": "https://google.github.io/fuzzbench/",
    "description": "Free service that evaluates fuzzers on a wide variety of real-world benchmarks, at Google scale."
  },
  {
    "name": "OneFuzz",
    "url": "https://github.com/microsoft/onefuzz",
    "description": "Self-hosted Fuzzing-as-a-Service (FaaS) platform."
  },
  {
    "name": "Conftest",
    "url": "https://conftest.dev/",
    "description": "Utility to help you write tests against structured configuration data."
  },
  {
    "name": "Open Policy Agent (OPA)",
    "url": "https://www.openpolicyagent.org/",
    "description": "Unified toolset and framework for policy across the cloud native stack."
  },
  {
    "name": "Tang",
    "url": "https://github.com/latchset/tang",
    "description": "Server for binding data to network presence; provides data to clients only when they are on a certain (secured) network."
  },
  {
    "name": "Grafeas",
    "url": "https://grafeas.io/",
    "description": "Open artifact metadata API to audit and govern your software supply chain."
  },
  {
    "name": "Helm GPG (GnuPG) Plugin",
    "url": "https://github.com/technosophos/helm-gpg",
    "description": "Chart signing and verification with GnuPG for Helm."
  },
  {
    "name": "Notary",
    "url": "https://github.com/theupdateframework/notary",
    "description": "Aims to make the internet more secure by making it easy for people to publish and verify content."
  },
  {
    "name": "CanaryTokens",
    "url": "https://github.com/thinkst/canarytokens",
    "description": "Self-hostable honeytoken generator and reporting dashboard; demo version available at CanaryTokens.org."
  },
  {
    "name": "Kushtaka",
    "url": "https://kushtaka.org",
    "description": "Sustainable all-in-one honeypot and honeytoken orchestrator for under-resourced blue teams."
  },
  {
    "name": "Endlessh",
    "url": "https://github.com/skeeto/endlessh",
    "description": "SSH tarpit that slowly sends an endless banner."
  },
  {
    "name": "LaBrea",
    "url": "http://labrea.sourceforge.net/labrea-info.html",
    "description": "Program that answers ARP requests for unused IP space, creating the appearance of fake machines that answer further requests very slowly in order to slow down scanners, worms, etcetera."
  },
  {
    "name": "Artillery",
    "url": "https://github.com/BinaryDefense/artillery",
    "description": "Combination honeypot, filesystem monitor, and alerting system designed to protect Linux and Windows operating systems."
  },
  {
    "name": "chkrootkit",
    "url": "http://chkrootkit.org/",
    "description": "Locally checks for signs of a rootkit on GNU/Linux systems."
  },
  {
    "name": "Crowd Inspect",
    "url": "https://www.crowdstrike.com/resources/community-tools/crowdinspect-tool/",
    "description": "Free tool for Windows systems aimed to alert you to the presence of malware that may be communicating over the network."
  },
  {
    "name": "Fail2ban",
    "url": "https://www.fail2ban.org/",
    "description": "Intrusion prevention software framework that protects computer servers from brute-force attacks."
  },
  {
    "name": "Open Source HIDS SECurity (OSSEC)",
    "url": "https://www.ossec.net/",
    "description": "Fully open source and free, feature-rich, Host-based Instrusion Detection System (HIDS)."
  },
  {
    "name": "Rootkit Hunter (rkhunter)",
    "url": "http://rkhunter.sourceforge.net/",
    "description": "POSIX-compliant Bash script that scans a host for various signs of malware."
  },
  {
    "name": "Bubblewrap",
    "url": "https://github.com/containers/bubblewrap",
    "description": "Sandboxing tool for use by unprivileged Linux users capable of restricting access to parts of the operating system or user data."
  },
  {
    "name": "Dangerzone",
    "url": "https://dangerzone.rocks/",
    "description": "Take potentially dangerous PDFs, office documents, or images and convert them to a safe PDF."
  },
  {
    "name": "Firejail",
    "url": "https://firejail.wordpress.com/",
    "description": "SUID program that reduces the risk of security breaches by restricting the running environment of untrusted applications using Linux namespaces and seccomp-bpf."
  },
  {
    "name": "LogonTracer",
    "url": "https://github.com/JPCERTCC/LogonTracer",
    "description": "Investigate malicious Windows logon by visualizing and analyzing Windows event log."
  },
  {
    "name": "Volatility",
    "url": "https://www.volatilityfoundation.org/",
    "description": "Advanced memory forensics framework."
  },
  {
    "name": "aws_ir",
    "url": "https://github.com/ThreatResponse/aws_ir",
    "description": "Automates your incident response with zero security preparedness assumptions."
  },
  {
    "name": "CIRTKit",
    "url": "https://github.com/opensourcesec/CIRTKit",
    "description": "Scriptable Digital Forensics and Incident Response (DFIR) toolkit built on Viper."
  },
  {
    "name": "Fast Incident Response (FIR)",
    "url": "https://github.com/certsocietegenerale/FIR",
    "description": "Cybersecurity incident management platform allowing for easy creation, tracking, and reporting of cybersecurity incidents."
  },
  {
    "name": "Rekall",
    "url": "http://www.rekall-forensic.com/",
    "description": "Advanced forensic and incident response framework."
  },
  {
    "name": "TheHive",
    "url": "https://thehive-project.org/",
    "description": "Scalable, free Security Incident Response Platform designed to make life easier for SOCs, CSIRTs, and CERTs, featuring tight integration with MISP."
  },
  {
    "name": "threat_note",
    "url": "https://github.com/defpoint/threat_note",
    "description": "Web application built by Defense Point Security to allow security researchers the ability to add and retrieve indicators related to their research."
  },
  {
    "name": "AutoMacTC",
    "url": "https://github.com/CrowdStrike/automactc",
    "description": "Modular, automated forensic triage collection framework designed to access various forensic artifacts on macOS, parse them, and present them in formats viable for analysis."
  },
  {
    "name": "OSXAuditor",
    "url": "https://github.com/jipegit/OSXAuditor",
    "description": "Free macOS computer forensics tool."
  },
  {
    "name": "OSXCollector",
    "url": "https://github.com/Yelp/osxcollector",
    "description": "Forensic evidence collection & analysis toolkit for macOS."
  },
  {
    "name": "ir-rescue",
    "url": "https://github.com/diogo-fernan/ir-rescue",
    "description": "Windows Batch script and a Unix Bash script to comprehensively collect host forensic data during incident response."
  },
  {
    "name": "Margarita Shotgun",
    "url": "https://github.com/ThreatResponse/margaritashotgun",
    "description": "Command line utility (that works with or without Amazon EC2 instances) to parallelize remote memory acquisition."
  },
  {
    "name": "Gatekeeper",
    "url": "https://github.com/AltraMayor/gatekeeper",
    "description": "First open source Distributed Denial of Service (DDoS) protection system."
  },
  {
    "name": "fwknop",
    "url": "https://www.cipherdyne.org/fwknop/",
    "description": "Protects ports via Single Packet Authorization in your firewall."
  },
  {
    "name": "ssh-audit",
    "url": "https://github.com/jtesta/ssh-audit",
    "description": "Simple tool that makes quick recommendations for improving an SSH server's security posture."
  },
  {
    "name": "IPFire",
    "url": "https://www.ipfire.org/",
    "description": "Hardened GNU/Linux based router and firewall distribution forked from IPCop."
  },
  {
    "name": "OPNsense",
    "url": "https://opnsense.org/",
    "description": "Hardened FreeBSD based firewall and routing platform forked from pfSense."
  },
  {
    "name": "pfSense",
    "url": "https://www.pfsense.org/",
    "description": "FreeBSD firewall and router distribution forked from m0n0wall."
  },
  {
    "name": "Computer Aided Investigative Environment (CAINE)",
    "url": "https://caine-live.net/",
    "description": "Italian GNU/Linux live distribution that pre-packages numerous digital forensics and evidence collection tools."
  },
  {
    "name": "Security Onion",
    "url": "https://securityonion.net/",
    "description": "Free and open source GNU/Linux distribution for intrusion detection, enterprise security monitoring, and log management."
  },
  {
    "name": "Qubes OS",
    "url": "https://qubes-os.org/",
    "description": "Desktop environment built atop the Xen hypervisor project that runs each end-user program in its own virtual machine intended to provide strict security controls to constrain the reach of any successful malware exploit."
  },
  {
    "name": "CertSpotter",
    "url": "https://github.com/SSLMate/certspotter",
    "description": "Certificate Transparency log monitor from SSLMate that alerts you when a SSL/TLS certificate is issued for one of your domains."
  },
  {
    "name": "Gophish",
    "url": "https://getgophish.com/",
    "description": "Powerful, open-source phishing framework that makes it easy to test your organization's exposure to phishing."
  },
  {
    "name": "King Phisher",
    "url": "https://github.com/securestate/king-phisher",
    "description": "Tool for testing and promoting user awareness by simulating real world phishing attacks."
  },
  {
    "name": "NotifySecurity",
    "url": "https://github.com/certsocietegenerale/NotifySecurity",
    "description": "Outlook add-in used to help your users to report suspicious e-mails to security teams."
  },
  {
    "name": "Phishing Intelligence Engine (PIE)",
    "url": "https://github.com/LogRhythm-Labs/PIE",
    "description": "Framework that will assist with the detection and response to phishing attacks."
  },
  {
    "name": "Swordphish",
    "url": "https://github.com/certsocietegenerale/swordphish-awareness",
    "description": "Platform allowing to create and manage (fake) phishing campaigns intended to train people in identifying suspicious mails."
  },
  {
    "name": "mailspoof",
    "url": "https://github.com/serain/mailspoof",
    "description": "Scans SPF and DMARC records for issues that could allow email spoofing."
  },
  {
    "name": "phishing_catcher",
    "url": "https://github.com/x0rz/phishing_catcher",
    "description": "Configurable script to watch for issuances of suspicious TLS certificates by domain name in the Certificate Transparency Log (CTL) using the CertStream service."
  },
  {
    "name": "APTSimulator",
    "url": "https://github.com/NextronSystems/APTSimulator",
    "description": "Toolset to make a system look as if it was the victim of an APT attack."
  },
  {
    "name": "Atomic Red Team",
    "url": "https://atomicredteam.io/",
    "description": "Library of simple, automatable tests to execute for testing security controls."
  },
  {
    "name": "BadBlood",
    "url": "https://www.secframe.com/badblood/",
    "description": "Fills a test (non-production) Windows Domain with data that enables security analysts and engineers to practice using tools to gain an understanding and prescribe to securing Active Directory."
  },
  {
    "name": "DumpsterFire",
    "url": "https://github.com/TryCatchHCF/DumpsterFire",
    "description": "Modular, menu-driven, cross-platform tool for building repeatable, time-delayed, distributed security events for Blue Team drills and sensor/alert mapping."
  },
  {
    "name": "Metta",
    "url": "https://github.com/uber-common/metta",
    "description": "Automated information security preparedness tool to do adversarial simulation."
  },
  {
    "name": "Network Flight Simulator (flightsim)",
    "url": "https://github.com/alphasoc/flightsim",
    "description": "Utility to generate malicious network traffic and help security teams evaluate security controls and audit their network visibility."
  },
  {
    "name": "RedHunt OS",
    "url": "https://github.com/redhuntlabs/RedHunt-OS",
    "description": "Ubuntu-based Open Virtual Appliance (.ova) preconfigured with several threat emulation tools as well as a defender's toolkit."
  },
  {
    "name": "Bunkerized-nginx",
    "url": "https://github.com/bunkerity/bunkerized-nginx",
    "description": "Docker image of an NginX configuration and scripts implementing many defensive techniques for Web sites."
  },
  {
    "name": "Wazuh",
    "url": "https://wazuh.com/",
    "description": "Open source, multiplatform agent-based security monitoring based on a fork of OSSEC HIDS."
  },
  {
    "name": "ChopShop",
    "url": "https://github.com/MITRECND/chopshop",
    "description": "Framework to aid analysts in the creation and execution of pynids-based decoders and detectors of APT tradecraft."
  },
  {
    "name": "Maltrail",
    "url": "https://github.com/stamparm/maltrail",
    "description": "Malicious network traffic detection system."
  },
  {
    "name": "Moloch",
    "url": "https://github.com/aol/moloch",
    "description": "Augments your current security infrastructure to store and index network traffic in standard PCAP format, providing fast, indexed access."
  },
  {
    "name": "OwlH",
    "url": "https://www.owlh.net/",
    "description": "Helps manage network IDS at scale by visualizing Suricata, Zeek, and Moloch life cycles."
  },
  {
    "name": "Real Intelligence Threat Analysis (RITA)",
    "url": "https://github.com/activecm/rita",
    "description": "Open source framework for network traffic analysis that ingests Zeek logs and detects beaconing, DNS tunneling, and more."
  },
  {
    "name": "Respounder",
    "url": "https://github.com/codeexpress/respounder",
    "description": "Detects the presence of the Responder LLMNR/NBT-NS/MDNS poisoner on a network."
  },
  {
    "name": "Snort",
    "url": "https://snort.org/",
    "description": "Widely-deployed, Free Software IPS capable of real-time packet analysis, traffic logging, and custom rule-based triggers."
  },
  {
    "name": "SpoofSpotter",
    "url": "https://github.com/NetSPI/SpoofSpotter",
    "description": "Catch spoofed NetBIOS Name Service (NBNS) responses and alert to an email or log file."
  },
  {
    "name": "Stenographer",
    "url": "https://github.com/google/stenographer",
    "description": "Full-packet-capture utility for buffering packets to disk for intrusion detection and incident response purposes."
  },
  {
    "name": "Suricata",
    "url": "https://suricata-ids.org/",
    "description": "Free, cross-platform, IDS/IPS with on- and off-line analysis modes and deep packet inspection capabilities that is also scriptable with Lua."
  },
  {
    "name": "Tsunami",
    "url": "https://github.com/google/tsunami-security-scanner",
    "description": "General purpose network security scanner with an extensible plugin system for detecting high severity vulnerabilities with high confidence."
  },
  {
    "name": "VAST",
    "url": "https://github.com/tenzir/vast",
    "description": "Free and open-source network telemetry engine for data-driven security investigations."
  },
  {
    "name": "Wireshark",
    "url": "https://www.wireshark.org",
    "description": "Free and open-source packet analyzer useful for network troubleshooting or forensic netflow analysis."
  },
  {
    "name": "Zeek",
    "url": "https://zeek.org/",
    "description": "Powerful network analysis framework focused on security monitoring, formerly known as Bro."
  },
  {
    "name": "netsniff-ng",
    "url": "http://netsniff-ng.org/",
    "description": " Free and fast GNU/Linux networking toolkit with numerous utilities such as a connection tracking tool (flowtop), traffic generator (trafgen), and autonomous system (AS) trace route utility (astraceroute)."
  },
  {
    "name": "AlienVault OSSIM",
    "url": "https://www.alienvault.com/open-threat-exchange/projects",
    "description": "Single-server open source SIEM platform featuring asset discovery, asset inventorying, behavioral monitoring, and event correlation, driven by AlienVault Open Threat Exchange (OTX)."
  },
  {
    "name": "Prelude SIEM OSS",
    "url": "https://www.prelude-siem.org/",
    "description": "Open source, agentless SIEM with a long history and several commercial variants featuring security event collection, normalization, and alerting from arbitrary log input and numerous popular monitoring tools."
  },
  {
    "name": "Icinga",
    "url": "https://icinga.com/",
    "description": "Modular redesign of Nagios with pluggable user interfaces and an expanded set of data connectors, collectors, and reporting tools."
  },
  {
    "name": "Locust",
    "url": "https://locust.io/",
    "description": "Open source load testing tool in which you can define user behaviour with Python code and swarm your system with millions of simultaneous users."
  },
  {
    "name": "Nagios",
    "url": "https://nagios.org",
    "description": "Popular network and service monitoring solution and reporting platform."
  },
  {
    "name": "OpenNMS",
    "url": "https://opennms.org/",
    "description": "Free and feature-rich networking monitoring system supporting multiple configurations, a variety of alerting mechanisms (email, XMPP, SMS), and numerous data collection methods (SNMP, HTTP, JDBC, etc)."
  },
  {
    "name": "osquery",
    "url": "https://github.com/facebook/osquery",
    "description": "Operating system instrumentation framework for macOS, Windows, and Linux, exposing the OS as a high-performance relational database that can be queried with a SQL-like syntax."
  },
  {
    "name": "Zabbix",
    "url": "https://www.zabbix.com/",
    "description": "Mature, enterprise-level platform to monitor large-scale IT environments."
  },
  {
    "name": "CimSweep",
    "url": "https://github.com/PowerShellMafia/CimSweep",
    "description": "Suite of CIM/WMI-based tools enabling remote incident response and hunting operations across all versions of Windows."
  },
  {
    "name": "DeepBlueCLI",
    "url": "https://github.com/sans-blue-team/DeepBlueCLI",
    "description": "PowerShell module for hunt teaming via Windows Event logs."
  },
  {
    "name": "GRR Rapid Response",
    "url": "https://github.com/google/grr",
    "description": "Incident response framework focused on remote live forensics consisting of a Python agent installed on assets and Python-based server infrastructure enabling analysts to quickly triage attacks and perform analysis remotely."
  },
  {
    "name": "Hunting ELK (HELK)",
    "url": "https://github.com/Cyb3rWard0g/HELK",
    "description": "All-in-one Free Software threat hunting stack based on Elasticsearch, Logstash, Kafka, and Kibana with various built-in integrations for analytics including Jupyter Notebook."
  },
  {
    "name": "MozDef",
    "url": "https://github.com/mozilla/MozDef",
    "description": "Automate the security incident handling process and facilitate the real-time activities of incident handlers."
  },
  {
    "name": "PSHunt",
    "url": "https://github.com/Infocyte/PSHunt",
    "description": "PowerShell module designed to scan remote endpoints for indicators of compromise or survey them for more comprehensive information related to state of those systems."
  },
  {
    "name": "PSRecon",
    "url": "https://github.com/gfoss/PSRecon",
    "description": "PSHunt-like tool for analyzing remote Windows systems that also produces a self-contained HTML report of its findings."
  },
  {
    "name": "PowerForensics",
    "url": "https://github.com/Invoke-IR/PowerForensics",
    "description": "All in one PowerShell-based platform to perform live hard disk forensic analysis."
  },
  {
    "name": "rastrea2r",
    "url": "https://github.com/rastrea2r/rastrea2r",
    "description": "Multi-platform tool for triaging suspected IOCs on many endpoints simultaneously and that integrates with antivirus consoles."
  },
  {
    "name": "Redline",
    "url": "https://www.fireeye.com/services/freeware/redline.html",
    "description": "Freeware endpoint auditing and analysis tool that provides host-based investigative capabilities, offered by FireEye, Inc."
  },
  {
    "name": "Active Directory Control Paths",
    "url": "https://github.com/ANSSI-FR/AD-control-paths",
    "description": "Visualize and graph Active Directory permission configs (\"control relations\") to audit questions such as \"Who can read the CEO's email?\" and similar."
  },
  {
    "name": "AttackerKB",
    "url": "https://attackerkb.com/",
    "description": "Free and public crowdsourced vulnerability assessment platform to help prioritize high-risk patch application and combat vulnerability fatigue."
  },
  {
    "name": "DATA",
    "url": "https://github.com/hadojae/DATA",
    "description": "Credential phish analysis and automation tool that can accept suspected phishing URLs directly or trigger on observed network traffic containing such a URL."
  },
  {
    "name": "Forager",
    "url": "https://github.com/opensourcesec/Forager",
    "description": "Multi-threaded threat intelligence gathering built with Python3 featuring simple text-based configuration and data storage for ease of use and data portability."
  },
  {
    "name": "GRASSMARLIN",
    "url": "https://github.com/nsacyber/GRASSMARLIN",
    "description": "Provides IP network situational awareness of industrial control systems (ICS) and Supervisory Control and Data Acquisition (SCADA) by passively mapping, accounting for, and reporting on your ICS/SCADA network topology and endpoints."
  },
  {
    "name": "MLSec Combine",
    "url": "https://github.com/mlsecproject/combine",
    "description": "Gather and combine multiple threat intelligence feed sources into one customizable, standardized CSV-based format."
  },
  {
    "name": "Malware Information Sharing Platform and Threat Sharing (MISP)",
    "url": "https://misp-project.org/",
    "description": "Open source software solution for collecting, storing, distributing and sharing cyber security indicators."
  },
  {
    "name": "Open Source Vulnerabilities (OSV)",
    "url": "https://osv.dev/",
    "description": "Vulnerability database and triage infrastructure for open source projects aimed at helping both open source maintainers and consumers of open source."
  },
  {
    "name": "Sigma",
    "url": "https://github.com/Neo23x0/sigma",
    "description": "Generic signature format for SIEM systems, offering an open signature format that allows you to describe relevant log events in a straightforward manner."
  },
  {
    "name": "Threat Bus",
    "url": "https://github.com/tenzir/threatbus",
    "description": "Threat intelligence dissemination layer to connect security tools through a distributed publish/subscribe message broker."
  },
  {
    "name": "ThreatIngestor",
    "url": "https://github.com/InQuest/ThreatIngestor",
    "description": "Extendable tool to extract and aggregate IOCs from threat feeds including Twitter, RSS feeds, or other sources."
  },
  {
    "name": "Unfetter",
    "url": "https://nsacyber.github.io/unfetter/",
    "description": "Identifies defensive gaps in security posture by leveraging Mitre's ATT&CK framework."
  },
  {
    "name": "Viper",
    "url": "https://github.com/viper-framework/viper",
    "description": "Binary analysis and management framework enabling easy organization of malware and exploit samples."
  },
  {
    "name": "YARA",
    "url": "https://github.com/VirusTotal/yara",
    "description": "Tool aimed at (but not limited to) helping malware researchers to identify and classify malware samples, described as \"the pattern matching swiss army knife\" for file patterns and signatures."
  },
  {
    "name": "ESET's Malware IoCs",
    "url": "https://github.com/eset/malware-ioc",
    "description": "Indicators of Compromises (IOCs) derived from ESET's various investigations."
  },
  {
    "name": "FireEye's Red Team Tool Countermeasures",
    "url": "https://github.com/fireeye/red_team_tool_countermeasures",
    "description": "Collection of Snort and YARA rules to detect attacks carried out with FireEye's own Red Team tools, first released after FireEye disclosed a breach in December 2020."
  },
  {
    "name": "FireEye's Sunburst Countermeasures",
    "url": "https://github.com/fireeye/sunburst_countermeasures",
    "description": "Collection of IoC in various languages for detecting backdoored SolarWinds Orion NMS activities and related vulnerabilities."
  },
  {
    "name": "YARA Rules",
    "url": "https://github.com/Yara-Rules/rules",
    "description": "Project covering the need for IT security researchers to have a single repository where different Yara signatures are compiled, classified and kept as up to date as possible."
  },
  {
    "name": "OnionBalance",
    "url": "https://onionbalance.readthedocs.io/",
    "description": "Provides load-balancing while also making Onion services more resilient and reliable by eliminating single points-of-failure."
  },
  {
    "name": "Vanguards",
    "url": "https://github.com/mikeperry-tor/vanguards",
    "description": "Version 3 Onion service guard discovery attack mitigation script (intended for eventual inclusion in Tor core)."
  },
  {
    "name": "Certbot",
    "url": "https://certbot.eff.org/",
    "description": "Free tool to automate the issuance and renewal of TLS certificates from the LetsEncrypt Root CA with plugins that configure various Web and e-mail server software."
  },
  {
    "name": "MITMEngine",
    "url": "https://github.com/cloudflare/mitmengine",
    "description": "Golang library for server-side detection of TLS interception events."
  },
  {
    "name": "OpenVPN",
    "url": "https://openvpn.net/",
    "description": "Open source, SSL/TLS-based virtual private network (VPN)."
  },
  {
    "name": "Tor",
    "url": "https://torproject.org/",
    "description": "Censorship circumvention and anonymizing overlay network providing distributed, cryptographically verified name services (.onion domains) to enhance publisher privacy and service availability."
  },
  {
    "name": "BlockBlock",
    "url": "https://objective-see.com/products/blockblock.html",
    "description": "Monitors common persistence locations and alerts whenever a persistent component is added, which helps to detect and prevent malware installation."
  },
  {
    "name": "LuLu",
    "url": "https://objective-see.com/products/lulu.html",
    "description": "Free macOS firewall."
  },
  {
    "name": "Santa",
    "url": "https://github.com/google/santa",
    "description": "Keep track of binaries that are naughty or nice in an allow/deny-listing system for macOS."
  },
  {
    "name": "Stronghold",
    "url": "https://github.com/alichtman/stronghold",
    "description": "Easily configure macOS security settings from the terminal."
  },
  {
    "name": "macOS Fortress",
    "url": "https://github.com/essandess/macOS-Fortress",
    "description": "Automated configuration of kernel-level, OS-level, and client-level security features including privatizing proxying and anti-virus scanning for macOS."
  },
  {
    "name": "HardenTools",
    "url": "https://github.com/securitywithoutborders/hardentools",
    "description": "Utility that disables a number of risky Windows features."
  },
  {
    "name": "NotRuler",
    "url": "https://github.com/sensepost/notruler",
    "description": "Detect both client-side rules and VBScript enabled forms used by the Ruler attack tool when attempting to compromise a Microsoft Exchange server."
  },
  {
    "name": "PlumHound",
    "url": "https://github.com/PlumHound/PlumHound",
    "description": "More effectively use BloodHoundAD in continual security life-cycles by utilizing its pathfinding engine to identify Active Directory security vulnerabilities."
  },
  {
    "name": "Sandboxie",
    "url": "https://www.sandboxie.com/",
    "description": "Free and open source general purpose Windows application sandboxing utility."
  },
  {
    "name": "Sigcheck",
    "url": "https://docs.microsoft.com/en-us/sysinternals/downloads/sigcheck",
    "description": "Audit a Windows host's root certificate store against Microsoft's Certificate Trust List (CTL)."
  },
  {
    "name": "Sticky Keys Slayer",
    "url": "https://github.com/linuz/Sticky-Keys-Slayer",
    "description": "Establishes a Windows RDP session from a list of hostnames and scans for accessibility tools backdoors, alerting if one is discovered."
  },
  {
    "name": "Windows Secure Host Baseline",
    "url": "https://github.com/nsacyber/Windows-Secure-Host-Baseline",
    "description": "Group Policy objects, compliance checks, and configuration tools that provide an automated and flexible approach for securely deploying and maintaining the latest releases of Windows 10."
  },
  {
    "name": "WMI Monitor",
    "url": "https://github.com/realparisi/WMI_Monitor",
    "description": "Log newly created WMI consumers and processes to the Windows Application event log."
  }
]
