[
  {
    "name": "OPEN CONTAINER INITIATIVE\nThe Open Container Initiative is a lightweight, open governance structure, to be formed under the auspices of the Linux Foundation, for the express purpose of creating open industry standards around container formats and runtime.",
    "url": "https://www.opencontainers.org/"
  },
  {
    "name": "Cloud Native Computing Foundation\nThe Cloud Native Computing Foundation will create and drive the adoption of a new set of common container technologies informed by technical merit and end user value, and inspired by Internet-scale computing.",
    "url": "https://cncf.io/"
  },
  {
    "name": "Cloud Foundry Foundation\nThe Cloud is our foundry.",
    "url": "https://www.cloudfoundry.org/foundation/"
  },
  {
    "name": "Open Container Specifications\nThis project is where the Open Container Initiative Specifications are written. This is a work in progress.",
    "url": "https://github.com/opencontainers/specs"
  },
  {
    "name": "App Container basics\nApp Container (appc) is an open specification that defines several aspects of how to run applications in containers: an image format, runtime environment, and discovery protocol.",
    "url": "https://github.com/coreos/rkt/blob/master/Documentation/app-container.md"
  },
  {
    "name": "Systemd Container Interface\nSystemd is a suite of basic building blocks for a Linux system. It provides a system and service manager that runs as PID 1 and starts the rest of the system. If you write a container solution, please consider supporting the following interfaces.",
    "url": "https://wiki.freedesktop.org/www/Software/systemd/ContainerInterface/"
  },
  {
    "name": "Nulecule Specification\nNulecule defines a pattern and model for packaging complex multi-container applications and services, referencing all their dependencies, including orchestration metadata in a container image for building, deploying, monitoring, and active management.",
    "url": "https://github.com/projectatomic/atomicapp/tree/master/docs/spec"
  },
  {
    "name": "Oracle microcontainer manifesto\nThis is not a new container format, but simply a specific method for constructing a container that allows for better security and stability.",
    "url": "https://blogs.oracle.com/developers/the-microcontainer-manifesto"
  },
  {
    "name": "Amazon EC2 Container Service \nContainer management service that supports Docker containers and allows you to easily run applications on a managed cluster of Amazon EC2 instances.",
    "url": "https://aws.amazon.com/ecs/"
  },
  {
    "name": "Google Cloud Platform\nRun Docker containers on Google Cloud Platform, powered by Kubernetes. Google Container Engine actively schedules your containers, based on declared needs, on a managed cluster of virtual machines.",
    "url": "https://cloud.google.com/container-engine/"
  },
  {
    "name": "Jelastic\nUnlimited PaaS and Container-Based IaaS in a Joint Cloud Solution for DevOps.",
    "url": "http://jelastic.com/"
  },
  {
    "name": "Joyent\nHigh-Performance Container-Native Infrastructure for Today's Demanding Real-Time Web and Mobile Applications.",
    "url": "https://www.joyent.com/"
  },
  {
    "name": "Kubernetes\nManage a cluster of Linux containers as a single system to accelerate Dev and simplify Ops.",
    "url": "http://kubernetes.io/"
  },
  {
    "name": "Mesosphere\nThe Mesosphere Datacenter Operating System (DCOS) is a new kind of operating system that spans all of the machines in your datacenter or cloud. It provides a highly elastic, and highly scalable way of deploying applications, services and big data infrastructure on shared resources.",
    "url": "https://mesosphere.com/"
  },
  {
    "name": "OpenShift Origin\nOpenShift Origin is a distribution of Kubernetes optimized for continuous application development and multi-tenant deployment. Origin adds developer and operations-centric tools on top of Kubernetes to enable rapid application development, easy deployment and scaling, and long-term lifecycle maintenance for small and large teams.",
    "url": "https://www.openshift.org/"
  },
  {
    "name": "Warden\nManages isolated, ephemeral, and resource controlled environments. Part of Cloud Foundry",
    "url": "https://github.com/cloudfoundry/warden",
    "description": "the open platform as a service project."
  },
  {
    "name": "Virtuozzo\nA platform, built on Virtuozzo containers, that can be easily run on top of any bare-metal or virtual servers in any public or private cloud, to automate, optimize, and accelerate internal IT and development processes.",
    "url": "https://virtuozzo.com"
  },
  {
    "name": "Rancher\nRancher is a complete, open source platform for deploying and managing containers in production. It includes commercially-supported distributions of Kubernetes, Mesos, and Docker Swarm, making it easy to run containerized applications on any infrastructure.",
    "url": "http://rancher.com/"
  },
  {
    "name": "Docker Swarm\nDocker Swarm is native clustering for Docker.",
    "url": "https://docs.docker.com/swarm"
  },
  {
    "name": "Azure Container Service\nAzure Container Service optimizes the configuration of popular open source tools and technologies specifically for Azure.",
    "url": "https://azure.microsoft.com/en-us/services/container-service/"
  },
  {
    "name": "CIAO\nCloud Integrated Advanced Orchestrator for Intel Clear Linux OS.",
    "url": "https://ciao-project.github.io/"
  },
  {
    "name": "Kontena\nKontena is a developer friendly, open source platform for orchestrating applications that are run on Docker containers. It simplifies deploying and running containerized applications on any infrastructure.",
    "url": "http://kontena.io"
  },
  {
    "name": "Hyper.sh\nServerless Container Platform.",
    "url": "https://hyper.sh"
  },
  {
    "name": "CoreOs\nA lightweight Linux operating system designed for clustered deployments providing automation, security, and scalability for your most critical applications.",
    "url": "https://coreos.com/"
  },
  {
    "name": "RancherOS\nRancherOS is a tiny Linux distro that runs the entire OS as Docker containers.",
    "url": "http://rancher.com/rancher-os/"
  },
  {
    "name": "Project Atomic\nProject Atomic provides the best platform for your Linux Docker Kubernetes (LDK) application stack. Use immutable infrastructure to deploy and scale your containerized applications.",
    "url": "http://www.projectatomic.io/"
  },
  {
    "name": "Snappy Ubuntu Core\nUbuntu Core is the perfect system for large-scale cloud container deployments, bringing transactional updates to the world’s favourite container platform.",
    "url": "https://www.ubuntu.com/cloud/snappy"
  },
  {
    "name": "ResinOS\nA host OS tailored for containers, designed for reliability, proven in production.",
    "url": "https://resinos.io/"
  },
  {
    "name": "Photon\nPhoton OS is a minimal Linux container host designed to have a small footprint and tuned for VMware platforms. Photon is intended to invite collaboration around running containerized and Linux applications in a virtualized environment.",
    "url": "https://github.com/vmware/photon"
  },
  {
    "name": "Clear Linux Project\nThe Clear Linux Project for Intel Architecture is a distribution built for various Cloud use cases.",
    "url": "https://clearlinux.org/documentation/clear-linux/get-started"
  },
  {
    "name": "CargOS\nCargOS is a new lightweight, open source, platform for Docker hosts that aims for speed, manageability and security. Releases are built for 64-bit Intel/AMD CPUs.",
    "url": "https://cargos.io/"
  },
  {
    "name": "OSv\nOSv is the open source operating system designed for the cloud. Built from the ground up for effortless deployment and management, with superior performance.",
    "url": "http://osv.io/"
  },
  {
    "name": "HypriotOS\nMinimal Debian-based operating systems that is optimized to run Docker. It made it dead easy use Docker on any Raspberry Pi.",
    "url": "http://blog.hypriot.com/about/"
  },
  {
    "name": "Docker\nAn open platform for distributed applications for developers and sysadmins. Standard de facto.",
    "url": "https://github.com/veggiemonk/awesome-docker#cloud-infrastructure"
  },
  {
    "name": "LXD\nDaemon based on liblxc offering a REST API to manage LXC containers.",
    "url": "https://github.com/lxc/lxd"
  },
  {
    "name": "OpenVZ\nOpenVZ is container-based virtualization for Linux. OpenVZ creates multiple secure, isolated Linux containers (otherwise known as VEs or VPSs) on a single physical server enabling better server utilization and ensuring that applications do not conflict.",
    "url": "https://openvz.org/Main_Page"
  },
  {
    "name": "MultiDocker\nCreate a secure multi-user Docker machine, where each user is segregated into an indepentent container.",
    "url": "https://github.com/marty90/multidocker"
  },
  {
    "name": "Lithos\nLithos is a process supervisor and containerizer for running services. It is not intended to be system init, but rather tries to be a base tool to build container orchestration.",
    "url": "https://github.com/tailhook/lithos/"
  },
  {
    "name": "runc\nrunc is a CLI tool for spawning and running containers according to the OCS specification.",
    "url": "https://github.com/opencontainers/runc"
  },
  {
    "name": "Bocker\nDocker implemented in around 100 lines of bash.",
    "url": "https://github.com/p8952/bocker"
  },
  {
    "name": "Rocket\nrkt (pronounced \"rock-it\") is a CLI for running app containers on Linux. rkt is designed to be composable, secure, and fast. Based on AppC specification.",
    "url": "https://github.com/coreos/rkt"
  },
  {
    "name": "LXC\nLXC is the well known set of tools, templates, library and language bindings. It's pretty low level, very flexible and covers just about every containment feature supported by the upstream kernel.",
    "url": "https://github.com/lxc/lxc"
  },
  {
    "name": "Vagga\nVagga is a fully-userspace container engine inspired by Vagrant and Docker, specialized for development environments.",
    "url": "https://github.com/tailhook/vagga"
  },
  {
    "name": "libct\nLibct is a containers management library which provides convenient API for frontend programs to rule a container during its whole lifetime.",
    "url": "https://github.com/xemul/libct"
  },
  {
    "name": "libvirt\nA big toolkit to interact with the virtualization capabilities of recent versions of Linux (and other OSes).",
    "url": "https://libvirt.org/drvlxc.html"
  },
  {
    "name": "systemd-nspawn\nSpawn a namespace container for debugging, testing and building. Part of systemd.",
    "url": "https://wiki.archlinux.org/index.php/Systemd-nspawn"
  },
  {
    "name": "porto\nThe main goal of Porto is to create a convenient, reliable interface over several Linux kernel mechanism such as cgroups, namespaces, mounts, networking etc.",
    "url": "https://github.com/yandex/porto"
  },
  {
    "name": "udocker\nA basic user tool to execute simple containers in batch or interactive systems without root privileges.",
    "url": "https://github.com/indigo-dc/udocker"
  },
  {
    "name": "Let Me Contain That For You\nLMCTFY is the open source version of Google’s container stack, which provides Linux application containers.",
    "url": "https://github.com/google/lmctfy"
  },
  {
    "name": "cc-oci-runtime\nIntel Clear Linux OCI (Open Containers Initiative) compatible runtime.",
    "url": "https://github.com/01org/cc-oci-runtime"
  },
  {
    "name": "railcar\nRailcar is a rust implementation of the opencontainers initiative's runtime spec. It is similar to the reference implementation runc, but it is implemented completely in rust for memory safety without needing the overhead of a garbage collector or multiple threads.",
    "url": "https://github.com/oracle/railcar"
  },
  {
    "name": "Kata Containers\nKata Containers is a new open source project building extremely lightweight virtual machines that seamlessly plug into the containers ecosystem.",
    "url": "https://katacontainers.io/"
  },
  {
    "name": "plash\nLightweight, rootless containers.",
    "url": "https://github.com/ihucos/plash/"
  },
  {
    "name": "runv\nHypervisor-based (KVM, Xen, QEMU) Runtime for OCI. Security by isolation.",
    "url": "https://github.com/hyperhq/runv"
  },
  {
    "name": "Firejail\nFirejail is a SUID sandbox program that reduces the risk of security breaches by restricting the running environment of untrusted applications using Linux namespaces, seccomp-bpf and Linux capabilities.",
    "url": "https://l3net.wordpress.com/projects/firejail/"
  },
  {
    "name": "NsJail\nNsJail is a process isolation tool for Linux. It makes use of the namespacing, resource control, and seccomp-bpf syscall filter subsystems of the Linux kernel.",
    "url": "https://github.com/google/nsjail"
  },
  {
    "name": "Subuser\nSecuring the Linux desktop with Docker.",
    "url": "https://github.com/subuser-security/subuser"
  },
  {
    "name": "Snappy\nSnappy Ubuntu Core is a new rendition of Ubuntu with transactional updates",
    "url": "https://wiki.ubuntu.com/SecurityTeam/Specifications/SnappyConfinement",
    "description": "a minimal server image with the same libraries as today’s Ubuntu, but applications are provided through a simpler mechanism."
  },
  {
    "name": "xdg-app\nxdg-app is a system for building, distributing and running sandboxed desktop applications on Linux.",
    "url": "https://wiki.gnome.org/Projects/SandboxedApps"
  },
  {
    "name": "Bubblewrap\nRun applications in a sandbox using Linux namespaces without root privileges, with user namespacing provided via setuid binary.",
    "url": "https://github.com/projectatomic/bubblewrap"
  },
  {
    "name": "singularity\nUniversal application containers for Linux.",
    "url": "https://github.com/singularityware/singularity"
  },
  {
    "name": "nsenter\nRun program with namespaces of other processes. Part of the util-linux.",
    "url": "http://man7.org/linux/man-pages/man1/nsenter.1.html"
  },
  {
    "name": "ip-netns\nProcess network namespace management. Part of the iproute2.",
    "url": "http://man7.org/linux/man-pages/man8/ip-netns.8.html"
  },
  {
    "name": "unshare\nRun program with some namespaces unshared from parent. Part of the util-linux.",
    "url": "http://man7.org/linux/man-pages/man1/unshare.1.html"
  },
  {
    "name": "python-nsenter\nThis Python package allows entering Linux kernel namespaces (mount, IPC, net, PID, user and UTS) by doing the \"setns\" syscall.",
    "url": "https://github.com/zalando/python-nsenter"
  },
  {
    "name": "butter\nPython library to interface to low level linux features (inotify, fanotify, timerfd, signalfd, eventfd, containers) with asyncio support.",
    "url": "https://pypi.python.org/pypi/butter"
  },
  {
    "name": "pyspaces\nWorks with Linux namespaces through glibc with pure python.",
    "url": "https://github.com/Friz-zy/pyspaces"
  },
  {
    "name": "CRIU\nCheckpoint/Restore In Userspace is a software tool for Linux operating system. Using this tool, you can freeze a running application (or part of it) and checkpoint it to a hard drive as a collection of files. CRIU integrated with Docker and LXC to implement Live migration of containers.",
    "url": "https://criu.org/Main_Page"
  },
  {
    "name": "Moby\nA \"Lego set\" of toolkit components for containers software created by Docker.",
    "url": "https://github.com/moby/moby"
  },
  {
    "name": "container-diff\nA tool for analyzing and comparing container images.",
    "url": "https://github.com/GoogleCloudPlatform/container-diff"
  },
  {
    "name": "buildah\nA tool which facilitates building OCI container images.",
    "url": "https://github.com/projectatomic/buildah"
  },
  {
    "name": "skopeo\nWork with remote images registries",
    "url": "https://github.com/projectatomic/skopeo",
    "description": "retrieving information, images, signing content."
  },
  {
    "name": "img\nStandalone, daemon-less, unprivileged Dockerfile and OCI compatible container image builder.",
    "url": "https://github.com/jessfraz/img"
  },
  {
    "name": "dgr\nCommand line utility designed to build and to configure at runtime App Containers Images (ACI) and App Container Pods (POD) based on convention over configuration.",
    "url": "https://github.com/blablacar/dgr"
  },
  {
    "name": "Whaler\nWhaler is designed to reverse engineer a Docker Image into the Dockerfile that created it.",
    "url": "https://github.com/P3GLEG/Whaler"
  },
  {
    "name": "LXC-Web-Panel\nWeb panel for LXC on Ubuntu.",
    "url": "https://lxc-webpanel.github.io/"
  },
  {
    "name": "Liman\nBasic docker monitoring web application.",
    "url": "https://github.com/salihciftci/liman"
  },
  {
    "name": "The Twelve-Factor App\nThe twelve-factor app is a methodology for building software-as-a-service apps.",
    "url": "https://12factor.net/"
  },
  {
    "name": "Container Best Practices\nA collaborative project to document container-based application architecture, creation and management from Project Atomic.",
    "url": "http://docs.projectatomic.io/container-best-practices/"
  },
  {
    "name": "Docker bench security\nThe Docker Bench for Security is a script that checks for dozens of common best-practices around deploying Docker containers in production.",
    "url": "https://github.com/docker/docker-bench-security"
  },
  {
    "name": "CoreOS Clair\nOpen Source Vulnerability Analysis for your Containers.",
    "url": "https://coreos.com/blog/vulnerability-analysis-for-containers/"
  },
  {
    "name": "bane\nCustom AppArmor profile generator for docker containers.",
    "url": "https://github.com/jfrazelle/bane"
  },
  {
    "name": "OpenSCAP\nThe OpenSCAP ecosystem provides multiple tools to assist administrators and auditors with assessment, measurement and enforcement of security baselines.",
    "url": "https://github.com/OpenSCAP/container-compliance"
  },
  {
    "name": "drydock\nDrydock provides a flexible way of assessing the security of your Docker daemon configuration and containers using editable audit templates.",
    "url": "https://github.com/zuBux/drydock"
  },
  {
    "name": "trireme\nSecurity by segmentation for Docker and Kubernetes.",
    "url": "https://www.aporeto.com/trireme/"
  },
  {
    "name": "goss\nQuick and Easy server testing/validation.",
    "url": "https://github.com/aelsabbahy/goss"
  },
  {
    "name": "sockguard\nA proxy for docker.sock that enforces access control and isolated privileges.",
    "url": "https://github.com/buildkite/sockguard"
  },
  {
    "name": "gvisor\ngVisor is a user-space kernel, written in Go, that implements a substantial portion of the Linux system surface. It includes an Open Container Initiative (OCI) runtime called runsc that provides an isolation boundary between the application and the host kernel. The runsc runtime integrates with Docker and Kubernetes, making it simple to run sandboxed containers.",
    "url": "https://github.com/google/gvisor"
  },
  {
    "name": "docker-explorer\nA tool to help forensicate offline docker acquisitions.",
    "url": "https://github.com/google/docker-explorer/"
  },
  {
    "name": "CIS Security Benchmarks",
    "url": "https://benchmarks.cisecurity.org/about/"
  },
  {
    "name": "Are Docker containers really secure?",
    "url": "https://opensource.com/business/14/7/docker-security-selinux"
  },
  {
    "name": "Bringing new security features to Docker",
    "url": "https://opensource.com/business/14/9/security-for-docker"
  },
  {
    "name": "Docker, Linux Containers (LXC), and security",
    "url": "http://www.slideshare.net/jpetazzo/docker-linux-containers-lxc-and-security"
  },
  {
    "name": "For containers, security is problem #1",
    "url": "http://www.itworld.com/article/2920349/security/for-containers-security-is-problem-1.html"
  },
  {
    "name": "Linux Container Security",
    "url": "https://mjg59.dreamwidth.org/33170.html"
  },
  {
    "name": "Ask HN: Best Linux sandbox?",
    "url": "https://news.ycombinator.com/item?id=10030868"
  },
  {
    "name": "CIS Docker 1.6 Benchmark v1.0.0",
    "url": "https://benchmarks.cisecurity.org/tools2/docker/CIS_Docker_1.6_Benchmark_v1.0.0.pdf"
  },
  {
    "name": "Understanding docker security and best practices",
    "url": "https://blog.docker.com/2015/05/understanding-docker-security-and-best-practices/"
  },
  {
    "name": "Update on Ubuntu Phone security issue",
    "url": "https://insights.ubuntu.com/2015/10/15/update-on-ubuntu-phone-security-issue/"
  },
  {
    "name": "Don't expose the Docker socket (not even to a container)",
    "url": "https://www.lvh.io/posts/dont-expose-the-docker-socket-not-even-to-a-container.html"
  },
  {
    "name": "RedHat Blog\n\nIntroduction to Linux Containers\nWhat’s Next for Containers? User Namespaces\nArchitecting Containers Part 1: Why Understanding User Space vs. Kernel Space Matters\nArchitecting Containers Part 2: Why the User Space Matters\nSecure Your Containers with this One Weird Trick\n\n",
    "url": "http://rhelblog.redhat.com/?s=container&submit=Search"
  },
  {
    "name": "Introduction to Linux Containers",
    "url": "https://access.redhat.com/articles/1353593"
  },
  {
    "name": "What’s Next for Containers? User Namespaces",
    "url": "http://rhelblog.redhat.com/2015/07/07/whats-next-for-containers-user-namespaces/#more-1004"
  },
  {
    "name": "Architecting Containers Part 1: Why Understanding User Space vs. Kernel Space Matters",
    "url": "http://rhelblog.redhat.com/2015/07/29/architecting-containers-part-1-user-space-vs-kernel-space/"
  },
  {
    "name": "Architecting Containers Part 2: Why the User Space Matters",
    "url": "http://rhelblog.redhat.com/2015/09/17/architecting-containers-part-2-why-the-user-space-matters-2/"
  },
  {
    "name": "Secure Your Containers with this One Weird Trick",
    "url": "http://rhelblog.redhat.com/2016/10/17/secure-your-containers-with-this-one-weird-trick/"
  },
  {
    "name": "Why you shouldn't use ENV variables for secret data",
    "url": "https://diogomonica.com/2017/03/27/why-you-shouldnt-use-env-variables-for-secret-data/"
  },
  {
    "name": "When to use-Docker alternatives rkt and LXD",
    "url": "http://searchitoperations.techtarget.com/tip/When-to-use-Docker-alternatives-rkt-and-LXD"
  },
  {
    "name": "sysdig-container-ecosystem\nThe ecosystem of awesome new technologies emerging around containers and microservices can be a little overwhelming, to say the least. We thought we might be able to help: welcome to the Container Ecosystem Project.",
    "url": "https://github.com/draios/sysdig-container-ecosystem"
  },
  {
    "name": "doger.io\nThis page is an attempt to document the ins and outs of containers on Linux. This is not just restricted to programmers looking to implement containers or use container like features in their own code but also Sysadmins and Users who want to get more of a handle on how containers work 'under the hood'.",
    "url": "http://doger.io/"
  }
]
