[
  {
    "name": "The Foos",
    "url": "https://itunes.apple.com/app/id923441570",
    "description": "A funny, pre-literate iPad game that teaches concepts for commands, parameters, loops, and conditionals."
  },
  {
    "name": "Scratch Jr.",
    "url": "https://www.scratchjr.org/",
    "description": "An app that teaches young kids how to visually code interactive stories and games. A simplified version of the Scratch website, for a tablet."
  },
  {
    "name": "Lightbot",
    "url": "https://lightbot.com/",
    "description": "Solve puzzles with commands, loops, and conditionals. Comes in Lightbot and lightbot Jr, and a mobile app or a desktop website."
  },
  {
    "name": "Cargo Bot",
    "url": "https://itunes.apple.com/us/app/cargo-bot/id519690804?mt=8",
    "description": "iPad app to solve problems with constraints using commands, loops, conditional statements. More difficult puzzles than Lightbot."
  },
  {
    "name": "Code.org",
    "url": "https://studio.code.org/",
    "description": "A website with interactive coding games and courses for kids. Covers a large range of ages and skill levels."
  },
  {
    "name": "Scratch",
    "url": "https://scratch.mit.edu/",
    "description": "Scratch is a popular visual programming language for beginners, created by MIT. The Scratch website is a platform for kids to make interactive stories and share them with each other."
  },
  {
    "name": "DIY.org",
    "url": "https://diy.org/skills",
    "description": "An online community for kids to learn anything.  Programming skills listed are App Dev, Backend Dev, Frontend Dev, Game Dev, Graphic Designer, Open Sourcerer, Scratcher, Sys Admin, and Web Designer."
  },
  {
    "name": "Bitsbox",
    "url": "https://bitsbox.com/",
    "description": "A monthly box subscription that teaches kids how to code."
  },
  {
    "name": "CS Unplugged",
    "url": "http://csunplugged.org/",
    "description": "A collection of free learning activities that teach Computer Science through engaging games and puzzles that use cards, string, crayons and lots of running around."
  },
  {
    "name": "Lauren Ipsum",
    "url": "http://laurenipsum.org/",
    "description": "A book that teaches problem-solving concepts in the context of programming.  Sample chapters available online."
  },
  {
    "name": "Lego Mindstorms",
    "url": "http://www.lego.com/en-us/mindstorms/?domainredir=mindstorms.lego.com",
    "description": "A robotics kit by Lego."
  },
  {
    "name": "Ruby Warrior",
    "url": "https://www.bloc.io/ruby-warrior#/",
    "description": "An online tutorial-game with cool music that teaches Ruby programming."
  },
  {
    "name": "Swift Playgrounds",
    "url": "http://www.apple.com/swift/playgrounds/",
    "description": "Apple's fun iPad app for learning Swift."
  },
  {
    "name": "Khan Academy",
    "url": "https://www.khanacademy.org/computing/computer-programming",
    "description": "Computer Programming - A series of web-based programming lessons with interactive challenges, by Khan Academy. Teaches topics like animation, game development, and web programming.  Users can post questions, which get answered quickly by the community."
  },
  {
    "name": "Web Design for Kids",
    "url": "https://webdesign.tutsplus.com/series/web-design-for-kids--cms-823",
    "description": "A series of tutorials teaching children the basics of designing and building a website with HTML and CSS."
  }
]
