[
  {
    "name": "Arduino",
    "url": "https://www.arduino.cc/",
    "description": "Arduino is an open-source electronics platform based on easy-to-use hardware and software. It's intended for anyone making interactive projects."
  },
  {
    "name": "BeagleBoard",
    "url": "http://beagleboard.org/",
    "description": "The BeagleBoard is a low-power open-source hardware single-board computer produced by Texas Instruments in association with Digi-Key and Newark element14."
  },
  {
    "name": "Dragonboard",
    "url": "https://developer.qualcomm.com/hardware/dragonboard-410c",
    "description": "The DragonBoard 410c, a product of Arrow Electronics, is the development board based on the mid-tier Qualcomm® Snapdragon™ 410E processor. It features advanced processing power, Wi-Fi, Bluetooth connectivity, and GPS, all packed into a board the size of a credit card."
  },
  {
    "name": "HummingBoard",
    "url": "https://www.solid-run.com/freescale-imx6-family/hummingboard/",
    "description": "HummingBoard is a family of three Linux- and Android-ready, open source SBCs based on 1GHz Freescale i.MX6 SoCs, with a Pi-like 26-pin I/O connector."
  },
  {
    "name": "Intel Galileo",
    "url": "https://www-ssl.intel.com/content/www/us/en/do-it-yourself/galileo-maker-quark-board.html",
    "description": "The Intel® Galileo Gen 2 board is the first in a family of Arduino*-certified development and prototyping boards based on Intel® architecture and specifically designed for makers, students, educators, and DIY electronics enthusiasts."
  },
  {
    "name": "Microduino",
    "url": "https://www.microduino.cc/",
    "description": "Microduino and mCookie bring powerful, small, stackable electronic hardware to makers, designers, engineers, students and curious tinkerers of all ages. Build open-source projects or create innovative new ones."
  },
  {
    "name": "Node MCU (ESP 8266)",
    "url": "http://nodemcu.com/index_en.html",
    "description": "NodeMCU is an open source IoT platform. It uses the Lua scripting language. It is based on the eLua project, and built on the ESP8266 SDK 0.9.5."
  },
  {
    "name": "OLinuXino",
    "url": "https://www.olimex.com/Products/OLinuXino/open-source-hardware",
    "description": "OLinuXino is an Open Source Software and Open Source Hardware low cost (EUR 30) Linux Industrial grade single board computer with GPIOs capable of operating from -25°C to +85°C."
  },
  {
    "name": "Odroid",
    "url": "http://www.hardkernel.com/",
    "description": "The ODROID means Open + Droid. It is a development platform for the hardware as well as the software."
  },
  {
    "name": "Particle",
    "url": "https://www.particle.io",
    "description": "A suite of hardware and software tools to help you prototype, scale, and manage your Internet of Things products."
  },
  {
    "name": "Pinoccio",
    "url": "https://www.open-electronics.org/pinoccio-wifi-mesh-networking-for-arduino-and-iot-available-now/",
    "description": "Pinoccio is a solution to add mesh networking capability and WiFi-Internet access to all yout IoT devices, and it is Arduino compatible."
  },
  {
    "name": "Raspberry Pi",
    "url": "https://www.raspberrypi.org/",
    "description": "The Raspberry Pi is a low cost, credit-card sized computer that plugs into a computer monitor or TV, and uses a standard keyboard and mouse. It’s capable of doing everything you’d expect a desktop computer to do, from browsing the internet and playing high-definition video, to making spreadsheets, word-processing, and playing games."
  },
  {
    "name": "Tessel",
    "url": "https://tessel.io/",
    "description": "Tessel is a completely open source and community-driven IoT and robotics development platform. It encompases development boards, hardware module add-ons, and the software that runs on them."
  },
  {
    "name": "UDOO",
    "url": "http://www.udoo.org",
    "description": "UDOO is a single-board computer with an integrated Arduino 2 compatible microcontroller, designed for computer science education, the world of Makers and the Internet of Things."
  },
  {
    "name": "Apache Mynewt",
    "url": "https://mynewt.apache.org/",
    "description": "Apache Mynewt is a real-time, modular operating system for connected IoT devices that need to operate for long periods of time under power, memory, and storage constraints. The first connectivity stack offered is BLE 4.2."
  },
  {
    "name": "ARM mbed",
    "url": "http://www.mbed.com/",
    "description": "The ARM® mbed™ IoT Device Platform provides the operating system, cloud services, tools and developer ecosystem to make the creation and deployment of commercial, standards-based IoT solutions possible at scale."
  },
  {
    "name": "Contiki",
    "url": "http://www.contiki-os.org/",
    "description": "Contiki is an open source operating system for the Internet of Things. Contiki connects tiny low-cost, low-power microcontrollers to the Internet."
  },
  {
    "name": "FreeRTOS",
    "url": "http://www.freertos.org/",
    "description": "FreeRTOS is a popular real-time operating system kernel for embedded devices, that has been ported to 35 microcontrollers."
  },
  {
    "name": "Google Brillo",
    "url": "https://developers.google.com/brillo/",
    "description": "Brillo extends the Android platform to all your connected devices, so they are easy to set up and work seamlessly with each other and your smartphone."
  },
  {
    "name": "OpenWrt",
    "url": "https://openwrt.org/",
    "description": "OpenWrt is an operating system (in particular, an embedded operating system) based on the Linux kernel, primarily used on embedded devices to route network traffic. The main components are the Linux kernel, util-linux, uClibc or musl, and BusyBox. All components have been optimized for size, to be small enough for fitting into the limited storage and memory available in home routers."
  },
  {
    "name": "Snappy Ubuntu",
    "url": "https://developer.ubuntu.com/en/snappy/",
    "description": "Snappy Ubuntu Core is a new rendition of Ubuntu with transactional updates.  It provides a minimal server image with the same libraries as today’s Ubuntu, but applications are provided through a simpler mechanism."
  },
  {
    "name": "NodeOS",
    "url": "http://node-os.com/",
    "description": "NodeOS is an operating system entirely written in Javascript, and managed by npm on top of  the Linux kernel."
  },
  {
    "name": "Raspbian",
    "url": "https://raspbian.org/",
    "description": "Raspbian is a free operating system based on Debian optimized for the Raspberry Pi hardware."
  },
  {
    "name": "RIOT",
    "url": "http://www.riot-os.org/",
    "description": "The friendly Operating System for the Internet of Things."
  },
  {
    "name": "Tiny OS",
    "url": "http://tinyos.stanford.edu/tinyos-wiki/index.php/TinyOS_Overview",
    "description": "TinyOS is an open source, BSD-licensed operating system designed for low-power wireless devices, such as those used in sensor networks, ubiquitous computing, personal area networks, smart buildings, and smart meters."
  },
  {
    "name": "Windows 10 IoT Core",
    "url": "https://dev.windows.com/en-us/iot",
    "description": "Windows 10 IoT is a family of Windows 10 editions targeted towards a wide range of intelligent devices, from small industrial gateways to larger more complex devices like point of sales terminals and ATMs."
  },
  {
    "name": "Zephyr Project",
    "url": "https://www.zephyrproject.org/",
    "description": "The Zephyr™ Project is a scalable real-time operating system (RTOS) supporting multiple hardware architectures, optimized for resource constrained devices, and built with security in mind."
  },
  {
    "name": "C",
    "url": "https://en.wikipedia.org/wiki/C_(programming_language)",
    "description": "A general-purpose, imperative computer programming language, supporting structured programming, lexical variable scope and recursion, while a static type system prevents many unintended operations."
  },
  {
    "name": "C++",
    "url": "https://en.wikipedia.org/wiki/C%2B%2B",
    "description": "A general-purpose programming language. It has imperative, object-oriented and generic programming features, while also providing facilities for low-level memory manipulation."
  },
  {
    "name": "Groovy",
    "url": "http://www.groovy-lang.org/",
    "description": "Groovy is a powerful, optionally typed and dynamic language, with static-typing and static compilation capabilities, for the Java platform aimed at multiplying developers’ productivity thanks to a concise, familiar and easy to learn syntax. It is used by the SmartThings development environment to create smart applications."
  },
  {
    "name": "Lua",
    "url": "http://www.lua.org/",
    "description": "Lua is a powerful, fast, lightweight, embeddable scripting language. Lua is dynamically typed, runs by interpreting bytecode for a register-based virtual machine, and has automatic memory management with incremental garbage collection, making it ideal for configuration, scripting, and rapid prototyping."
  },
  {
    "name": "eLua",
    "url": "http://www.eluaproject.net/",
    "description": "eLua stands for Embedded Lua and the project offers the full implementation of the Lua Programming Language to the embedded world, extending it with specific features for efficient and portable software embedded development."
  },
  {
    "name": "ELFE",
    "url": "http://c3d.github.io/elfe/",
    "description": "ELFE is a very simple and small programming language. While it is a general-purpose programming language, it is specifically tuned to facilitate the configuration and control of swarms of small devices such as sensors or actuators."
  },
  {
    "name": "AllJoyn",
    "url": "https://openconnectivity.org/developer/reference-implementation/alljoyn",
    "description": "AllJoyn is an open source software framework that makes it easy for devices and apps to discover and communicate with each other."
  },
  {
    "name": "Apple HomeKit",
    "url": "https://developer.apple.com/homekit/",
    "description": "HomeKit is a framework for communicating with and controlling connected accessories in a user’s home."
  },
  {
    "name": "Blynk",
    "url": "http://www.blynk.cc",
    "description": "Blynk is a platform for creating iOS and Android apps for connected things. You can easily build graphic interfaces for all your projects by simply dragging and dropping widgets (right on the smartphone). Supports Ethernet, WiFi, Bluetooth, GSM/GPRS, USB/Serial connections with wide range of prototyping platforms from Arduino, Raspberry, ARM mbed, Particle, RedBear, etc."
  },
  {
    "name": "Countly IoT Analytics",
    "url": "http://github.com/countly/countly-server",
    "description": "Countly is a general purpose analytics platform for mobile and IoT devices, available as open source."
  },
  {
    "name": "Eclipse Smarthome",
    "url": "https://eclipse.org/smarthome/",
    "description": "The Eclipse SmartHome framework is designed to run on embedded devices, such as a Raspberry Pi, a BeagleBone Black or an Intel Edison. It requires a Java 7 compliant JVM and an OSGi (4.2+) framework, such as Eclipse Equinox."
  },
  {
    "name": "Freedomotic",
    "url": "http://www.freedomotic.com",
    "description": "Freedomotic is an open source, flexible, secure Internet of Things (IoT) development framework, useful to build and manage modern smart spaces. It is targeted to private individuals (home automation) as well as business users (smart retail environments, ambient aware marketing, monitoring and analytics, etc). Written in Java, it can interact with well known standard building automation protocols as well as with \"do it yourself\" solutions."
  },
  {
    "name": "Iotivity",
    "url": "https://www.iotivity.org/",
    "description": "IoTivity is an open source software framework enabling seamless device-to-device connectivity to address the emerging needs of the Internet of Things."
  },
  {
    "name": "Kura",
    "url": "https://eclipse.org/kura/",
    "description": "Kura aims at offering a Java/OSGi-based container for M2M applications running in service gateways. Kura provides or, when available, aggregates open source implementations for the most common services needed by M2M applications."
  },
  {
    "name": "Lelylan",
    "url": "http://www.lelylan.com/",
    "description": "Lelylan is an IoT cloud platform based on a lightweight microservices architecture. The Lelylan platform is both hardware-agnostic and platform-agnostic. This means that you can connect any hardware, from the ESP8266 to the most professional embedded hardware solution and everything in between - and it can run on any public cloud, your own private datacenter, or even in a hybrid environment, whether virtualized or bare metal."
  },
  {
    "name": "Mihini",
    "url": "https://wiki.eclipse.org/Mihini",
    "description": "The main goal of Mihini is to deliver an embedded runtime running on top of Linux, that exposes high-level API for building M2M applications. Mihini aims at enabling easy and portable development, by facilitating access to the I/Os of an M2M system, providing a communication layer, etc."
  },
  {
    "name": "OpenHAB",
    "url": "http://www.openhab.org/",
    "description": "The openHAB runtime is a set of OSGi bundles deployed on an OSGi framework (Equinox). It is therefore a pure Java solution and needs a JVM to run. Being based on OSGi, it provides a highly modular architecture, which even allows adding and removing functionality during runtime without stopping the service."
  },
  {
    "name": "Gobot",
    "url": "http://gobot.io/",
    "description": "Gobot is a framework for robotics, physical computing, and the Internet of Things, written in the Go programming language."
  },
  {
    "name": "Home Assistant",
    "url": "https://github.com/home-assistant/home-assistant",
    "description": "Home Assistant is a home automation platform running on Python 3. The goal of Home Assistant is to be able to track and control all devices at home and offer a platform for automating control."
  },
  {
    "name": "Lightweight MQTT Machine Network",
    "url": "http://lwmqn.github.io/",
    "description": "LWMQN is an open source project that follows part of OMA LWM2M v1.0 specification and uses the IP-base Smart Object model to meet the minimum requirements of machine network management. It provides both server-side and machine-side libraries to make full-stack IoT development possible with JavaScript and Node.js. See also: IPSO Alliance Technical Archive."
  },
  {
    "name": "Thingsboard IoT Gateway",
    "url": "https://github.com/thingsboard/thingsboard-gateway",
    "description": "Open-source IoT Gateway - integrates devices connected to legacy and third-party systems with Thingsboard IoT Platform using OPC-UA and MQTT protocols."
  },
  {
    "name": "Pimatic",
    "url": "https://pimatic.org/",
    "description": "Pimatic is a home automation framework that runs on node.js. It provides a common extensible platform for home control and automation tasks."
  },
  {
    "name": "IOTA",
    "url": "https://dev.iota.org/",
    "description": "Open-source distributed ledger protocol for IoT. Uses a directed acyclic graph (DAG) instead of a blockchain."
  },
  {
    "name": "Corlysis",
    "url": "https://corlysis.com/",
    "description": "Corlysis is a platform that helps you with storing and visualizing your time-series data. It is based on the open-source projects Grafana and InfluxDB that also SpaceX uses."
  },
  {
    "name": "IFTTT",
    "url": "https://ifttt.com/",
    "description": "IFTTT is a web-based service that allows users to create chains of simple conditional statements, called \"recipes\", which are triggered based on changes to other web services such as Gmail, Facebook, Instagram, and Pinterest. IFTTT is an abbreviation of \"If This Then That\" (pronounced like \"gift\" without the \"g\")."
  },
  {
    "name": "Huginn",
    "url": "https://github.com/cantino/huginn",
    "description": "Huginn is a system for building agents that perform automated tasks for you online."
  },
  {
    "name": "Kaa",
    "url": "http://www.kaaproject.org/",
    "description": "An open-source middleware platform for rapid creation of IoT solutions."
  },
  {
    "name": "Losant",
    "url": "https://losant.com",
    "description": "Losant is an easy-to-use and powerful developer platform designed to help you quickly and securely build complex connected solutions. Losant uses open communication standards like REST and MQTT to provide connectivity from one to millions of devices. Losant provides powerful data collection, aggregation, and visualization features to help understand and quantify vast amounts of sensor data. Losant's drag-and-drop workflow editor allows you to trigger actions, notifications, and machine-to-machine communication without programming."
  },
  {
    "name": "MicroServiceBus.com",
    "url": "https://microservicebus.com",
    "description": "MicroServiceBus.com is a device management platform for Azure, AWS and IBM IoT Hub, with integration to GitHub, ServiceNow, Cisco Jasper and more. It comes in a free (limited) version along with enterprise offerings."
  },
  {
    "name": "DreamFactory",
    "url": "http://www.dreamfactory.com",
    "description": "DreamFactory is a free open source REST API Platform for mobile, web and IoT Applications."
  },
  {
    "name": "I1820",
    "url": "https://i1820.github.io/",
    "description": "I1820 is a free open source platform which provides discovery, data collection and configuration services based on MQTT. I1820 implements a REST API for controlling the things and it stores all collected data in a Time-Series database named InfluxDB."
  },
  {
    "name": "IOStash",
    "url": "https://iostash.io",
    "description": "IOStash is a high performance IoT platform that is free for DIY developers and non profit applications. It has multiple connectivity options and enables easy development of M2M or M2A applications. IOStash offers Nodejs and Android libraries for easy application creation."
  },
  {
    "name": "Thingsboard",
    "url": "https://thingsboard.io",
    "description": "An open-source IoT platform. Device management, data collection, processing and visualization for your IoT solution."
  },
  {
    "name": "Kuzzle",
    "url": "https://github.com/kuzzleio/kuzzle",
    "description": "An open-source backend with advanced features like real-time pub/sub or geofencing and a multiprotocol interface that supports MQTT, LoRaWAN and more. (Website)"
  },
  {
    "name": "Cylon.js",
    "url": "http://cylonjs.com/",
    "description": "Cylon.js is a JavaScript framework for robotics, physical computing, and the Internet of Things. It makes it incredibly easy to command robots and devices."
  },
  {
    "name": "Luvit",
    "url": "https://luvit.io/",
    "description": "Luvit implements the same APIs as Node.js, but in Lua ! While this framework is not directly involved with IoT development, it is still a great way to rapidly build powerful, yet memory efficient, embedded web applications."
  },
  {
    "name": "Johnny-Five",
    "url": "http://johnny-five.io/",
    "description": "Johnny-Five is the original JavaScript Robotics programming framework. Released by Bocoup in 2012, Johnny-Five is maintained by a community of passionate software developers and hardware engineers."
  },
  {
    "name": "Pi4J",
    "url": "http://pi4j.com/",
    "description": "Pi4j is intended to provide a friendly object-oriented I/O API and implementation libraries for Java Programmers to access the full I/O capabilities of the Raspberry Pi platform."
  },
  {
    "name": "WiringPi",
    "url": "http://wiringpi.com/",
    "description": "WiringPi is a GPIO access library written in C for the BCM2835 used in the Raspberry Pi."
  },
  {
    "name": "Node-RED",
    "url": "http://nodered.org/",
    "description": "A visual tool for wiring the Internet of Things."
  },
  {
    "name": "SmartObject",
    "url": "https://github.com/PeterEB/smartobject",
    "description": "A Smart Object Class that helps you with creating IPSO Smart Objects in your JavaScript applications. See also: IPSO Alliance Technical Archive."
  },
  {
    "name": "Amazon Dash",
    "url": "https://fresh.amazon.com/dash/",
    "description": "Amazon Dash Button is a Wi-Fi connected device that reorders your favorite item with the press of a button."
  },
  {
    "name": "Freeboard",
    "url": "http://freeboard.io/",
    "description": "A real-time interactive dashboard and visualization creator implementing an intuitive drag & drop interface."
  },
  {
    "name": "Nebula",
    "url": "http://nebula.readthedocs.io",
    "description": " A docker orchestrator designed to manage IoT devices"
  },
  {
    "name": "ETSI M2M",
    "url": "http://www.etsi.org/technologies-clusters/technologies/m2m",
    "description": "The ETSI Technical Committee is developing standards for Machine to Machine Communications."
  },
  {
    "name": "OneM2M",
    "url": "http://www.onem2m.org/",
    "description": "The purpose and goal of oneM2M is to develop technical specifications which address the need for a common M2M Service Layer that can be readily embedded within various hardware and software, and relied upon to connect the myriad of devices in the field with M2M application servers worldwide."
  },
  {
    "name": "OPCUA",
    "url": "https://opcfoundation.org/",
    "description": "OPC Unified Architecture (OPC UA) is an industrial M2M communication protocol for interoperability developed by the OPC Foundation."
  },
  {
    "name": "OCF",
    "url": "https://openconnectivity.org/",
    "description": "OCF, The Open Connectivity Foundation, develop standards and certification for devices involved in the Internet of Things (IoT) based around Constrained Application Protocol (CoAP)."
  },
  {
    "name": "AIOTI",
    "url": "http://www.meet-iot.eu/Alliance-for-Internet-of-Things-Innovation-AIOTI.html",
    "description": "The Internet of Things Innovation (AIOTI) aims to strengthen links and build new relationships between the different IoT players (industries, SMEs, startups) and sectors."
  },
  {
    "name": "AllSeen Alliance",
    "url": "https://allseenalliance.org/",
    "description": "The AllSeen Alliance is a nonprofit consortium dedicated to enabling and driving the widespread adoption of products, systems and services that support the Internet of Everything with an open, universal development framework supported by a vibrant ecosystem and thriving technical community."
  },
  {
    "name": "Bluetooth Special Interest Group",
    "url": "https://www.bluetooth.com/",
    "description": "The Bluetooth Special Interest Group (SIG) is the body that oversees the development of Bluetooth standards and the licensing of the Bluetooth technologies and trademarks to manufacturers."
  },
  {
    "name": "IPSO Alliance",
    "url": "http://www.ipso-alliance.org/",
    "description": "The IPSO Alliance provides a foundation for industry growth by fostering awareness, providing education, promoting the industry, generating research, and creating a better understanding of IP and its role in the Internet of Things."
  },
  {
    "name": "LoRa Alliance",
    "url": "https://www.lora-alliance.org/",
    "description": "The LoRa Alliance is an open, non-profit association of members that believes the internet of things era is now. It was initiated by industry leaders with a mission to standardize Low Power Wide Area Networks (LPWAN) being deployed around the world to enable Internet of Things (IoT), machine-to-machine (M2M), and smart city, and industrial applications."
  },
  {
    "name": "OPC Foundation",
    "url": "https://opcfoundation.org/about/opc-foundation/mission-statement/",
    "description": "The mission of the OPC Foundation is to manage a global organization in which users, vendors and consortia collaborate to create data transfer standards for multi-vendor, multi-platform, secure and reliable interoperability in industrial automation. To support this mission, the OPC Foundation"
  },
  {
    "name": "Thread Group",
    "url": "http://threadgroup.org/",
    "description": "The Thread Group, composed of members from Nest, Samsung, ARM, Freescale, Silicon Labs, Big Ass Fans and Yale, drives the development of the Thread network protocol."
  },
  {
    "name": "Wi-Fi Alliance",
    "url": "https://www.wi-fi.org/",
    "description": "Wi-Fi Alliance® is a worldwide network of companies composed of several companies forming a global non-profit association with the goal of driving the best user experience with a new wireless networking technology – regardless of brand."
  },
  {
    "name": "Zigbee Alliance",
    "url": "http://www.zigbee.org/",
    "description": "The ZigBee Alliance is an open, non-profit association of approximately 450 members driving development of innovative, reliable and easy-to-use ZigBee standards."
  },
  {
    "name": "Z-Wave Alliance",
    "url": "http://z-wavealliance.org/",
    "description": "Established in 2005, the Z-Wave Alliance is comprised of industry leaders throughout the globe that are dedicated to the development and extension of Z-Wave as the key enabling technology for 'smart' home and business applications."
  },
  {
    "name": "A Simple Explanation Of 'The Internet Of Things' (Forbes)",
    "url": "http://www.forbes.com/sites/jacobmorgan/2014/05/13/simple-explanation-internet-things-that-anyone-can-understand/",
    "description": "This article attemps to give an answer to what exactly is the “Internet of things” and what impact it is going to have on us."
  },
  {
    "name": "IoT security. Is there an app for that ?",
    "url": "http://embedded-computing.com/21517-iot-security-is-there-an-app-for-that/",
    "description": "The Internet of Things World conference investigates IoT application development, security, and business models."
  },
  {
    "name": "The IoT Testing Atlas",
    "url": "http://iamqa.in/2015/10/04/The-IoT-Testing-Atlas/",
    "description": "A testing methodology for managing the permutations of parameters while testing an IoT based product."
  },
  {
    "name": "A Reference Architecture for the Internet of Things",
    "url": "http://wso2.com/wso2_resources/wso2_whitepaper_a-reference-architecture-for-the-internet-of-things.pdf",
    "description": "This white paper introduces a Reference Architecture for the Internet of Things (IoT): this includes the devices as well as the server-side and cloud architecture required to interact with and manage the devices."
  },
  {
    "name": "Developing solutions for the Internet of Things",
    "url": "https://www-ssl.intel.com/content/dam/www/public/us/en/documents/white-papers/developing-solutions-for-iot.pdf",
    "description": "Intel's vision in enabling secure and seamless solutions for the Internet of Things (IoT)."
  },
  {
    "name": "Evaluation of indoor positioning based on Bluetooth Smart technology",
    "url": "http://publications.lib.chalmers.se/records/fulltext/199826/199826.pdf",
    "description": "Master of Science Thesis in the Programme Computer Systems and Networks."
  },
  {
    "name": "IoT: A Vision, Architectural Elements, and Future Directions",
    "url": "http://arxiv.org/pdf/1207.0203.pdf",
    "description": "This paper presents a cloud centric vision for worldwide implementation of Internet of Things. The key enabling technologies and application domains that are likely to drive IoT research in the near future are discussed."
  },
  {
    "name": "Realizing the Potential of the Internet of Things",
    "url": "https://www.tiaonline.org/sites/default/files/pages/TIA-White-Paper-Realizing_the_Potential_of_the_Internet_of_Things.pdf",
    "description": "A white paper from the Telecommunications Industry Association (TIA) written in the form of a set of recommendations to policy maker on leveraging and realizing the potential of the Internet of Things market."
  },
  {
    "name": "The Internet of Things: Evolution or Revolution ?",
    "url": "http://www.aig.com/Chartis/internet/US/en/AIG%20White%20Paper%20-%20IoT%20English%20DIGITAL_tcm3171-677828_tcm3171-698578.pdf",
    "description": "This white paper compares the current Internet of Things market rise to other industrial revolutions, the challenges it introduces, as well as its consequences on our daily lives."
  }
]
