[
  {
    "name": "An experiment to assess the cost-benefits of code inspections in large scale software development (Porter, Siy, Toman & Votta, 1997) Early paper that tested a range of then-current review techniques including multi-stage review and code-review-via-meeting that found you can get most of the benefit in an offline, single pass, with two reviewers.",
    "url": "http://laser.cs.umass.edu/courses/cs521-621.Fall10/documents/PorterSiyetal.pdf"
  },
  {
    "name": "Anywhere, anytime code inspections: using the Web to remove inspection bottlenecks in large-scale software development (Perpich, Perry, Porter, Votta & Wade, 1997) One day in the far future the best way to review code will be on the world wide web.",
    "url": "https://dl.acm.org/citation.cfm?id=253234"
  },
  {
    "name": "Characteristics of Useful Code Reviews: An Empirical Study at Microsoft (Bosu, Greiler, Bird, 2015) This paper reports the findings of a large scale qualitative and quantitative study focusing on understanding which code review comments are considered useful by developers.",
    "url": "https://www.michaelagreiler.com/wp-content/uploads/2019/02/Characteristics-Of-Useful-Comments.pdf"
  },
  {
    "name": "Code Reviewing in the Trenches: Understanding Challenges, Best Practices, and Tool Needs (MacLeod, Greiler, Storey, Bird, Czerwonka, 2018) A large scale study of over 900 Microsoft developers to understand their code review processes, their motivations to do code reviews, and which pitfalls and best practices they encounter.",
    "url": "https://www.michaelagreiler.com/wp-content/uploads/2019/03/Code-Reviewing-in-the-Trenches-Understanding-Challenges-Best-Practices-and-Tool-Needs.pdf"
  },
  {
    "name": "Design and Code Inspections to Reduce Errors in Program Development (Fagan, 2002) Using a more formal process, particularly with defined roles for each participant and drive a big increase in error detection during review.",
    "url": "https://link.springer.com/chapter/10.1007/978-3-642-59412-0_35"
  },
  {
    "name": "Helping Developers Help Themselves: Automatic Decomposition of Code Review Changes (Barnett et al. 2015) (summary on the morning paper) Research into automatically splitting big diffs into smaller diffs leading to better reviews.",
    "url": "http://research.microsoft.com/pubs/238937/barnett2015hdh.pdf"
  },
  {
    "name": "Modern Code Review: A Case Study at Google A study that shows how code reviews work at Google.",
    "url": "https://sback.it/publications/icse2018seip.pdf"
  },
  {
    "name": "Work Practices and Challenges in Pull-Based Development (Gousios et al. 2015) (summary on the morning paper) Field study of how GitHub pull requests are used in the wild.",
    "url": "https://sback.it/publications/icse2016b.pdf"
  },
  {
    "name": "8 Tips for Great Code Reviews A few basic rules for a better code review process.",
    "url": "https://kellysutton.com/2018/10/08/8-tips-for-great-code-reviews.html"
  },
  {
    "name": "A Better Code Review Decent set of patterns and anti-patterns for code reviews.",
    "url": "https://www.giladpeleg.com/blog/better-code-review/"
  },
  {
    "name": "A Zen Manifesto for Effective Code Reviews Practical tips for the submitter and the reviewer to make effective code reviews.",
    "url": "https://medium.freecodecamp.org/a-zen-manifesto-for-effective-code-reviews-e30b5c95204a"
  },
  {
    "name": "Brian Guthrie's Feature Branching Rant Twitter thread on the pros and cons of GitHub's open source first model with regards to \"in-company\" code review practice.",
    "url": "https://twitter.com/bguthrie/status/937750796334174209"
  },
  {
    "name": "Building an Inclusive Code Review Culture Guidelines to help ensure a collaborative and learning culture",
    "url": "https://blog.plaid.com/building-an-inclusive-code-review-culture/"
  },
  {
    "name": "Code Review: Create The Culture, Learn The Best Practices Code review tips and best practices from tech leaders.",
    "url": "https://codingsans.com/blog/code-review"
  },
  {
    "name": "Code Review Etiquette A few tips helping with positive engagement on code review.",
    "url": "https://css-tricks.com/code-review-etiquette/"
  },
  {
    "name": "Code Review Guidelines for Humans Some guidelines for giving and getting code reviews.",
    "url": "https://phauer.com/2018/code-review-guidelines/"
  },
  {
    "name": "Code Reviews: Just Do It Seminal post advocating for peer review of software back in 2006.",
    "url": "https://blog.codinghorror.com/code-reviews-just-do-it/"
  },
  {
    "name": "Code Reviews at Google are lightweight and fast Details on how code review best practices and processes work at Google.",
    "url": "https://www.michaelagreiler.com/code-reviews-at-google/"
  },
  {
    "name": "Code Review Review is the Manager's Job Why management should ensure code review is done and done well.",
    "url": "https://hecate.co/blog/code-review-review-is-the-managers-job"
  },
  {
    "name": "Comments During Code Reviews Writing good comments during code reviews.",
    "url": "https://medium.com/@otarutunde/comments-during-code-reviews-2cb7791e1ac7"
  },
  {
    "name": "Designing Awesome Code Reviews Principles for actively designing a code review process.",
    "url": "https://medium.com/unpacking-trunk-club/designing-awesome-code-reviews-5a0d9cd867e3"
  },
  {
    "name": "Effective Code Reviews Without the Pain Another 2006 classic on how to effectively perform a code review.",
    "url": "https://www.developer.com/tech/article.php/3579756/Effective-Code-Reviews-Without-the-Pain.htm"
  },
  {
    "name": "Feedback Ladders: How We Encode Code Reviews at Netlify Helpful framwork for reviewers to classify how actionable specific pieces of review feedback are.",
    "url": "https://www.netlify.com/blog/2020/03/05/feedback-ladders-how-we-encode-code-reviews-at-netlify/"
  },
  {
    "name": "How Code Reviews work at Microsoft A in-depth analysis on how the code review process looks like at Microsoft.",
    "url": "https://www.michaelagreiler.com/code-reviews-at-microsoft-how-to-code-review-at-a-large-software-company/"
  },
  {
    "name": "How I review code More personal advice on how to best review a pull request from an engineer at Tumblr.",
    "url": "https://engineering.tumblr.com/post/170040992289/how-i-review-code"
  },
  {
    "name": "How to do a code review A thorough description of how Google engineers do code reviews, from the Google's Engineering Practices documentation.",
    "url": "https://google.github.io/eng-practices/review/reviewer/"
  },
  {
    "name": "How to Do Code Reviews Like a Human Techniques that treat the code review as not only a technical process but a social one as well.",
    "url": "https://mtlynch.io/human-code-reviews-1/"
  },
  {
    "name": "On Code Review Short article about tooling and personal elements of code review, from an ex-Facebook engineer.",
    "url": "https://medium.com/@schrockn/on-code-reviews-b1c7c94d868c"
  },
  {
    "name": "Pull Requests: How to Get and Give Good Feedback Advice for both sides of the code review process, the reviewer and the reviewee.",
    "url": "https://kickstarter.engineering/pull-requests-how-to-get-and-give-good-feedback-f573469f0c44"
  },
  {
    "name": "Ship Small Diffs Why it's better to review small changes rather than large ones.",
    "url": "https://blog.skyliner.io/ship-small-diffs-741308bec0d1"
  },
  {
    "name": "Stacked Pull Requests: Keeping GitHub Diffs Small A step-by-step process to split big PRs and increase review engagement.",
    "url": "https://graysonkoonce.com/stacked-pull-requests-keeping-github-diffs-small/"
  },
  {
    "name": "The Art of Humanizing Pull Requests Emoji rich guide to the human side of code review via pull requests.",
    "url": "https://blog.usejournal.com/the-art-of-humanizing-pull-requests-prs-b520588eb345"
  },
  {
    "name": "Towards Productive Technical Discussions Tactical questions and actions to push code review discussions into a more productive territory.",
    "url": "https://cate.blog/2018/07/03/towards-productive-technical-discussions/"
  },
  {
    "name": "Unlearning Toxic Behaviors in a Code Review Culture A how-to guide for pull requests via how-not-too.",
    "url": "https://medium.com/@sandya.sankarram/unlearning-toxic-behaviors-in-a-code-review-culture-b7c295452a3c"
  },
  {
    "name": "Why I changed the way I think about Code Quality Why code quality is about more than just the code.",
    "url": "https://medium.freecodecamp.org/why-i-changed-the-way-i-think-about-code-quality-88c5d8d57e68"
  },
  {
    "name": "Best Kept Secrets of Peer Code Review Older compilation of 10 essays on the practice of code reviews. Some repetition due to different authors covering the same territory.",
    "url": "https://www.goodreads.com/book/show/1563457.Best_Kept_Secrets_of_Peer_Code_Review"
  },
  {
    "name": "Handbook of Walkthroughs, Inspections, and Technical Reviews Older book covering more formal walkthroughs but covers politics and group dynamics in review well.",
    "url": "https://www.amazon.com/Handbook-Walkthroughs-Inspections-Technical-Reviews/dp/0932633196"
  },
  {
    "name": "Peer Reviews in Software: A Practical Guide A practical guide to formal code inspections as a code review practice.",
    "url": "https://www.amazon.com/Peer-Reviews-Software-Practical-Guide/dp/0201734850"
  },
  {
    "name": "Software Inspection: An Industry Best Practice Compendium of papers on code review practice.",
    "url": "https://www.amazon.com/Software-Inspection-Industry-Best-Practice/dp/0818673400"
  },
  {
    "name": "Ultimate Guide to Code Reviews Codacy sponsored ebook of code review practices based on developer survey.",
    "url": "https://www.codacy.com/ebooks/guide-to-code-reviews"
  },
  {
    "name": "What to Look for in a Code Review JetBrains sponsored ebook of how to spot coding anti-patterns during review.",
    "url": "https://leanpub.com/whattolookforinacodereview"
  },
  {
    "name": "Code Reviews: Honesty, Kindness, Inspiration: Pick Three",
    "url": "http://confreaks.tv/videos/rubyconf2017-code-reviews-honesty-kindness-inspiration-pick-three",
    "description": "Jacob Stoebel RubyConf 2017 How to do effective code review while remaining kind to the original author."
  },
  {
    "name": "Goldilocks and the Three Code Reviews",
    "url": "https://confreaks.tv/videos/reddotrubyconf2017-goldilocks-and-the-three-code-reviews",
    "description": "Vaidehi Joshi RedDot Ruby Conf 2017 Finding just the right amount of code review by focussing on what is affecting."
  },
  {
    "name": "Implementing a Strong Code-Review Culture",
    "url": "https://www.youtube.com/watch?v=PJjmw9TRB7s",
    "description": "Derek Prior Railsconf 2015 How to instill a healthy code review culture in a team."
  },
  {
    "name": "Michaela Greiler on Code Reviews",
    "url": "https://www.se-radio.net/2020/02/episode-400-michaela-greiler-on-code-reviews/",
    "description": "SE Radio 2020 Michaela Greiler discusses the importance of code reviews and how to conduct them on the Software Engineering Radio podcast."
  },
  {
    "name": "Crucible Atlassian's on-premise code review tool.",
    "url": "https://www.atlassian.com/software/crucible"
  },
  {
    "name": "Gerrit Open source git code review tool originating out of Google.",
    "url": "https://www.gerritcodereview.com/"
  },
  {
    "name": "GitHub Git hosting and pioneer of the \"Pull Request\".",
    "url": "https://github.com"
  },
  {
    "name": "Gitpod Code review pull requests in a full IDE within your browser.",
    "url": "https://gitpod.io"
  },
  {
    "name": "GitRise Slack Reminders for GitHub pull requests",
    "url": "https://www.gitrise.com/"
  },
  {
    "name": "LGTM Automated Git code review for GitHub and Bitbucket pull requests for finding security vulnerabilities and code quality issues.",
    "url": "https://lgtm.com"
  },
  {
    "name": "Phabricator Open source git/mercurial/svn code review tool originating out of Facebook.",
    "url": "https://www.phacility.com/phabricator/"
  },
  {
    "name": "PullRequest Code review as a service for GitHub pull requests.",
    "url": "https://www.pullrequest.com/"
  },
  {
    "name": "Pull Reminders Automated Slack reminders and metrics for GitHub pull requests.",
    "url": "https://pullreminders.com"
  },
  {
    "name": "Reviewable Code review tool built on top of GitHub pull requests.",
    "url": "https://reviewable.io/"
  },
  {
    "name": "Review Board Open source review tool that is SCM/platform neutral.",
    "url": "https://www.reviewboard.org/"
  },
  {
    "name": "Rubberduck Browser extension to adds code-aware navigation to GitHub pull requests.",
    "url": "https://www.rubberduck.io"
  },
  {
    "name": "Sider Automated code review service for GitHub.",
    "url": "https://sider.review/"
  },
  {
    "name": "Softagram Automated code change visualization (and dependency analytics) for pull requests, merge requests (GitLab) and patch sets (Gerrit).",
    "url": "https://softagram.com/"
  },
  {
    "name": "SonarCloud Detect code smells, bugs and vulnerabilities in Azure DevOps, Bitbucket and GitHub repositories.",
    "url": "https://sonarcloud.io"
  },
  {
    "name": "Upsource JetBrain's on-premise git/mercurial/perforce/svn code review tool.",
    "url": "https://www.jetbrains.com/upsource/"
  }
]
