[
  {
    "name": "12+ Tips and Tricks to Work Faster in Microsoft Outlook – Tame your Outlook with these tips in order to get a little bit closer to the awesome Inbox Zero.",
    "url": "http://lifehacker.com/12-tips-and-tricks-to-work-faster-in-microsoft-outlook-1540483009"
  },
  {
    "name": "Advanced GTD with Remember The Milk – A tutorial on how to implement GTD with Remember the Milk.",
    "url": "http://blog.rememberthemilk.com/post/116665489183/guest-post-advanced-gtd-with-remember-the-milk"
  },
  {
    "name": "Inbox Zero – Rigorous approach to email management aimed at keeping the inbox (almost) empty at all times.",
    "url": "http://www.43folders.com/izero"
  },
  {
    "name": "Lifehacker – The go-to blog for tips, tricks, and downloads for getting things done.",
    "url": "http://lifehacker.com/"
  },
  {
    "name": "Pomodoro Technique – Slice your tasks in 25 minute packages and get more done in less time.",
    "url": "http://pomodorotechnique.com/"
  },
  {
    "name": "r/Productivity – Productivity subreddit.",
    "url": "https://www.reddit.com/r/productivity/"
  },
  {
    "name": "Rid Your Desktop of Clutter with This Simple Trio of Icons – A little trick that has been keeping my desktop clean for years now.",
    "url": "http://lifehacker.com/5901487/rid-your-desktop-of-clutter-with-this-simple-trio-of-icons"
  },
  {
    "name": "ShortLib – Collection of hundreds of shortcuts for Windows, Mac and Linux.",
    "url": "https://shortlib.netlify.app/"
  },
  {
    "name": "The Bullet Journal – A pen and paper method that turns a simple notebook into a highly efficient productivity tool.",
    "url": "http://bulletjournal.com/"
  },
  {
    "name": "Zen Habits – Blog by Leo Babauta with topics such as simplifying life.",
    "url": "https://zenhabits.net/"
  },
  {
    "name": "Deep Work: Rules for Focused Success in a Distracted World by Cal Newport – Deep work is the ability to focus without distraction on a cognitively demanding task.",
    "url": "https://www.calnewport.com/books/deep-work/"
  },
  {
    "name": "Getting Things Done by David Allen – A very simple and efficient time-management method.",
    "url": "https://gettingthingsdone.com/store/product.php?productid=17035&cat=3&page"
  },
  {
    "name": "The 5 Choices by Kory Kogon, Adam Merrill, Leena Rinne – An all around productivity methodology dealing with prioritization, scheduling, technology and energy management.",
    "url": "http://books.simonandschuster.ca/The-5-Choices/Kory-Kogon/9781476711713"
  },
  {
    "name": "Box – Very good cloud storage solution for business customers.",
    "url": "https://www.box.com"
  },
  {
    "name": "Dropbox – Simple, elegant and versatile (PC, Macs, Android...) cloud storage solution.",
    "url": "https://www.dropbox.com"
  },
  {
    "name": "Google Drive – Cloud storage solution deeply integrated in the Google ecosystem.",
    "url": "https://www.google.ca/drive/"
  },
  {
    "name": "OneDrive – Best cloud storage solution for Windows users.",
    "url": "https://onedrive.live.com"
  },
  {
    "name": "Mega – A very generous (50G from the get go) and highly secure cloud storage solution.",
    "url": "https://mega.nz/"
  },
  {
    "name": "Nextcloud – The self-hosted productivity platform that keeps you in control.",
    "url": "https://nextcloud.com"
  },
  {
    "name": "Evernote – Evernote can basically become your second brain and remember everything for you.",
    "url": "https://evernote.com/"
  },
  {
    "name": "Google Keep – A nice and simple Note management system tightly integrated with Google products.",
    "url": "http://www.google.com/keep/"
  },
  {
    "name": "Inkdrop – A cross-platform note taking app for Markdown lovers.",
    "url": "https://www.inkdrop.info/"
  },
  {
    "name": "Joplin – A note taking and to-do application with synchronization capabilities.",
    "url": "https://joplinapp.org/"
  },
  {
    "name": "Notion – An all-in-one very customizable workspace for notes, tasks, wikis and lists.",
    "url": "https://www.notion.so/"
  },
  {
    "name": "OneNote – Very good Note management solution, but best for Windows users.",
    "url": "https://www.onenote.com/"
  },
  {
    "name": "Preserver – Notes organizer desktop app based on Electron.",
    "url": "https://github.com/hsbalar/preserver"
  },
  {
    "name": "Simplenote – Light, clean, and free. Simplenote is now available for iOS, Android, Mac, Windows, Linux, and the web.",
    "url": "https://simplenote.com/"
  },
  {
    "name": "Standard Notes – A simple and private notes app.",
    "url": "https://standardnotes.org/"
  },
  {
    "name": "WorkFlowy – Web-based outlining application for nested bulletin lists.",
    "url": "https://workflowy.com/"
  },
  {
    "name": "Airtable – Mix of spreadsheet and database to help organize work.",
    "url": "https://airtable.com/"
  },
  {
    "name": "Amazing Marvin – Marvin incorporates principles from behavioral psychology to help beat procrastination, feel in control and finish todo list.",
    "url": "https://www.amazingmarvin.com/"
  },
  {
    "name": "Any.do – Simple interface, packed with features, currently the favorite to-do list manager at Lifehacker.",
    "url": "http://www.any.do/"
  },
  {
    "name": "GitHub Projects – A lesser known feature of GitHub, makes it easy to tie your project management process to your code.",
    "url": "https://github.com/features/project-management/"
  },
  {
    "name": "Hitask – Easy Project and Task Management for Teams.",
    "url": "https://hitask.com"
  },
  {
    "name": "KanbanFlow – Kanban method task board with Pomodoro technique.",
    "url": "https://kanbanflow.com"
  },
  {
    "name": "Microsoft To Do – Microsoft cloud-based task management application based on Wunderlist technology.",
    "url": "https://todo.microsoft.com/tasks/"
  },
  {
    "name": "OmniFocus – A Getting Things Done based task manager for Mac OS X and iOS.",
    "url": "https://www.omnigroup.com/omnifocus"
  },
  {
    "name": "Pomolectron – A pomodoro app for your menubar/tray.",
    "url": "https://github.com/amitmerchant1990/pomolectron"
  },
  {
    "name": "Remember the Milk – Great at managing tags for to-dos and location based tasks.",
    "url": "https://www.rememberthemilk.com"
  },
  {
    "name": "Taskade – Simple and collaborative task lists for teams.",
    "url": "https://taskade.com"
  },
  {
    "name": "Taskwarrior – An open source command line task manager. Flexible, fast, efficient, and unobtrusive.",
    "url": "http://taskwarrior.org/"
  },
  {
    "name": "Timing – Automatic time and productivity tracking for Mac. Helps you stay on track with your work and ensures no billable hours get lost if you are billing hourly.",
    "url": "https://timingapp.com/"
  },
  {
    "name": "Tinido – A beautiful and simple task management app that can also give you insights by showing your completed tasks in a contribution graph similar to the one you find on your GitHub profile.",
    "url": "https://tinido.com/"
  },
  {
    "name": "Todo.txt – Tired of having complicated apps to organize your tasks? Todo.txt is a technique that uses a single .txt file to help you get the job done.",
    "url": "http://todotxt.com/"
  },
  {
    "name": "Todoist – Powerful and cross-platform productivity tool.",
    "url": "https://todoist.com/"
  },
  {
    "name": "Topydo – A powerful todo list application using the todo.txt format, positioned between todo.txt CLI and Taskwarrior.",
    "url": "https://github.com/topydo/topydo"
  },
  {
    "name": "Trello – Kanban method task board.",
    "url": "https://trello.com"
  },
  {
    "name": "VivifyScrum – Agile project management app for teams that deliver. Customizable Scrum and Kanban boards.",
    "url": "https://www.vivifyscrum.com"
  },
  {
    "name": "Everyday – Form new habits by doing things every day.",
    "url": "https://everyday.app/"
  },
  {
    "name": "Habitica – Complete your real life daily goals in a role play game (previously called HabitRPG).",
    "url": "https://habitica.com"
  },
  {
    "name": "HabitBull – Premium habit tracker.",
    "url": "http://www.habitbull.com/"
  },
  {
    "name": "Loop Habit Tracker – An Android app for creating and maintaining good habits.",
    "url": "https://github.com/iSoron/uhabits"
  },
  {
    "name": "Waka Time –  Open source plugin for knowing exactly how long you spend coding.",
    "url": "https://wakatime.com/"
  },
  {
    "name": "AutoIt – Small tool for Windows to automate the Windows GUI, but it can also be used for other purposes.",
    "url": "https://www.autoitscript.com/"
  },
  {
    "name": "Awesome AutoHotKey – AutoHotKey is a free, open-source macro-creation and automation software for Windows that allows users to automate repetitive tasks.",
    "url": "https://github.com/ahkscript/awesome-AutoHotkey"
  },
  {
    "name": "IFTTT – Allows you to create chains of conditional statements (called recipes) between web services in order to make the web work for you and boost your productivity.",
    "url": "https://ifttt.com"
  },
  {
    "name": "Qbserve – Mac time tracking automation: freelance project tracking, timesheets, invoicing & real-time productivity feedback.",
    "url": "https://qotoqot.com/qbserve/"
  },
  {
    "name": "Tasker – Android application that can perform context sensitive custom tasks (e.g. automatically turn on wifi when you arrive home).",
    "url": "http://tasker.dinglisch.net/"
  },
  {
    "name": "Zapier – Automation tool that allows you to connect hundreds of web services and create automations between the processes.",
    "url": "https://zapier.com/"
  },
  {
    "name": "LastPass – A freemium password manager that stores encrypted passwords online.",
    "url": "https://lastpass.com"
  },
  {
    "name": "Obie.ai – AI platform that brings all knowledge and documentation into one spot.",
    "url": "https://obie.ai/"
  },
  {
    "name": "ShareX – Screen capture, file sharing and productivity tool.",
    "url": "https://getsharex.com/"
  }
]
