[
  {
    "name": "To Get Good, Go After The Metagame",
    "url": "https://commoncog.com/blog/to-get-good-go-after-the-metagame/",
    "description": "“Every sufficiently interesting game has a metagame above it. This is the game about the game. It is often called 'the meta'. (…) The meta is what you get after you master boring fundamentals. But observing the state of the current meta often reveals what boring fundamentals you need to learn.”"
  },
  {
    "name": "How to Read a Paper",
    "url": "http://blizzard.cs.uwaterloo.ca/keshav/home/Papers/data/07/paper-reading.pdf",
    "description": "Outlines a practical and efficient three-pass method for reading research papers."
  },
  {
    "name": "Good sleep, good learning, good life",
    "url": "https://supermemo.guru/wiki/Good_sleep,_good_learning,_good_life",
    "description": "An e-book-sized synthesis on sleep research “with a view to practical applications, esp. in people who need top-quality sleep for their learning or creative achievements.”"
  },
  {
    "name": "Should we take a few long holidays, or lots of short ones?",
    "url": "http://timharford.com/2019/09/should-we-take-a-few-long-holidays-or-lots-of-short-ones/",
    "description": "Short ones. “Reason one: holiday memories tend to depend not on how long the holiday was, but on the intensity of the experiences. Reason two: a change of activity can be a spur to creativity. Reason three for taking a short break: if we need rest to prevent exhaustion, a single, long vacation won't do the trick.”"
  },
  {
    "name": "Normalization of deviance",
    "url": "https://danluu.com/wat/",
    "description": "Explores how the factors accounting for disasters accumulates unnoticed until it's too late. This has been studied on other fields, but not in software engineering."
  },
  {
    "name": "“Something I've seen multiple times is that, when a VP leaves, a company will become a substantially worse place to work, and it will slowly dawn on people that the VP was doing an amazing job at supporting not only their direct reports, but making sure that everyone under them was having a good time.” (source)",
    "url": "https://danluu.com/wat/#fn:P"
  }
]
