[
  {
    "name": "AWStats",
    "url": "http://www.awstats.org/",
    "description": "Generates web, streaming, ftp or mail server statistics graphically. (Source Code) GPL-3.0 Perl"
  },
  {
    "name": "Countly",
    "url": "https://count.ly",
    "description": "Real time mobile and web analytics, crash reporting and push notifications platform. (Source Code) AGPL-3.0 Javascript"
  },
  {
    "name": "Druid",
    "url": "http://druid.io/",
    "description": "Distributed, column-oriented, real-time analytics data store. (Source Code) Apache-2.0 Java"
  },
  {
    "name": "Fathom Analytics",
    "url": "https://usefathom.com",
    "description": "Simple & trustworthy website analytics. (Source Code) MIT Go"
  },
  {
    "name": "GoAccess",
    "url": "http://goaccess.io/",
    "description": "Real-time web log analyzer and interactive viewer that runs in a terminal. (Source Code) GPL-2.0 C"
  },
  {
    "name": "Hastic",
    "url": "https://hastic.io",
    "description": "Hackable time series pattern recognition tool with UI for Grafana. (Source Code) Apache-2.0 Python/Nodejs"
  },
  {
    "name": "Matomo",
    "url": "https://matomo.org/",
    "description": "Leading open-source analytics platform that gives you more than just powerful analytics, formerly known as Piwik. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Open Web Analytics",
    "url": "http://www.openwebanalytics.com/",
    "description": "Google Analytics and Piwik alternative. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Rakam",
    "url": "https://rakam.io/",
    "description": "Custom analytics platform that allows you to create your own analytics services. Integrate with any data source (web, mobile, IoT etc.), analyze data with SQL and create dashboards. (Source Code) Apache-2.0 Java"
  },
  {
    "name": "Serposcope",
    "url": "https://serposcope.serphacker.com/",
    "description": "Serposcope is a free and open-source rank tracker to monitor websites ranking in Google and improve your SEO performances. (Source Code) MIT Java"
  },
  {
    "name": "Snowplow",
    "url": "http://snowplowanalytics.com/",
    "description": "Have every single event, from your websites, mobile apps, desktop applications and server-side systems, stored in your own data warehouse and available to action in real-time. (Source Code) Apache-2.0 Scala"
  },
  {
    "name": "Suet ⚠",
    "url": "https://suet.co/",
    "description": "Detailed analytics and reporting for your Mailgun transactional emails. (Source Code) GPL-3.0 Nodejs"
  },
  {
    "name": "Metabase",
    "url": "http://www.metabase.com/",
    "description": "Simple Dashboarding and GUI Query tool, Nightly Emails and Slack Integration w/ PostgreSQL, MySQL, Redshift and other DBs. (Source Code) AGPL-3.0 Clojure"
  },
  {
    "name": "Redash",
    "url": "http://redash.io",
    "description": "connect to over 18 types of databases (SQL and \"NoSQL\"), query your data, visualize it and create dashboards. Everything has a URL that can be shared. Slack and HipChat integration. (Demo, Source Code) BSD-2-Clause Python"
  },
  {
    "name": "Superset",
    "url": "http://superset.apache.org/",
    "description": "Modern, enterprise-ready business intelligence web application. (Source Code) Apache-2.0 Python"
  },
  {
    "name": "Access to Memory (AtoM)",
    "url": "https://www.accesstomemory.org/",
    "description": "Web-based, open source application for standards-based archival description and access in a multilingual, multi-repository environment. (Demo, Source Code) PHP AGPL-3.0-only"
  },
  {
    "name": "Archivematica",
    "url": "https://www.archivematica.org/",
    "description": "Mature digital preservation system designed to maintain standards-based, long-term access to collections of digital objects. (Demo, Source Code) Python AGPL-3.0-only"
  },
  {
    "name": "ArchivesSpace",
    "url": "https://archivesspace.org/",
    "description": "Archives information management application for managing and providing Web access to archives, manuscripts and digital objects. (Demo, Source Code) Ruby ECL-2.0"
  },
  {
    "name": "Collective Access: Providence",
    "url": "http://collectiveaccess.org/",
    "description": "Highly configurable Web-based framework for management, description, and discovery of digital and physical collections supporting a variety of metadata standards, data types, and media formats. (Source Code) PHP GPL-3.0-only"
  },
  {
    "name": "Alltube",
    "url": "http://www.alltubedownload.net",
    "description": "Web interface for youtube-dl, a program to download videos and audio from more than 100 websites. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "AmIUnique",
    "url": "https://amiunique.org/",
    "description": "Learn how identifiable you are on the Internet (browser fingerprinting tool). (Source Code) MIT Java"
  },
  {
    "name": "Beehive",
    "url": "https://github.com/muesli/beehive",
    "description": "Flexible event and agent system, which allows you to create your own agents that perform automated tasks triggered by events and filters. AGPL-3.0 Go"
  },
  {
    "name": "CampaignChain ⚠",
    "url": "https://www.campaignchain.com/",
    "description": "A marketing hub allowing to schedule posts on social media (a la Hootsuite+Buffer) and combine them with newsletter campaigns. (Source Code) Apache-2.0 PHP"
  },
  {
    "name": "CouchPotato",
    "url": "https://couchpota.to/",
    "description": "CouchPotato is an automatic Video Library Manager for Movies. Automatic torrent/nzb searching, downloading, and processing at the qualities you want. (Source Code) GPL-3.0 Python"
  },
  {
    "name": "Episodes",
    "url": "https://github.com/guptachetan1997/Episodes",
    "description": "⚠ Self Hosted TV show Episode tracker and recommender built using django, bootstrap4. MIT Python"
  },
  {
    "name": "feedmixer",
    "url": "https://github.com/cristoper/feedmixer",
    "description": "FeedMixer is a WSGI (Python3) micro web service which takes a list of feed URLs and returns a new feed consisting of the most recent n entries from each given feed. (Returns Atom, RSS, or JSON) (Demo) WTFPL Python"
  },
  {
    "name": "FHEM",
    "url": "https://fhem.de/fhem.html",
    "description": "FHEM is used to automate common tasks in the household like switching lamps and heating. It can also be used to log events like temperature or power consumption. You can control it via web or smartphone frontends, telnet or TCP/IP directly. (Source Code) GPL-3.0 Perl"
  },
  {
    "name": "Gekko",
    "url": "https://gekko.wizb.it/",
    "description": "Gekko is a Bitcoin TA trading and backtesting bot which support multiple exchanges and cryptocurrencies. (Source Code) MIT Nodejs"
  },
  {
    "name": "Headphones",
    "url": "https://github.com/rembo10/headphones",
    "description": "Automated music downloader for NZB and Torrent, written in Python. It supports SABnzbd, NZBget, Transmission, µTorrent, Deluge and Blackhole. GPL-3.0 Python"
  },
  {
    "name": "Healthchecks",
    "url": "https://healthchecks.io/",
    "description": "Django app which listens for pings and sends alerts when pings are late. (Source Code) BSD-3-Clause Python"
  },
  {
    "name": "Home Assistant",
    "url": "https://home-assistant.io/",
    "description": "Open-source home automation platform. (Demo, Source Code) MIT Python"
  },
  {
    "name": "homebank-converter",
    "url": "https://github.com/Binnette/homebank-converter",
    "description": "Web app to convert an export bank file to compatible Homebank csv. (Demo) AGPL-3.0 HTML5"
  },
  {
    "name": "Huginn",
    "url": "https://github.com/cantino/huginn",
    "description": "Allows you to build agents that monitor and act on your behalf. MIT Ruby"
  },
  {
    "name": "Http2pic",
    "url": "https://http2pic.haschek.at/",
    "description": "Website screenshots/renderer. It uses the wkhtmltox to render websites with various options. (Source Code) Apache 2.0 PHP/Javascript"
  },
  {
    "name": "Kibitzr",
    "url": "https://kibitzr.github.io",
    "description": "Lightweight personal web assistant with powerful integrations. (Source Code) MIT Python"
  },
  {
    "name": "Medusa",
    "url": "https://github.com/pymedusa/SickRage",
    "description": "Automatic Video Library Manager for TV Shows. It watches for new episodes of your favorite shows, and when they are posted it does its magic. GPL-3.0 Python"
  },
  {
    "name": "Node RED",
    "url": "http://nodered.org/",
    "description": "Browser-based flow editor that helps you wiring hardware devices, APIs and online services to create IoT solutions. (Source Code) Apache-2.0 Nodejs"
  },
  {
    "name": "openHAB",
    "url": "http://www.openhab.org",
    "description": "Vendor and technology agnostic open source software for home automation. (Source Code) EPL-1.0 Java"
  },
  {
    "name": "PolitePol",
    "url": "https://github.com/taroved/pol",
    "description": "Online tool for creation of RSS feeds for any web page. (Demo) MIT Python"
  },
  {
    "name": "Poffer ⚠",
    "url": "http://poffer.gabinaureche.com",
    "description": "Tool that makes it easier to share the content you like thanks to Pocket+Buffer. (Source Code) MIT Nodejs"
  },
  {
    "name": "pyLoad",
    "url": "https://pyload.net/",
    "description": "Lightweight, customizable and remotely manageable downloader for 1-click-hosting sites like rapidshare.com or uploaded.to. (Source Code) GPL-3.0 Python"
  },
  {
    "name": "Radarr",
    "url": "https://radarr.video/",
    "description": "Radarr is an independent fork of Sonarr reworked for automatically downloading movies via Usenet and BitTorrent, à la Couchpotato. (Source Code) GPL-3.0 C#"
  },
  {
    "name": "RSS-Bridge",
    "url": "https://github.com/sebsauvage/rss-bridge",
    "description": "rss-bridge is a PHP project capable of generating ATOM feeds for websites which don't have one. Public domain PHP"
  },
  {
    "name": "RSS Merger",
    "url": "https://github.com/taophp/rss-merger",
    "description": "PHP script which will take multiple RSS / Atom feeds as input and merge them into a single RSS feed. GPL-2.0 PHP"
  },
  {
    "name": "SickRage",
    "url": "http://sickrage.github.io/",
    "description": "SickRage is an automatic Video Library Manager for TV Shows. Automatic torrent/nzb searching, downloading, and processing at the qualities you want. (Source Code) GPL-3.0 Python"
  },
  {
    "name": "Sonarr",
    "url": "https://sonarr.tv/",
    "description": "Automatic TV Shows downloader and manager for Usenet and BitTorrent. It can grab, sort and rename new episodes and automatically upgrade the quality of files already downloaded when a better quality format becomes available. (Source Code) GPL-3.0 C#"
  },
  {
    "name": "TriggerHappy",
    "url": "http://trigger-happy.eu/",
    "description": "Open source clone of IFTTT, a bridge between your internet services. (Source Code) BSD-3-Clause Python"
  },
  {
    "name": "WebUI-aria2",
    "url": "https://github.com/ziahamza/webui-aria2",
    "description": "Interface to interact with the aria2 downloader. Very simple to use, just download and open index.html in any web browser. (Demo) MIT HTML5"
  },
  {
    "name": "WTFDYUM ⚠",
    "url": "https://github.com/jchampemont/WTFDYUM",
    "description": "Why The Fuck Did You Unfollow Me - Find out who stops following you on Twitter. (Demo, Source Code) Apache-2.0 Java"
  },
  {
    "name": "Zenbot 3",
    "url": "https://github.com/carlos8f/zenbot",
    "description": "Zenbot is a lightweight, extendable, artificially intelligent trading bot for Bitcoin, Ether, Litecoin, and more. MIT Node.js"
  },
  {
    "name": "Anchor CMS",
    "url": "https://anchorcms.com/",
    "description": "Free, lightweight, faster-than-a-bullet, simple blogging system, made for art–directed posts. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Antville",
    "url": "https://antville.org",
    "description": "Free, open source project aimed at the development of a high performance, feature rich weblog hosting software. (Source Code) Apache-2.0 Javascript"
  },
  {
    "name": "Blogotext",
    "url": "http://lehollandaisvolant.net/blogotext/",
    "description": "Free blog-engine written in PHP and using SQLite. This offers you both an unmatched simplicity during installation and great performances. (Source Code) MIT PHP"
  },
  {
    "name": "Bludit ⚠",
    "url": "https://www.bludit.com/",
    "description": "Simple application to build a site or blog in seconds. Bludit uses flat-files (text files in JSON format) to store posts and pages. (Demo, Source Code) MIT PHP"
  },
  {
    "name": "Chyrp Lite",
    "url": "http://chyrplite.net",
    "description": "Extra-awesome, extra-lightweight blog engine. (Source Code) BSD-3-Clause PHP"
  },
  {
    "name": "Dotclear",
    "url": "http://dotclear.org/",
    "description": "Take control over your blog. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Formtools",
    "url": "https://formtools.org/",
    "description": "Powerful, flexible, free and open source PHP/MySQL script to manage your forms and data. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Ghost",
    "url": "https://ghost.org/",
    "description": "Just a blogging platform. (Source Code) MIT Nodejs"
  },
  {
    "name": "Hexo",
    "url": "https://hexo.io/",
    "description": "Fast, simple and powerful blog framework, powered by Node.js. (Source Code) MIT Nodejs"
  },
  {
    "name": "Hotglue",
    "url": "https://hotglue.me/",
    "description": "Freehand CMS which allows to construct websites directly in a web-browser. It uses flat files for storage and provides an intuitive GUI. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "htmly",
    "url": "https://www.htmly.com/",
    "description": "Databaseless Blogging Platform (Flat-File Blog). (Demo, Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Known",
    "url": "https://withknown.com/",
    "description": "Single website for all your content. (Source Code) Apache-2.0 PHP"
  },
  {
    "name": "Noddity",
    "url": "http://noddity.com/",
    "description": "It's a blog, it's a wiki, it's a fast CMS. (Source Code) WTFPL Nodejs"
  },
  {
    "name": "PluXml",
    "url": "http://www.pluxml.org/",
    "description": "XML-based blog/CMS platform. (Source Code) GPL-1.0 PHP"
  },
  {
    "name": "Postleaf",
    "url": "https://www.postleaf.org/",
    "description": "Open source blogging platform with inline editing, handlebar templates, and a beautiful user interface. (Source Code) MIT Nodejs"
  },
  {
    "name": "Solo",
    "url": "http://b3log.org/",
    "description": "Blogging system written in Java, feel free to create your or your team own blog. (Demo, Source Code) Apache-2.0 Java"
  },
  {
    "name": "WordPress",
    "url": "https://wordpress.org/",
    "description": "Create a beautiful website or blog. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Bookie",
    "url": "https://github.com/bookieio/Bookie",
    "description": "Python based delicious.com replacement. AGPL-3.0 Python"
  },
  {
    "name": "dyu/bookmarks",
    "url": "https://github.com/dyu/bookmarks",
    "description": "Single-threaded/process bookmark app powered by leveldb and uWebSockets. Supports importing from Delicious and Chrome. (Demo) Apache-2.0 Java"
  },
  {
    "name": "Firefox Auth Server",
    "url": "https://docs.services.mozilla.com/howtos/run-fxa.html",
    "description": "This project implements the core server-side API for Firefox Accounts. (Source Code) MPL-2.0 Nodejs"
  },
  {
    "name": "Firefox Content Server",
    "url": "https://docs.services.mozilla.com/howtos/run-fxa.html",
    "description": "Static server that hosts Firefox Account sign up, sign in, email verification, etc. flows. (Source Code) MPL-2.0 Java"
  },
  {
    "name": "Firefox Sync Server",
    "url": "https://docs.services.mozilla.com/howtos/run-sync-1.5.html",
    "description": "Sync Firefox bookmarks, passwords, history, tabs, preferences. (Source Code) MPL-2.0 Python"
  },
  {
    "name": "Geekmarks",
    "url": "https://geekmarks.dmitryfrank.com/",
    "description": "Personal bookmarking service focused on speed and organization using hierarchical tags. (Source Code) BSD-2-Clause Go"
  },
  {
    "name": "golinks",
    "url": "https://github.com/prologic/golinks",
    "description": "Web application that allows you to create smart bookmarks, commands and aliases by pointing your web browser's default search engine at a running instance. Similar to bunny1 or yubnub. (Demo) MIT Go"
  },
  {
    "name": "Lobsters",
    "url": "https://lobste.rs",
    "description": "Run your own link aggregation site. (Source Code) BSD Ruby"
  },
  {
    "name": "No Fuss Bookmarks",
    "url": "http://nofussbm.herokuapp.com/signup.html",
    "description": "Very simple software and service to store bookmarks especially designed for hackers (that don't need fancy interfaces, but nice API). (Source Code) GPL-3.0 Python"
  },
  {
    "name": "Pinry",
    "url": "http://getpinry.com/",
    "description": "The tiling image board system for people who want to save, tag, and share images, videos, and webpages. (Source Code) BSD-2-Clause Python"
  },
  {
    "name": "saveto",
    "url": "https://save.duyet.net/",
    "description": "Open source, home for the best links on the web. (Source Code) MIT Nodejs"
  },
  {
    "name": "SemanticScuttle",
    "url": "http://semanticscuttle.sourceforge.net/",
    "description": "SemanticScuttle is a social bookmarking tool experimenting with features like structured tags and collaborative tag descriptions. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Shaarli",
    "url": "https://github.com/shaarli/Shaarli",
    "description": "Personal, minimalist, super-fast, no-database bookmarking and link sharing platform. (Demo) Zlib PHP"
  },
  {
    "name": "Shiori",
    "url": "https://github.com/RadhiFadlillah/shiori",
    "description": "Simple bookmark manager built with Go. MIT Go"
  },
  {
    "name": "unmark",
    "url": "https://github.com/plainmade/unmark",
    "description": "Open source to do app for links. MIT PHP"
  },
  {
    "name": "ymarks",
    "url": "https://bitbucket.org/ymarks/ymarks-server",
    "description": "Keep your browser's bookmarks synchronized without limiting yourself to one provider. WTFPL C"
  },
  {
    "name": "Baïkal",
    "url": "http://sabre.io/baikal/",
    "description": "Lightweight CalDAV and CardDAV server based on sabre/dav. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "CalendarServer",
    "url": "https://www.calendarserver.org/",
    "description": "Apple, Inc.'s standards-compliant server implementing the CalDAV and CardDAV protocols shipped with macOS Server. (Source Code) Apache-2.0 Python"
  },
  {
    "name": "calypso",
    "url": "https://keithp.com/calypso/",
    "description": "Python-based CalDAV and CardDAV server, forked from Radicale. (Source Code) GPL-3.0 Python"
  },
  {
    "name": "DAViCal",
    "url": "https://www.davical.org/",
    "description": "Server for calendar sharing (CalDAV) that uses a PostgreSQL database as a data store. (Source Code) MIT PHP"
  },
  {
    "name": "EteSync Server",
    "url": "https://www.etesync.com",
    "description": "End-to-end encrypted and journaled personal information server supporting calendar and contact data, offering its own clients. (Source Code) AGPL-3.0 Python/Django"
  },
  {
    "name": "Radicale",
    "url": "http://radicale.org/",
    "description": "Simple calendar and contact server with extremely low administrative overhead. (Source Code) GPL-3.0 Python"
  },
  {
    "name": "SabreDAV",
    "url": "http://sabre.io/",
    "description": "Open source CardDAV, CalDAV, and WebDAV framework and server. (Source Code) MIT PHP"
  },
  {
    "name": "Xandikos",
    "url": "https://www.xandikos.org/",
    "description": "Open source CardDAV, CalDAV and WebDAV server with minimal administrative overhead, backed by a Git repository. (Source Code) GPL-3.0 Python"
  },
  {
    "name": "AgenDAV",
    "url": "http://agendav.org/",
    "description": "Multilanguage CalDAV web client with a rich AJAX interface and shared calendars support. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "DAVDroid",
    "url": "https://www.davdroid.com/",
    "description": "Open-source CalDAV/CardDAV suite and sync app for Android. (Source Code) GPL-3.0 Java"
  },
  {
    "name": "InfCloud",
    "url": "https://www.inf-it.com/open-source/clients/infcloud/",
    "description": "Open source CalDAV/CardDAV web client implementation. (Demo, Source Code) AGPL-3.0 Javascript"
  },
  {
    "name": "EteSync Web",
    "url": "https://www.etesync.com/faq/#web-client",
    "description": "EteSync's official Web-based client (i.e., their Web app). (Demo, Source Code) AGPL-3.0 TypeScript"
  },
  {
    "name": "Broid",
    "url": "https://broid.ai",
    "description": "Broid enables rich conversations on all messaging channels within a single schema integration using W3C standards. (Demo, Source Code) AGPL-3.0 Nodejs"
  },
  {
    "name": "Centrifugo",
    "url": "https://github.com/centrifugal/centrifugo",
    "description": "Language-agnostic real-time messaging (Websocket or SockJS) server. (Demo) MIT Go"
  },
  {
    "name": "Cherry",
    "url": "https://github.com/rafael-santiago/cherry",
    "description": "Tiny webchat server. GPL-2.0 Go"
  },
  {
    "name": "Freenet",
    "url": "https://freenetproject.org/index.html",
    "description": "Anonymously share files, browse and publish \"freesites\" (web sites accessible only through Freenet) and chat on forums. (Source Code) GPL-2.0 Java"
  },
  {
    "name": "Friends",
    "url": "http://moose-team.github.io/friends/",
    "description": "P2P chat powered by the web. (Source Code) MIT Nodejs"
  },
  {
    "name": "GNUnet",
    "url": "https://gnunet.org/",
    "description": "Free software framework for decentralized, peer-to-peer networking. (Source Code) GPL-3.0 C"
  },
  {
    "name": "Hawkpost",
    "url": "https://hawkpost.co",
    "description": "HawkPost is a web app that lets you create unique links that you can share with a person that desires to send you important information but doesn't know how to encrypt it. The message is encrypted in their browser and sent to your email address. (Source Code) MIT Python"
  },
  {
    "name": "Hubl.in",
    "url": "https://hubl.in/",
    "description": "WebRTC powered video conference, chat and collaborative editor. (Source Code) AGPL-3.0 Nodejs"
  },
  {
    "name": "Jitsi Meet",
    "url": "https://jitsi.org/Projects/JitsiMeet",
    "description": "Jitsi Meet is an OpenSource (MIT) WebRTC Javascript application that uses Jitsi Videobridge to provide high quality, scalable video conferences. (Source Code) MIT Javascript"
  },
  {
    "name": "Jitsi Video Bridge",
    "url": "https://jitsi.org/Projects/JitsiVideobridge",
    "description": "WebRTC compatible Selective Forwarding Unit (SFU) that allows for multiuser video communication. (Source Code) Apache-2.0 Java"
  },
  {
    "name": "Kandan",
    "url": "http://getkandan.com/",
    "description": "Kandan is an Open Source Alternative to HipChat. (Source Code) AGPL-3.0 Ruby"
  },
  {
    "name": "KChat",
    "url": "https://github.com/php-kchat/kchat",
    "description": "PHP Based Live Chat Aplication. Apache-2.0 PHP"
  },
  {
    "name": "Lets-Chat",
    "url": "http://sdelements.github.io/lets-chat/",
    "description": "Self hosted chat suite written in Node. (Source Code) MIT Nodejs"
  },
  {
    "name": "Live Helper Chat",
    "url": "http://livehelperchat.com/",
    "description": "Live Support chat for your website. (Source Code) Apache-2.0 PHP"
  },
  {
    "name": "Mattermost",
    "url": "http://www.mattermost.org/",
    "description": "Open-source, on-prem Slack-alternative. It can be integrated with Gitlab. (Source Code) AGPL-3.0/Apache Go"
  },
  {
    "name": "MiAOU",
    "url": "https://dystroy.org/miaou/login",
    "description": "Multi-room persistent chat server. (Source Code) MIT Nodejs"
  },
  {
    "name": "Mibew",
    "url": "https://mibew.org",
    "description": "Mibew Messenger is an open-source live support application written in PHP and MySQL. It enables one-on-one chat assistance in real-time directly from your website. (Demo, Source Code) Apache-2.0 PHP"
  },
  {
    "name": "Mumble",
    "url": "http://wiki.mumble.info/wiki/Main_Page",
    "description": "Low-latency, high quality voice/text chat software. (Source Code, Clients) BSD C++"
  },
  {
    "name": "Niltalk",
    "url": "http://niltalk.com/",
    "description": "Simple, private, persistence-free web based multi-room chat server + client. (Source Code) AGPL-3.0 Go"
  },
  {
    "name": "Node-Chat",
    "url": "https://github.com/IgorAntun/node-chat",
    "description": "Not-so-basic open-source chat with admin features. MIT Nodejs"
  },
  {
    "name": "Pushjet",
    "url": "https://pushjet.io/",
    "description": "Self hosted push notification service built with a simple API making sending notifications easy. (Source Code) BSD-2-Clause Python"
  },
  {
    "name": "Rallly",
    "url": "http://rallly.co",
    "description": "Rallly is a free collaborative scheduling service. (Source Code) CC-BY-SA-4.0 Nodejs"
  },
  {
    "name": "RetroShare",
    "url": "http://retroshare.org",
    "description": "Secured and decentralized communication system. Offers decentralized chat, forums, messaging, file transfer. (Source Code) GPL-2.0 С++"
  },
  {
    "name": "Ring",
    "url": "https://ring.cx/",
    "description": "Free software for universal communication which respects freedoms and privacy of its users. (Source Code) GPL-3.0 C++"
  },
  {
    "name": "Rocket.Chat",
    "url": "https://rocket.chat/",
    "description": "Teamchat solution similar to Gitter.im or Slack. (Source Code) MIT Nodejs"
  },
  {
    "name": "Spectrum 2",
    "url": "http://spectrum.im/",
    "description": "Spectrum 2 is an open source instant messaging transport.  It allows users to chat together even when they are using different IM networks. (Source Code) GPL-3.0 C++"
  },
  {
    "name": "Spreed",
    "url": "https://www.spreed.me/",
    "description": "WebRTC audio/video calls, conferencing server, and web client. (Source Code) AGPL-3.0 Go"
  },
  {
    "name": "Synapse",
    "url": "http://matrix.org/docs/projects/server/synapse.html",
    "description": "Server for Matrix, an open standard for decentralized persistent communication. (Source Code) Apache-2.0 Python"
  },
  {
    "name": "Matrix Console Web",
    "url": "http://matrix.org/docs/projects/client/matrix-console.html",
    "description": "Web client meant to be a showcase of Matrix capabilities, and reference implementation of the Matrix standard. (Source Code) Apache-2.0 Javascript"
  },
  {
    "name": "RIOT",
    "url": "http://riot.im",
    "description": "Glossy Matrix web client with an emphasis on performance and usability. (Source Code) Apache-2.0 Javascript"
  },
  {
    "name": "Syndie",
    "url": "https://www.syndie.de",
    "description": "Syndie is a libre system for operating distributed forums. CC0-1.0 Java"
  },
  {
    "name": "TextBelt ⚠",
    "url": "https://github.com/typpo/textbelt",
    "description": "Outgoing SMS API that uses carrier-specific gateways to deliver your text messages for free, and without ads. MIT Javascript"
  },
  {
    "name": "Tox",
    "url": "https://tox.chat/",
    "description": "Distributed, secure messenger with audio and video chat capabilities. (Source Code) GPL-3.0 C"
  },
  {
    "name": "Tuber",
    "url": "https://blog.trailofbits.com/2015/12/15/self-hosted-video-chat-with-tuber/",
    "description": "Peer-to-peer video chat that works. (Source Code) MIT Javascript"
  },
  {
    "name": "ZeroNet ⚠",
    "url": "https://zeronet.io/",
    "description": "Open, free, and uncensorable websites, using Bitcoin cryptography and BitTorrent network. (Source Code) GNU Python"
  },
  {
    "name": "Zulip",
    "url": "https://zulip.org",
    "description": "Zulip is a powerful, open source group chat application. (Source Code) Apache/Other Python"
  },
  {
    "name": "docker-mailserver",
    "url": "https://github.com/tomav/docker-mailserver",
    "description": "Fullstack but simple mail server (smtp, imap, antispam, antivirus, etc.). Only configuration files, no SQL database. Keep it simple and versioned. Easy to deploy and upgrade. MIT Docker"
  },
  {
    "name": "Inboxen",
    "url": "https://inboxen.org",
    "description": "Inboxen is a service that provides you with an infinite number of unique inboxes. (Source Code) GPL-3.0 Python"
  },
  {
    "name": "homebox",
    "url": "https://github.com/progmaticltd/homebox",
    "description": "A suite of Ansible scripts to deploy a fully functional mail server on Debian. Unobtrusive and automatic as much as possible, focusing on stability and security.  GPL-3.0 Shell"
  },
  {
    "name": "iRedMail",
    "url": "http://www.iredmail.org/",
    "description": "Full-featured mail server solution based on Postfix and Dovecot. (Source Code) GPL-3.0 Shell"
  },
  {
    "name": "Mailcow",
    "url": "https://mailcow.email/",
    "description": "Mail server suite based on Dovecot, Postfix and other open source software, that provides a modern Web UI for administration. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Mailu",
    "url": "https://mailu.io/",
    "description": "Mailu is a simple yet full-featured mail server as a set of Docker images. (Demo, Source Code) MIT Docker/Python"
  },
  {
    "name": "Mail-in-a-Box",
    "url": "https://mailinabox.email/",
    "description": "Turns any Ubuntu server into a fully functional mail server with one command. (Source Code) CC0-1.0 Shell"
  },
  {
    "name": "Modoboa",
    "url": "http://modoboa.org/en/",
    "description": "Modoboa is a mail hosting and management platform including a modern and simplified Web User Interface. (Source Code) MIT Python"
  },
  {
    "name": "Postal",
    "url": "https://github.com/atech/postal",
    "description": "Postal is a complete and full featured mail server for use by websites and web servers. MIT Ruby"
  },
  {
    "name": "Qmailtoaster",
    "url": "http://www.qmailtoaster.com/",
    "description": "Stable, full-featured, easy-to-install mail server based on qmail. (Source Code) Multiple Linux"
  },
  {
    "name": "Simple NixOS Mailserver",
    "url": "https://github.com/r-raymond/nixos-mailserver",
    "description": "A complete mailserver solution leveraging the Nix Ecosystem. GPL-3.0 Nix"
  },
  {
    "name": "Courier MTA",
    "url": "http://www.courier-mta.org/",
    "description": "Fast, scalable, enterprise mail/groupware server providing ESMTP, IMAP, POP3, webmail, mailing list, basic web-based calendaring and scheduling services. (Source Code) GPL-3.0 C"
  },
  {
    "name": "Exim",
    "url": "https://www.exim.org/",
    "description": "Message transfer agent (MTA) developed at the University of Cambridge. (Source Code) GPL-3.0 C"
  },
  {
    "name": "Haraka",
    "url": "http://haraka.github.io/",
    "description": "High-performance, pluginable SMTP server written in Javascript. (Source Code) MIT Javascript"
  },
  {
    "name": "MailCatcher",
    "url": "http://mailcatcher.me/",
    "description": "Ruby gem that deploys a simply SMTP MTA gateway that accepts all mail and displays in web interface. Useful for debugging or development. (Source Code) MIT Ruby"
  },
  {
    "name": "Maildrop",
    "url": "https://github.com/m242/maildrop",
    "description": "Disposable email SMTP server, also useful for development. MIT Scala"
  },
  {
    "name": "MailHog",
    "url": "https://github.com/mailhog/MailHog",
    "description": "Small Golang executable which runs an SMTP MTA gateway that accepts all mail and displays in web interface. Useful for debugging or development. MIT Go"
  },
  {
    "name": "OpenSMTPD",
    "url": "https://opensmtpd.org/",
    "description": "Secure SMTP server implementation from the OpenBSD project. (Source Code) ISC C"
  },
  {
    "name": "Postfix",
    "url": "http://www.postfix.org/",
    "description": "Fast, easy to administer, and secure Sendmail replacement. IPL-1.0 C"
  },
  {
    "name": "Qmail",
    "url": "http://www.qmail.org/top.html",
    "description": "Secure Sendmail replacement. (Source Code) CC0-1.0 C"
  },
  {
    "name": "Sendmail",
    "url": "http://www.sendmail.com/sm/open_source/",
    "description": "Message transfer agent (MTA). Sendmail C"
  },
  {
    "name": "Slimta",
    "url": "http://slimta.org",
    "description": "Mail Transfer Library built on Python. (Source Code) MIT Python"
  },
  {
    "name": "Cyrus IMAP/POP3",
    "url": "http://cyrusimap.org/",
    "description": "Intended to be run on sealed servers, where normal users are not permitted to log in. (Source Code) BSD C"
  },
  {
    "name": "Dovecot",
    "url": "http://www.dovecot.org/",
    "description": "IMAP and POP3 server written primarily with security in mind. (Source Code) MIT/LGPL-2.1 C"
  },
  {
    "name": "Piler",
    "url": "http://www.mailpiler.org/wiki/start",
    "description": "feature rich open source email archiving solution. (Source Code) GPL-3.0 C"
  },
  {
    "name": "Dada Mail",
    "url": "http://dadamailproject.com/",
    "description": "Web-based list management system that can be used for announcement lists and/or discussion lists. (Source Code) GPL-2.0 Perl"
  },
  {
    "name": "Mail For Good ⚠",
    "url": "https://github.com/freeCodeCamp/mail-for-good",
    "description": "Open source email campaign management tool for nonprofits. BSD Javascript"
  },
  {
    "name": "Mailman",
    "url": "https://www.gnu.org/software/mailman/",
    "description": "The Gnu mailing list server. GPL-3.0 Python"
  },
  {
    "name": "Mailtrain",
    "url": "https://mailtrain.org/",
    "description": "self hosted newsletter application built on Node.js (v5+) and MySQL (v5.5+ or MariaDB). (Source Code) GPL-3.0 Nodejs"
  },
  {
    "name": "MailyHerald",
    "url": "http://mailyherald.org/",
    "description": "Self-hosted Mailchimp alternative that you can easily integrate with your site. Helps you send and manage your application mailings. It support email marketing and conducting the daily stream of notifications you send to your users. (Source Code) LGPL-3.0 Ruby"
  },
  {
    "name": "Mautic",
    "url": "https://www.mautic.org/",
    "description": "Mautic is marketing automation software (email, social and more). (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "phpList",
    "url": "https://phplist.org",
    "description": "Newsletter and email marketing with advanced management of subscribers, bounces, and plugins. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "postal",
    "url": "https://github.com/atech/postal",
    "description": "Fully featured open source mail delivery platform for incoming and outgoing e-mail. MIT Ruby"
  },
  {
    "name": "Schleuder",
    "url": "https://schleuder.nadir.org/",
    "description": "GPG-enabled mailing list manager with resending-capabilities. (Source Code) GPL-3.0 Ruby"
  },
  {
    "name": "Sympa",
    "url": "https://www.sympa.org/",
    "description": "Mailing list manager. GPL-2.0 Perl"
  },
  {
    "name": "Cypht",
    "url": "http://cypht.org/index.html",
    "description": "Feed reader for your email accounts. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "IMP",
    "url": "https://www.horde.org/apps/imp/",
    "description": "HORDE application that provides webmail access to IMAP and POP3 accounts. (Demo, Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Mailpile",
    "url": "https://www.mailpile.is/",
    "description": "Webmail client with search, filtering, encryption features and more. (Source Code) AGPL-3.0 Python"
  },
  {
    "name": "RainLoop",
    "url": "http://www.rainloop.net/",
    "description": "Simple, modern and fast webmail with IMAP/SMTP Support and multi accounting. (Demo, Source Code). AGPL-3.0 PHP"
  },
  {
    "name": "Roundcube",
    "url": "https://roundcube.net",
    "description": "Browser-based IMAP client with an application-like user interface. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "SquirrelMail",
    "url": "http://squirrelmail.org",
    "description": "Another browser-based IMAP client. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "WebMail Lite",
    "url": "http://www.afterlogic.org/webmail-lite",
    "description": "Web-based IMAP Mail client. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Convos",
    "url": "http://convos.by/",
    "description": "Always online web IRC client. (Demo, Source Code) Artistic-2.0 Perl"
  },
  {
    "name": "Kiwi IRC",
    "url": "https://kiwiirc.com/",
    "description": "A responsive web IRC client with theming support. (Demo), (Source Code) Apache-2.0 Nodejs"
  },
  {
    "name": "Quassel IRC",
    "url": "http://quassel-irc.org/",
    "description": "distributed IRC client, meaning that one (or multiple) client(s) can attach to and detach from a central core. (Source Code) GPL-2.0 C++"
  },
  {
    "name": "Robust IRC",
    "url": "https://robustirc.net/",
    "description": "RobustIRC is IRC without netsplits. Distributed IRC server, based on RobustSession protocol. (Source Code) BSD-3-Clause Go"
  },
  {
    "name": "The Lounge",
    "url": "https://thelounge.github.io/",
    "description": "The self-hosted web IRC client. (Demo, Source Code) MIT Nodejs"
  },
  {
    "name": "Weechat",
    "url": "https://weechat.org/",
    "description": "Fast, light and extensible chat client. GPL-3.0 C"
  },
  {
    "name": "ZNC",
    "url": "http://wiki.znc.in/ZNC",
    "description": "Advanced IRC bouncer. (Source Code) Apache-2.0 C++"
  },
  {
    "name": "Asterisk",
    "url": "http://www.asterisk.org/",
    "description": "Easy to use but advanced IP PBX system, VoIP gateway and conference server. GPL-2.0 C"
  },
  {
    "name": "FreeSWITCH",
    "url": "https://freeswitch.org/",
    "description": "Scalable open source cross-platform telephony platform. (Source Code) MPL-2.0 C"
  },
  {
    "name": "Homer",
    "url": "https://www.sipcapture.org/",
    "description": "Troubleshooting and monitoring VoIP calls. (Source Code) AGPL-3.0 Angular/C"
  },
  {
    "name": "Kamailio",
    "url": "http://www.kamailio.org/w/",
    "description": "Modular SIP server (registrar/proxy/router/etc). (Source Code) GPL-2.0 C"
  },
  {
    "name": "Ostel",
    "url": "https://dev.guardianproject.info/projects/ostel/wiki/Server_Documentation",
    "description": "Secure SIP telephony setup with ZRTP encryption. GPL-3.0 Ruby"
  },
  {
    "name": "Freepbx",
    "url": "http://www.freepbx.org",
    "description": "Web-based open source GUI that controls and manages Asterisk. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "FusionPBX",
    "url": "https://www.fusionpbx.com/",
    "description": "Open source project that provides a customizable and flexible web interface to the very powerful and highly scalable multi-platform voice switch called FreeSWITCH. (Source Code) MPL-1.1 PHP"
  },
  {
    "name": "Kazoo",
    "url": "http://2600hz.org/",
    "description": "KAZOO is an open-source, highly scalable software platform designed to provide carrier-grade VoIP switch functions and features. (Source Code) MPL-1.1 Erlang"
  },
  {
    "name": "Wazo",
    "url": "http://wazo.community/",
    "description": "Full-featured IPBX solution built atop Asterisk with integrated Web administration interface and REST-ful API. (Source Code) GPL-3.0 Python/PHP"
  },
  {
    "name": "Abilian SBE",
    "url": "https://github.com/abilian/abilian-sbe",
    "description": "Open Source Collaboration and Social Networking framework and platform. LGPL-2.1 Python"
  },
  {
    "name": "Anahita",
    "url": "https://www.getanahita.com/",
    "description": "Open Source Social Networking Framework and Platform. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "bbPress",
    "url": "https://bbpress.org/",
    "description": "bbPress is forum software with a twist from the creators of WordPress. Easily setup discussion forums inside your WordPress.org powered site. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Bootcamp",
    "url": "http://trybootcamp.vitorfs.com",
    "description": "Enterprise social network. (Source Code) MIT Python"
  },
  {
    "name": "Buddycloud",
    "url": "http://buddycloud.com/",
    "description": "Tools, libraries, services and a community to build user-to-user, group and social messaging into your app. Saves time. Scales up. Supports you. (Source Code) Apache-2.0 Java"
  },
  {
    "name": "BuddyPress",
    "url": "https://buddypress.org/about/",
    "description": "Powerful plugin that takes your WordPress.org powered site beyond the blog with social-network features like user profiles, activity streams, user groups, and more. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "cartulary",
    "url": "https://github.com/daveajones/cartulary",
    "description": "RSS reader, readability tool, article archiver, microblogger, social graph manager and reading list manager. CDDL-1.0 PHP"
  },
  {
    "name": "diaspora*",
    "url": "https://diasporafoundation.org/",
    "description": "Distributed social networking server. (Demo, Source Code) AGPL-3.0 Ruby"
  },
  {
    "name": "Discourse",
    "url": "http://www.discourse.org/",
    "description": "Advanced forum / community solution based on Ruby and JS. (Demo, Source Code) GPL-2.0 Ruby"
  },
  {
    "name": "dyu/comments",
    "url": "https://github.com/dyu/comments/",
    "description": "Real-time, markdown-enabled comment engine powered by leveldb. (Demo) Apache-2.0 Java"
  },
  {
    "name": "Elgg",
    "url": "https://elgg.org/",
    "description": "Powerful open source social networking engine. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Flarum",
    "url": "http://flarum.org",
    "description": "Delightfully simple forums. Flarum is the next-generation forum software that makes online discussion fun again. (Source Code) MIT PHP"
  },
  {
    "name": "flaskbb",
    "url": "https://flaskbb.org/",
    "description": "FlaskBB is forum software written in Python using the microframework Flask. You can easily create new topics, posts and send other users private messages. It also includes basic administration and moderation tools. (Source Code) BSD-3-Clause Python"
  },
  {
    "name": "FluxBB",
    "url": "http://fluxbb.org/",
    "description": "Fast, light, user-friendly forum software for your website. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Friendica",
    "url": "https://friendi.ca/",
    "description": "Social Communication Server. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "GNU social",
    "url": "https://gnu.io/social/",
    "description": "Social communication software for both public and private communications. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Hubzilla",
    "url": "https://hubzilla.org",
    "description": "Decentralized identity, privacy, publishing, sharing, cloud storage, and communications/social platform. (Source Code) MIT PHP"
  },
  {
    "name": "HumHub",
    "url": "https://www.humhub.org/",
    "description": "Flexible kit for private social networks. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Isso",
    "url": "http://posativ.org/isso/",
    "description": "Lightweight commenting server written in Python and Javascript. It aims to be a drop-in replacement for Disqus. (Source Code) MIT Python"
  },
  {
    "name": "Jappix",
    "url": "https://jappix.com/",
    "description": "Jappix is an open social platform, that let's you easily get or keep in touch with everyone. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Loomio",
    "url": "https://www.loomio.org/",
    "description": "Loomio is a collaborative decision-making tool that makes it easy for anyone to participate in decisions which affect them. (Source Code) AGPL-3.0 Ruby"
  },
  {
    "name": "Mastodon",
    "url": "https://joinmastodon.org/",
    "description": "Federated microblogging server, an alternative to GNU social. (Source Code) AGPL-3.0 Ruby"
  },
  {
    "name": "MyBB",
    "url": "http://www.mybb.com/",
    "description": "Free, extensible forum software package. (Source Code) LGPL-3.0 PHP"
  },
  {
    "name": "Newebe",
    "url": "http://newebe.org/",
    "description": "Distributed Social Network. (Source Code) AGPL-3.0 Python"
  },
  {
    "name": "NodeBB",
    "url": "https://nodebb.org/",
    "description": "Node.js based forum software built for the modern web. (Source Code) GPL-3.0 Nodejs"
  },
  {
    "name": "Pleroma",
    "url": "https://pleroma.social",
    "description": "Federated microblogging server, Mastodon, GNU social, & ActivityPub compatible.(Source Code) AGPL-3.0 Elixir"
  },
  {
    "name": "orangeforum",
    "url": "http://www.goodoldweb.com/",
    "description": "Orange Forum is an easy to deploy forum that has minimal dependencies and uses very little javascript. (Demo, Source Code) BSD-3-Clause Go"
  },
  {
    "name": "OSSN",
    "url": "https://www.opensource-socialnetwork.org/",
    "description": "Open Source Social Network (OSSN) is a social networking software written in PHP. It allows you to make a social networking website and helps your members build social relationships, with people who share similar professional or personal interests. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Oxwall",
    "url": "http://www.oxwall.org/",
    "description": "Oxwall is used for a wide range of projects starting from family sites and custom social networks to collaboration tools and enterprise community solutions. (Source Code) CPAL-1.0 PHP"
  },
  {
    "name": "phpBB",
    "url": "https://www.phpbb.com/",
    "description": "Flat-forum bulletin board software solution that can be used to stay in touch with a group of people or can power your entire website. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "PPnet",
    "url": "https://github.com/pixelpark/ppnet",
    "description": "Create and host your own social network. MIT Javascript"
  },
  {
    "name": "Pump.io",
    "url": "http://pump.io/",
    "description": "Stream server that does most of what people really want from a social network. (Source Code) Apache-2.0 Nodejs"
  },
  {
    "name": "Socialhome",
    "url": "https://socialhome.network",
    "description": "Federated and decentralized profile builder and social network engine. (Demo, Source Code) AGPL-3.0 Python"
  },
  {
    "name": "Symphony",
    "url": "https://hacpai.com/",
    "description": "Modern community (forum/SNS/blog) platform written in Java. (Source Code) GPL-3.0 Java"
  },
  {
    "name": "Telescope",
    "url": "http://www.telescopeapp.org/",
    "description": "Open-source social news app built with Meteor. (Demo, Source Code) MIT Nodejs"
  },
  {
    "name": "Tokumei",
    "url": "https://tokumei.co/",
    "description": "Anonymous microblogging platform. (Demo, Source Code) ISC rc"
  },
  {
    "name": "twister",
    "url": "http://twister.net.co/",
    "description": "Fully decentralized P2P microblogging platform leveraging the free software implementations of Bitcoin and BitTorrent protocols. (Source Code) MIT C++"
  },
  {
    "name": "Vanilla Forums",
    "url": "https://vanillaforums.org/",
    "description": "Simple and flexible forum software. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "ejabberd",
    "url": "https://www.ejabberd.im/",
    "description": "XMPP instant messaging server. (Source Code) GPL-2.0 Erlang"
  },
  {
    "name": "Kontalk",
    "url": "http://kontalk.org/",
    "description": "Kontalk is an Open Source Messenger, similar to WhatsApp (app for android only currently), including end-to-end encryption, server is based on Tigase XMPP Server. (Source Code) GPL-3.0 Java"
  },
  {
    "name": "Metronome IM",
    "url": "https://metronome.im/",
    "description": "Fork of Prosody IM. (Source Code) MIT Lua"
  },
  {
    "name": "MongooseIM",
    "url": "https://www.erlang-solutions.com/products/mongooseim.html",
    "description": "Mobile messaging platform with a focus on performance and scalability. (Source Code) GPL-2.0 Erlang"
  },
  {
    "name": "Openfire",
    "url": "http://www.igniterealtime.org/projects/openfire/",
    "description": "Real time collaboration (RTC) server. (Source Code) Apache-2.0 Java"
  },
  {
    "name": "Prosody IM",
    "url": "http://prosody.im/",
    "description": "Feature-rich and easy to configure XMPP server. (Source Code) MIT Lua"
  },
  {
    "name": "Tigase",
    "url": "http://www.tigase.net/content/tigase-xmpp-server",
    "description": "XMPP server implementation in Java. GPL-3.0 Java"
  },
  {
    "name": "Candy",
    "url": "http://candy-chat.github.io/candy/",
    "description": "Multi user XMPP client written in Javascript. (Source Code) MIT Javascript"
  },
  {
    "name": "Converse.js",
    "url": "https://conversejs.org/",
    "description": "Free and open-source XMPP chat client in your browser. (Source Code) MPL-2.0 Javascript"
  },
  {
    "name": "JSXC",
    "url": "https://jsxc.org",
    "description": "Real-time XMPP web chat application with video calls, file transfer and encrypted communication. There are also versions for Nextcloud/Owncloud and SOGo. (Source Code) MIT Javascript"
  },
  {
    "name": "Kaiwa",
    "url": "http://getkaiwa.com/",
    "description": "Web based chat client in the style of common paid alternatives. (Source Code) MIT Nodejs"
  },
  {
    "name": "Movim",
    "url": "https://movim.eu/",
    "description": "Modern, federated social network based on XMPP, with a fully featured group-chat, subscriptions and microblogging. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Salut à Toi",
    "url": "http://www.salut-a-toi.org/",
    "description": "Multipurpose, multi frontend, libre and decentralised communication tool. (Source Code) AGPL-3.0 Python"
  },
  {
    "name": "Libervia",
    "url": "http://wiki.goffi.org/wiki/Libervia/en",
    "description": "Web frontend from Salut à Toi. (Source Code) AGPL-3.0 Python"
  },
  {
    "name": "Conference Organizing Distribution (COD)",
    "url": "http://usecod.com/",
    "description": "Create conference and event websites built on top of Drupal. (Source Code) GPL-1.0 PHP"
  },
  {
    "name": "frab",
    "url": "https://frab.github.io/frab/",
    "description": "web-based conference planning and management system. It helps to collect submissions, to manage talks and speakers and to create a schedule. (Source Code) MIT Ruby"
  },
  {
    "name": "Open Conference Systems (OCS)",
    "url": "https://pkp.sfu.ca/ocs/",
    "description": "is a free Web publishing tool that will create a complete Web presence for your scholarly conference. (Demo, Source Code) GPL-1.0 PHP"
  },
  {
    "name": "OpenCFP",
    "url": "https://github.com/opencfp/opencfp",
    "description": "OpenCFP is a PHP-based conference talk submission system. MIT PHP"
  },
  {
    "name": "OpenConferenceWare",
    "url": "http://openconferenceware.org/",
    "description": "Open source web application for supporting conference-like events. This customizable, general-purpose platform provides proposals, sessions, schedules, tracks, user profiles. (Source Code) MIT Ruby"
  },
  {
    "name": "osem",
    "url": "http://osem.io/",
    "description": "Event management tailored to free Software conferences. (Demo, Source Code) MIT Ruby"
  },
  {
    "name": "pretalx",
    "url": "https://pretalx.org",
    "description": "Web-based event management, including running a Call for Papers, reviewing submissions, and scheduling talks. Exports and imports for various related tools. (Source Code) Apache-2.0 Python"
  },
  {
    "name": "APIQ CMS",
    "url": "https://www.apiq.io/",
    "description": "Simple and powerful Ruby on Rails CMS for developers. (Demo, Source Code) MIT Ruby"
  },
  {
    "name": "Apostrophe",
    "url": "http://apostrophecms.org/",
    "description": "Node.js CMS with a focus on extensible in-context editing tools. (Demo, Source Code) MIT Nodejs"
  },
  {
    "name": "Backdrop CMS",
    "url": "https://backdropcms.org/",
    "description": "The comprehensive CMS for small to medium sized businesses and non-profits. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Baun",
    "url": "https://bauncms.com/",
    "description": "Modern, lightweight, extensible CMS for PHP. (Source Code) MIT PHP"
  },
  {
    "name": "BigTree CMS",
    "url": "https://www.bigtreecms.org/",
    "description": "Straightforward, well documented, and capable written with PHP and MySQL. (Source Code) LGPL-2.1 PHP"
  },
  {
    "name": "Bolt CMS",
    "url": "https://bolt.cm/",
    "description": "Open source Content Management Tool, which strives to be as simple and straightforward as possible. (Demo, Source Code) MIT PHP"
  },
  {
    "name": "CMS Made Simple",
    "url": "http://www.cmsmadesimple.org/",
    "description": "Open source content management system, faster and easier management of website contents, scalable for small businesses to large corporations. (Source Code) GPL-1.0 PHP"
  },
  {
    "name": "Concrete 5 CMS",
    "url": "http://www.concrete5.org/",
    "description": "Open source content management system. (Source Code) MIT PHP"
  },
  {
    "name": "CouchCMS",
    "url": "http://www.couchcms.com/",
    "description": "Simple Open-Source CMS for designers. (Source Code) CPAL-1.0 PHP"
  },
  {
    "name": "Directus",
    "url": "http://getdirectus.com/",
    "description": "Directus is a powerful and intuitive headless CMS for managing SQL databases with custom architectures. Built around a robust and extensible API, this decoupled content management framework is perfect for websites, apps, or multi-client projects. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Drupal",
    "url": "https://www.drupal.org/",
    "description": "Advanced open source content management platform. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "eLabFTW",
    "url": "http://www.elabftw.net",
    "description": "Online lab notebook for research labs. Store experiments, use a database to find reagents or protocols, use trusted timestamping to legally timestamp an experiment, export as pdf or zip archive, share with collaborators…. (Demo, Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "GetSimple CMS",
    "url": "http://get-simple.info/",
    "description": "The Simplest Content Management System. Ever. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "ImpressPages CMS",
    "url": "https://www.impresspages.org/",
    "description": "Easy code meets easy admin. (Demo, Source Code) GPL-3.0/MIT PHP"
  },
  {
    "name": "Joomla!",
    "url": "https://www.joomla.org/",
    "description": "Advanced Content Management System (CMS). (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "KeystoneJS",
    "url": "http://keystonejs.com/",
    "description": "CMS and Web Application Platform. (Demo, Source Code) MIT Nodejs"
  },
  {
    "name": "MODX",
    "url": "http://modx.com/",
    "description": "MODX is an advanced content management and publishing platform. The current version is called 'Revolution'. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Neos",
    "url": "https://www.neos.io",
    "description": "Neos or TYPO3 Neos (for version 1) is a modern, open source CMS. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Noosfero",
    "url": "http://noosfero.org/",
    "description": "Noosfero is a web platform for social and solidarity economy networks with blog, e-Portfolios, CMS, RSS, thematic discussion, events agenda and collective intelligence for solidarity economy in the same system. (Source Code) AGPL-3.0 Ruby"
  },
  {
    "name": "october",
    "url": "http://octobercms.com/",
    "description": "Free, open-source, self-hosted CMS platform. (Source Code) MIT PHP"
  },
  {
    "name": "Omeka",
    "url": "http://omeka.org",
    "description": "Create complex narratives and share rich collections, adhering to Dublin Core standards with Omeka on your server, designed for scholars, museums, libraries, archives, and enthusiasts. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Pagekit",
    "url": "https://pagekit.com/",
    "description": "New modern CMS to create and share. (Source Code) MIT PHP"
  },
  {
    "name": "Pico",
    "url": "http://picocms.org/",
    "description": "Stupidly simple, blazing fast, flat file CMS. (Source Code) MIT PHP"
  },
  {
    "name": "Pimcore",
    "url": "https://www.pimcore.org/",
    "description": "Multi-Channel Experience and Engagement Management Platform. (Source Code) BSD PHP"
  },
  {
    "name": "Plone",
    "url": "https://plone.org/",
    "description": "Powerful open-source CMS system. (Source Code) ZPL-2.0 Python"
  },
  {
    "name": "ProcessWire",
    "url": "https://processwire.com/",
    "description": "ProcessWire is an open source content management system (CMS) and web application framework aimed at the needs of designers, developers and their clients. (Source Code) MPL-2.0 PHP"
  },
  {
    "name": "PropertyWebBuilder",
    "url": "http://propertywebbuilder.com",
    "description": "The ultimate Ruby on Rails engine for creating real estate websites. (Demo, Source Code) MIT Ruby"
  },
  {
    "name": "Publify",
    "url": "http://publify.co/",
    "description": "Simple but full featured web publishing software. (Source Code) MIT Ruby"
  },
  {
    "name": "REDAXO",
    "url": "https://www.redaxo.org",
    "description": "Simple, flexible and useful content management system (documentation only available in German). (Source Code) MIT PHP"
  },
  {
    "name": "Redaxscript",
    "url": "https://redaxscript.com",
    "description": "Ultra lightweight CMS for MySQL, SQLite and PostgreSQL. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Roadiz",
    "url": "https://www.roadiz.io/",
    "description": " Modern CMS based on a node system which can handle many types of services. (Source Code) MIT PHP"
  },
  {
    "name": "SilverStripe",
    "url": "https://www.silverstripe.org",
    "description": "Easy to use CMS with powerful MVC framework underlying. (Demo, Source Code) BSD PHP"
  },
  {
    "name": "Sphido",
    "url": "http://www.sphido.org/",
    "description": "Fast, lightweight, flat file CMS for PHP. (Source Code) MIT PHP"
  },
  {
    "name": "SPIP",
    "url": "http://www.spip.net/fr",
    "description": "Publication system for the Internet aimed at collaborative work, multilingual environments, and simplicity of use for web authors. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Subrion",
    "url": "http://www.subrion.org",
    "description": "Subrion is a free open source content management system that allows you to build websites for any purpose. Yes, from blog to corporate mega portal. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Textpattern",
    "url": "http://textpattern.com/",
    "description": "Flexible, elegant and easy-to-use CMS. (Demo, Source Code) GPL-2.0 PHP"
  },
  {
    "name": "TYPO3",
    "url": "https://typo3.org/",
    "description": "Powerful and advanced CMS with a large community. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Umbraco",
    "url": "https://umbraco.com/",
    "description": "The friendly CMS. Free and open source with an amazing community. (Source Code) MIT .NET"
  },
  {
    "name": "Wagtail",
    "url": "https://wagtail.io/",
    "description": "Django content management system focused on flexibility and user experience. (Source Code) BSD Python"
  },
  {
    "name": "WonderCMS",
    "url": "http://www.wondercms.com",
    "description": "WonderCMS is the smallest flat file CMS since 2008. (Demo, Source Code) MIT PHP"
  },
  {
    "name": "WordPress",
    "url": "https://wordpress.org/",
    "description": "The worlds most-used blogging and CMS engine. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "OpenEats",
    "url": "https://github.com/open-eats/OpenEats",
    "description": "Recipe management site that allows users to create, store, share and rate recipes, create grocery lists, and more. (Demo) MIT Python"
  },
  {
    "name": "Attendize",
    "url": "https://www.attendize.com/",
    "description": "Ticket selling and event management platform. (Demo, Source Code) AAL PHP"
  },
  {
    "name": "CoreShop",
    "url": "https://www.coreshop.org",
    "description": "CoreShop is a e-commerce plugin for Pimcore. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Drupal Commerce",
    "url": "https://drupalcommerce.org",
    "description": "Drupal Commerce is a popular e-commerce module for Drupal CMS, with support for dozens of payment, shipping, and shopping related modules. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Magento",
    "url": "https://magento.com/",
    "description": "Leading provider of open omnichannel innovation. (Demo, Source Code) OSL-3.0 PHP"
  },
  {
    "name": "Microweber",
    "url": "https://microweber.com/",
    "description": "Drag and Drop CMS and online shop. (Demo, Source Code) Apache-2.0 PHP"
  },
  {
    "name": "OpenCart",
    "url": "https://www.opencart.com",
    "description": "Free open source shopping cart solution. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Open Classifieds",
    "url": "http://open-classifieds.com/",
    "description": "Free open-source, self-hosted CMS for classifieds sites. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Open eShop",
    "url": "https://open-eshop.com/",
    "description": "Sell your digital goods with licenses and provide support. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Osclass",
    "url": "https://osclass.org/",
    "description": "One-stop shop to building your own classifieds marketplace. (Source Code) Apache-2.0 PHP"
  },
  {
    "name": "OXID eShop",
    "url": "http://oxidforge.org",
    "description": "OXID eShop is a flexible open source e-commerce software with a wide range of functionalities. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Open Food Network",
    "url": "https://openfoodnetwork.org/",
    "description": "Online marketplace for local food. It enables a network of independent online food stores that connect farmers and food hubs with individuals and local businesses. (Source Code) AGPL-3.0 Ruby"
  },
  {
    "name": "PrestaShop",
    "url": "https://www.prestashop.com/",
    "description": "PrestaShop offers a free, open-source and fully scalable e-commerce solution. (Demo, Source Code) OSL-3.0 PHP"
  },
  {
    "name": "Pretix",
    "url": "https://pretix.eu/",
    "description": "Django based ticket sales platform for events. (Source Code) Apache-2.0 Python"
  },
  {
    "name": "Saleor",
    "url": "http://getsaleor.com/",
    "description": "Django based open-sourced e-commerce storefront. (Demo, Source Code) BSD-3-Clause Python"
  },
  {
    "name": "Shuup",
    "url": "https://www.shuup.com/",
    "description": "Django powered fully customizable open source e-commerce framework for small and large sites. (Demo, Source Code) AGPL-3.0 Python"
  },
  {
    "name": "Sylius",
    "url": "http://sylius.org/",
    "description": "Symfony2 powered open source full-stack platform for eCommerce. (Demo, Source Code) MIT PHP"
  },
  {
    "name": "Thelia",
    "url": "http://thelia.net/",
    "description": "Thelia is an open source and flexible e-commerce solution. (Demo, Source Code) LGPL-3.0 PHP"
  },
  {
    "name": "WooCommerce",
    "url": "https://www.woothemes.com/woocommerce/",
    "description": "WordPress based e-commerce solution. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "CoreDNS",
    "url": "https://coredns.io/",
    "description": "Plugin driven DNS Server with support for proxying to Google's DNS-over-HTTPS. (Source Code) Apache-2.0 Go"
  },
  {
    "name": "nsupdate.info",
    "url": "https://www.nsupdate.info/",
    "description": "nsupdate.info is a dynamic DNS service. (Demo, Source Code) BSD-3-Clause Python"
  },
  {
    "name": "SPF Toolbox",
    "url": "http://spftoolbox.charlesabarnes.com",
    "description": "Application to look up DNS records such as SPF, MX, Whois, and more. (Source Code) MIT PHP"
  },
  {
    "name": "EdPaper",
    "url": "https://github.com/Edraens/EdPaper",
    "description": "PDF organizer with users management. MIT PHP"
  },
  {
    "name": "Mayan EDMS",
    "url": "http://www.mayan-edms.com",
    "description": "Free Open Source Electronic Document Management System. An electronic vault for your documents with preview generation, OCR, and automatic categorization among other features. (Source Code) Apache-2.0 Python"
  },
  {
    "name": "Paperless",
    "url": "https://github.com/danielquinn/paperless",
    "description": "Scan, index, and archive all of your paper documents. GPL-3.0 Python"
  },
  {
    "name": "Calibre",
    "url": "https://calibre-ebook.com/",
    "description": "E-book library manager that can view, convert, and catalog e-books in most of the major e-book formats and provides a built-in Web server for remote clients. (Demo, Source code) GPL-3.0 Python"
  },
  {
    "name": "BicBucStriim",
    "url": "http://projekte.textmulch.de/bicbucstriim/",
    "description": "Provides web-based access to your Calibre Library's e-book collection. (Source Code) MIT PHP"
  },
  {
    "name": "Calibre Web",
    "url": "https://github.com/janeczku/calibre-web",
    "description": "Web app providing a clean interface for browsing, reading and downloading eBooks using an existing Calibre database. (Source Code) GPL-3.0 Python"
  },
  {
    "name": "COPS",
    "url": "https://blog.slucas.fr/en/oss/calibre-opds-php-server",
    "description": "Lightweight e-book server alternative to Calibre content server or Calibre2OPDS. (Demo, Source Code) GPL-2.0 PHP"
  },
  {
    "name": "LibreRead",
    "url": "https://libreread.org/",
    "description": "Self-hosted Web-based e-book reader. (Demo, Source Code) AGPL-3.0 Go"
  },
  {
    "name": "Evergreen",
    "url": "https://evergreen-ils.org",
    "description": "Highly-scalable software for libraries that helps library patrons find library materials, and helps libraries manage, catalog, and circulate those materials. (Source Code) GPL-2.0 PL/pgSQL"
  },
  {
    "name": "Koha",
    "url": "https://koha-community.org/",
    "description": "Enterprise-class ILS with modules for acquisitions, circulation, cataloging, label printing, offline circulation for when Internet access is not available, and much more. (Demo, Source Code) GPL-3.0 Perl"
  },
  {
    "name": "ERPNext",
    "url": "https://erpnext.com",
    "description": "Free open source ERP system. (Demo, Source Code) GPL-3.0 Python"
  },
  {
    "name": "LedgerSMB",
    "url": "https://ledgersmb.org/",
    "description": "Integrated accounting and ERP system for small and midsize businesses, with double entry accounting, budgeting, invoicing, quotations, projects, orders and inventory management, shipping and more. (Demo, Source Code) GPL-2.0 Perl"
  },
  {
    "name": "Odoo",
    "url": "http://odoo.com",
    "description": "Free open source ERP system. (Demo, Source Code) LGPL-3.0 Python"
  },
  {
    "name": "Tryton",
    "url": "http://www.tryton.org/",
    "description": "Free open source business solution. (Demo, Source Code) GPL-3.0 Python"
  },
  {
    "name": "farmOS",
    "url": "http://farmos.org/",
    "description": "Web-based farm record keeping application. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "tania",
    "url": "https://github.com/Tanibox/tania/",
    "description": "PHP based, free, and open source farming management system. Apache-2.0 PHP"
  },
  {
    "name": "CommaFeed",
    "url": "https://www.commafeed.com/",
    "description": "Google Reader inspired self-hosted RSS reader. (Source Code) Apache-2.0 Java"
  },
  {
    "name": "Creaky Coot",
    "url": "http://bugs.derivoile.fr/Creaky-Coot/dashboard",
    "description": "Minimalist and responsive RSS reader and links saver. (Source Code) MIT PHP"
  },
  {
    "name": "Feedbin",
    "url": "https://feedbin.com/",
    "description": "Simple, fast and nice looking RSS reader. (Source Code) MIT Ruby"
  },
  {
    "name": "FeedHQ",
    "url": "https://feedhq.org/",
    "description": "FeedHQ is a web-based feed reader. (Source Code) BSD-3-Clause Python"
  },
  {
    "name": "FreshRSS",
    "url": "http://freshrss.org/",
    "description": "Self-hostable RSS feed aggregator. (Demo, Source Code, Mobile app) AGPL-3.0 PHP"
  },
  {
    "name": "JARR",
    "url": "http://1pxsolidblack.pl/jarr-en.html",
    "description": "JARR (Just Another RSS Reader) is a web-based news aggregator and reader. (Demo, Source Code) AGPL-3.0 Python"
  },
  {
    "name": "Kriss Feed",
    "url": "http://tontof.net/kriss/feed/",
    "description": "Simple and smart (or stupid) feed reader. (Demo, Source Code) CC0-1.0 PHP"
  },
  {
    "name": "Leed",
    "url": "http://leed.idleman.fr",
    "description": "Leed (for Light Feed) is a Free and minimalist RSS aggregator. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Leselys",
    "url": "https://github.com/socketubs/leselys",
    "description": "Your very elegant RSS reader. AGPL-3.0 Python"
  },
  {
    "name": "Lite-Reader",
    "url": "http://cubny.com/lite-reader/",
    "description": "Read your feeds on your own machine with a simple and lite application. (Source Code) BSD-3-Clause PHP"
  },
  {
    "name": "Moonmoon",
    "url": "http://moonmoon.org/",
    "description": "simple feed agregator (planet like): it only aggregates feeds and spits them out in one single page. (Source Code) BSD PHP"
  },
  {
    "name": "Miniflux",
    "url": "https://miniflux.net/",
    "description": "Miniflux 2 is a minimalist and open source news reader, written in Go and PostgreSQL. (Source Code) Apache-2.0 Go"
  },
  {
    "name": "RSSPBRRY",
    "url": "http://jasoncomely.com/rss-tastemaker/",
    "description": "Fresh new RSS feed reader. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "NewsBlur",
    "url": "http://www.newsblur.com/",
    "description": "NewsBlur is a personal news reader that brings people together to talk about the world. A new sound of an old instrument. (Source Code) MIT Python"
  },
  {
    "name": "Nunux Reader",
    "url": "http://reader.nunux.org/",
    "description": "Simple, fast and reactive RSS reader. (Source Code) GPL-3.0 Nodejs"
  },
  {
    "name": "Reader-Self",
    "url": "http://readerself.com/",
    "description": "Self-hosted rss reader (php / mysql or sqlite) - Google Reader alternative. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "RSS2EMail",
    "url": "http://www.allthingsrss.com/rss2email/",
    "description": "Fetches RSS/Atom-feeds and pushes new Content to any email-receiver, supports OPML. (Source Code) GPL-2.0 Python"
  },
  {
    "name": "RSS Monster",
    "url": "https://github.com/pietheinstrengholt/rssmonster",
    "description": "RSS Monster is an easy to use web-based RSS aggregator and reader compatible with the Fever API, created as an alternative for Google Reader. MIT PHP"
  },
  {
    "name": "Screaming Liquid Tiger",
    "url": "https://github.com/herrbischoff/screaming-liquid-tiger",
    "description": "Simple script to automatically generate valid RSS and Atom feeds from a list of media files in the same folder. MIT PHP"
  },
  {
    "name": "Selfoss",
    "url": "http://selfoss.aditu.de/",
    "description": "New multipurpose rss reader, live stream, mashup, aggregation web application. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Sismics Reader",
    "url": "https://github.com/sismics/reader",
    "description": "Free and open source feeds reader, including all major Google Reader features. GPL-2.0 Java"
  },
  {
    "name": "Stringer",
    "url": "https://github.com/swanson/stringer",
    "description": "Work-in-progress self-hosted, anti-social RSS reader. MIT Ruby"
  },
  {
    "name": "Temboz",
    "url": "https://github.com/fazalmajid/temboz",
    "description": "Two-column feed reader emphasizing filtering capabilities to manage information overload. MIT Python"
  },
  {
    "name": "Tiny Tiny RSS",
    "url": "https://tt-rss.org/gitlab/fox/tt-rss",
    "description": "Open source web-based news feed (RSS/Atom) reader and aggregator. (Demo) GPL-3.0 PHP"
  },
  {
    "name": "gritttt-rss",
    "url": "http://gritttt-rss.nicolashoening.de/",
    "description": "More features for Tiny Tiny RSS. (Source Code) BSD-2-Clause Python"
  },
  {
    "name": "ttrss-mobile",
    "url": "https://github.com/mboinet/ttrss-mobile",
    "description": "Mobile webapp for Tiny Tiny RSS. AGPL-3.0 Javascript"
  },
  {
    "name": "ttrss-reader",
    "url": "https://github.com/kucrut/ttrss-reader",
    "description": "Light and responsive client for TTRSS. GPL-2.0 Javascript"
  },
  {
    "name": "Winds ⚠",
    "url": "https://github.com/GetStream/Winds",
    "description": "Open source and beautiful RSS reader built using React/Redux/Sails/Node and Stream. It showcases personalized feeds powered by the Stream API. (Demo) BSD-3-Clause Nodejs"
  },
  {
    "name": "Git Annex",
    "url": "https://git.joeyh.name/git/git-annex.git/",
    "description": "File synchronization between computers, servers, external drives. (Source Code) GPL-3.0 Haskell"
  },
  {
    "name": "Kinto",
    "url": "https://kinto.readthedocs.org",
    "description": "Kinto is a minimalist JSON storage service with synchronisation and sharing abilities. (Source Code) Apache-2.0 Python"
  },
  {
    "name": "Nextcloud",
    "url": "https://nextcloud.com/",
    "description": "Access and share your files, calendars, contacts, mail and more from any device, on your terms. (Demo, Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "OpenSSH/SFTP",
    "url": "http://www.openssh.com/",
    "description": "Secure File Transfer Program. (Source Code) BSD C"
  },
  {
    "name": "ownCloud",
    "url": "https://owncloud.org/",
    "description": "All-in-one solution for saving, synchronizing, viewing, editing and sharing files, calendars, address books and more. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Pydio",
    "url": "https://pydio.com/",
    "description": "Turn any web server into a powerful file management system and an alternative to mainstream cloud storage providers. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Samba",
    "url": "https://www.samba.org/",
    "description": "Samba is the standard Windows interoperability suite of programs for Linux and Unix. It provides secure, stable and fast file and print services for all clients using the SMB/CIFS protocol. (Source Code) GPL-3.0 C"
  },
  {
    "name": "Seafile",
    "url": "https://www.seafile.com/en/home/",
    "description": "File hosting and sharing solution primary for teams and organizations. (Demo, Source Code) GPL-2.0 C"
  },
  {
    "name": "SparkleShare",
    "url": "http://sparkleshare.org/",
    "description": "Self hosted, instant, secure file sync. (Source Code) GPL-3.0 C#"
  },
  {
    "name": "Syncany",
    "url": "https://www.syncany.org/",
    "description": "Secure file sync software for arbitrary storage backends, an open-source cloud storage and filesharing application. Securely synchronize your files to any kind of storage. GPL-3.0 Java"
  },
  {
    "name": "Syncthing",
    "url": "https://syncthing.net/",
    "description": "Syncthing is an open source peer-to-peer file synchronisation tool. (Source Code) MPL-2.0 Go"
  },
  {
    "name": "Unison",
    "url": "https://www.cis.upenn.edu/%7Ebcpierce/unison/",
    "description": "Unison is a file-synchronization tool for OSX, Unix, and Windows. GPL-3.0 OCaml"
  },
  {
    "name": "Z-Push",
    "url": "http://z-push.org/",
    "description": "Implementation of Microsoft’s ActiveSync protocol. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "bittorrent-tracker",
    "url": "https://webtorrent.io/",
    "description": "Simple, robust, BitTorrent tracker (client and server) implementation. (Source Code) MIT Nodejs"
  },
  {
    "name": "cloud-torrent",
    "url": "https://github.com/jpillora/cloud-torrent",
    "description": "Torrent Web Client with HTTP retrievable or streamable downloaded files. AGPL-3.0 Go"
  },
  {
    "name": "Dat Project",
    "url": "https://datproject.org",
    "description": "Powerful decentralized file sharing applications built from a large ecosystem of modules. (Source Code) MIT Nodejs"
  },
  {
    "name": "FilePizza",
    "url": "http://file.pizza/",
    "description": "Peer-to-peer file transfers in your browser. (Source Code) BSD Nodejs"
  },
  {
    "name": "instant.io",
    "url": "https://github.com/feross/instant.io",
    "description": "Streaming file transfer over WebTorrent. (Demo) MIT Nodejs"
  },
  {
    "name": "Magnetico",
    "url": "https://github.com/boramalper/magnetico",
    "description": "Magnetico is the first autonomous (self-hosted) BitTorrent DHT search engine suite that is designed for end-users. AGPL-3.0 Python"
  },
  {
    "name": "Magnetissimo",
    "url": "https://github.com/sergiotapia/magnetissimo",
    "description": "Search engine that indexes all popular torrent sites. MIT Elixir"
  },
  {
    "name": "Opentracker",
    "url": "http://erdgeist.org/arts/software/opentracker/",
    "description": "Open and free bittorrent tracker. It aims for minimal resource usage and is intended to run at your wlan router. (Source Code) Beerware C"
  },
  {
    "name": "peerflix-server",
    "url": "https://github.com/asapach/peerflix-server",
    "description": "Downloads torrent files and provides a direct link download or a direct link stream. MIT Nodejs"
  },
  {
    "name": "qBittorrent",
    "url": "https://www.qbittorrent.org/",
    "description": "Free cross-platform bittorrent client with a feature rich Web UI for remote access. (Source Code) GPL-2.0 C++"
  },
  {
    "name": "rartracker",
    "url": "https://github.com/swetorrentking/rartracker",
    "description": "Complete private bittorrent tracker. WTFPL PHP"
  },
  {
    "name": "Reep",
    "url": "https://reep.io",
    "description": "In-browser peer-to-peer file transfer and streaming made easy. (Source Code) GPL-2.0 Nodejs"
  },
  {
    "name": "Transmission",
    "url": "https://transmissionbt.com/",
    "description": "Fast, easy, Free Bittorrent client. (Source Code) GPL-3.0 C"
  },
  {
    "name": "Minio",
    "url": "https://minio.io/",
    "description": "Minio is an open source object storage server compatible with Amazon S3 APIs. (Source Code) Apache-2.0 Go"
  },
  {
    "name": "Zenko CloudServer",
    "url": "https://www.zenko.io/cloudserver",
    "description": "Zenko CloudServer, an open-source Node.js implementation of a server handling the Amazon S3 protocol. (Source Code) Apache-2.0 Nodejs"
  },
  {
    "name": "BoZoN",
    "url": "https://github.com/broncowdd/BoZoN",
    "description": "Minimalist Drag and drop file sharing app. AGPL-3.0 PHP"
  },
  {
    "name": "Coquelicot",
    "url": "https://coquelicot.potager.org/",
    "description": "Coquelicot is a “one-click” file sharing web application with a focus on protecting users’ privacy. (Source Code) AGPL-3.0 Ruby"
  },
  {
    "name": "droppy",
    "url": "https://github.com/silverwind/droppy",
    "description": "droppy is a self-hosted cloud server with an interface similar to desktop file managers and has capabilities to edit files on-the-fly as well as view and playback media directly in the browser. (Demo) BSD Nodejs"
  },
  {
    "name": "FileShelter",
    "url": "https://github.com/epoupon/fileshelter",
    "description": "FileShelter is a self-hosted software that allows you to easily share files over the Internet. (Demo) GPL-3.0 C++"
  },
  {
    "name": "Files Sharing",
    "url": "https://github.com/axeloz/filesharing",
    "description": "Open Source and self-hosted files sharing application based on unique and temporary links. GPL-3.0 PHP"
  },
  {
    "name": "img.bi",
    "url": "https://github.com/imgbi/img.bi",
    "description": "img.bi is a secure image hosting. Images are encrypted using AES-256 with random key in browser before upload. GPL-3.0 Nodejs"
  },
  {
    "name": "ipfs.pics",
    "url": "https://github.com/ipfspics/server",
    "description": "ipfs.pics is a o distributed image hosting website. AGPL-3.0 PHP"
  },
  {
    "name": "Jirafeau",
    "url": "https://gitlab.com/mojo42/Jirafeau",
    "description": "Jirafeau is a web site permitting to upload a file in a simple way and give an unique link to it. (Demo) AGPL-3.0 PHP"
  },
  {
    "name": "linx",
    "url": "https://github.com/andreimarcu/linx-server",
    "description": "File sharing application and pastebin with API, auto-expiry, deletion keys, and web seed support. (Demo) GPL-3.0 Go"
  },
  {
    "name": "lufi",
    "url": "https://git.framasoft.org/luc/lufi",
    "description": "Let's Upload that FIle, client-side encrypted. (Demo, Source Code) AGPL-3.0 Perl"
  },
  {
    "name": "lutim",
    "url": "https://github.com/ldidry/lutim",
    "description": "Let's Upload That Image. AGPL-3.0 Perl"
  },
  {
    "name": "Nimbus",
    "url": "https://github.com/ethanal/nimbus",
    "description": "Drag-and-drop shortlink file sharer for OS X. MIT Python"
  },
  {
    "name": "OnionShare",
    "url": "https://github.com/micahflee/onionshare",
    "description": "Securely and anonymously share a file of any size. GPL-2.0 Python"
  },
  {
    "name": "PictShare",
    "url": "https://www.pictshare.net/",
    "description": "PictShare is a multi lingual, open source image hosting service with a simple resizing and upload API. (Demo, Source Code) Apache-2.0 PHP"
  },
  {
    "name": "Plik",
    "url": "https://github.com/root-gg/plik",
    "description": "Plik is a scalable and friendly temporary file upload system. (Demo) MIT Go"
  },
  {
    "name": "Pomf",
    "url": "https://github.com/Pomf/Pomf",
    "description": "Simple file uploading and sharing, source for the now shut down site Pomf.se. MIT PHP"
  },
  {
    "name": "ProjectSend",
    "url": "http://www.projectsend.org/",
    "description": "Upload files and assign them to specific clients you create. Give access to those files to your clients. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "PsiTransfer",
    "url": "https://github.com/psi-4ward/psitransfer",
    "description": "Simple open source self-hosted file sharing solution with robust up-/download-resume and password protection. (Demo) BSD Nodejs"
  },
  {
    "name": "Sharry",
    "url": "https://github.com/eikek/sharry",
    "description": "Share files easily over the internet between authenticated and anonymous users (both ways) with resumable up- and downloads. (Demo) GPL-3.0 Scala/Java"
  },
  {
    "name": "Uguu",
    "url": "https://uguu.se/",
    "description": "Stores files and deletes after X amount of time. (Source Code) MIT PHP"
  },
  {
    "name": "Up1",
    "url": "https://github.com/Upload/Up1",
    "description": "Client-side Encrypted Image Host. MIT Nodejs"
  },
  {
    "name": "uPste",
    "url": "https://u.pste.pw",
    "description": "Private file hosting application with an emphasis on serving technology communities. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "YouTransfer",
    "url": "http://www.youtransfer.io",
    "description": "YouTransfer is a simple but elegant self-hosted file transfer and sharing solution. (Demo, Source Code) Apache-2.0 Nodejs"
  },
  {
    "name": "Beauties",
    "url": "https://github.com/dsx/beauties",
    "description": "Minimalist file sharing written in Go, to be used primarily from Unix shell (e.g. with curl). Can be built as a Debian package for easy install. MIT Go"
  },
  {
    "name": "transfer.sh",
    "url": "https://transfer.sh",
    "description": "Easy file sharing from the command line. (Source Code) MIT Go"
  },
  {
    "name": "Apaxy",
    "url": "https://oupala.github.io/apaxy/",
    "description": "Theme built to enhance the experience of browsing web directories, using the mod_autoindex Apache module and some CSS to override the default style of a directory listing. (Source Code) Unlicense HTML"
  },
  {
    "name": "DirectoryLister",
    "url": "http://www.directorylister.com/",
    "description": "Simple PHP based directory lister that lists a directory and all it's sub-directories and allows you to navigate there within. (Source Code) MIT PHP"
  },
  {
    "name": "Encode Explorer",
    "url": "http://encode-explorer.siineiolekala.net/",
    "description": "Encode Explorer is a single page file browser, it is simple and functional. (Demo, Source Code) MIT PHP"
  },
  {
    "name": "explorer",
    "url": "https://github.com/soyuka/explorer",
    "description": "Highly-configurable directory listing made with nodejs. (Source Code) MIT Nodejs"
  },
  {
    "name": "eXtplorer",
    "url": "http://extplorer.net/",
    "description": "PHP and Javascript based File Manager. (Source Code) MPL-1.1/GPL-2.0 PHP"
  },
  {
    "name": "filemanager",
    "url": "https://henriquedias.com/filemanager/",
    "description": "Web File Manager which can be used as a middleware or standalone app. (Source Code) Apache-2.0 Go/VueJS"
  },
  {
    "name": "goBrowser",
    "url": "https://github.com/xataz/gobrowser",
    "description": "Simple http file browser. (Source Code) GPL-3.0 Go"
  },
  {
    "name": "h5ai",
    "url": "https://larsjung.de/h5ai/",
    "description": "Modern file indexer for HTTP web servers with focus on your files. Directories are displayed in a appealing way and browsing them is enhanced by different views, a breadcrumb and a tree overview. (Demo, Source Code) MIT PHP"
  },
  {
    "name": "IFM",
    "url": "https://github.com/misterunknown/ifm/",
    "description": "Single script file manager. MIT PHP"
  },
  {
    "name": "ResourceSpace",
    "url": "https://www.resourcespace.com",
    "description": "ResourceSpace open source digital asset management software is the simple, fast, and free way to organise your digital assets. (Demo, Source Code) Other PHP"
  },
  {
    "name": "Sprut.io",
    "url": "https://sprut.io",
    "description": "2 panel file manager with drag and drop features, code editor, text search, hotkeys. (Demo, Source Code) GPL-3.0 Python"
  },
  {
    "name": "Surfer",
    "url": "https://github.com/nebulade/surfer",
    "description": "Simple static file server with webui to manage files. MIT Nodejs"
  },
  {
    "name": "TagSpaces",
    "url": "https://www.tagspaces.org/",
    "description": "TagSpaces is an offline, cross-platform file manager and organiser that also can function as a note taking app. The WebDAV version of the application can be installed on top of a WebDAV servers such as Nextcloud or ownCloud. (Demo, Source Code) AGPL-3.0 Javascript"
  },
  {
    "name": "0hh1",
    "url": "https://github.com/Q42/0hh1",
    "description": "Lovely little logic game by Q42. (Demo) MIT HTML5"
  },
  {
    "name": "A Dark Room",
    "url": "https://github.com/doublespeakgames/adarkroom",
    "description": "Minimalist text adventure game for your browser. (Demo) MPL-2.0 HTML5"
  },
  {
    "name": "Agar.IO Clone",
    "url": "https://github.com/huytd/agar.io-clone",
    "description": "Agar.io clone written with Socket.IO and HTML5 canvas. MIT Nodejs"
  },
  {
    "name": "battlecraft",
    "url": "https://github.com/jbreindel/battlecraft",
    "description": "Fully distributed multiplayer browser game. (Demo) Apache-2.0 Erlang"
  },
  {
    "name": "Clumsy Bird",
    "url": "https://github.com/ellisonleao/clumsy-bird",
    "description": "MelonJS port of the famous Flappy Bird Game. (Demo) MIT Nodejs"
  },
  {
    "name": "elevatorsaga",
    "url": "http://play.elevatorsaga.com/",
    "description": "The elevator programming game. (Source Code) MIT Javascript"
  },
  {
    "name": "Hextris",
    "url": "https://github.com/Hextris/hextris",
    "description": "Fast paced HTML5 puzzle game inspired by Tetris. (Demo) GPL-3.0 HTML5"
  },
  {
    "name": "Lila",
    "url": "https://lichess.org/",
    "description": "The forever free, adless and open source chess server powering lichess.org, with official iOS and Android client apps. (Source Code) AGPL-3.0 Scala"
  },
  {
    "name": "Posio",
    "url": "https://github.com/abrenaut/posio/",
    "description": "Geography multiplayer game. (Demo) MIT Python"
  },
  {
    "name": "SourceBans++",
    "url": "https://sbpp.github.io",
    "description": "Admin, ban, and communication management system for games running on the Source engine. (Source Code) CC-BY-SA-4.0 PHP"
  },
  {
    "name": "Spyfall",
    "url": "https://github.com/mpcovcd/spyfall",
    "description": "Fan made web version of the Spyfall party game. (Demo) MIT HTML/Javascript"
  },
  {
    "name": "TournamentMango",
    "url": "http://tournamentmango.com/",
    "description": "TournamentMango is an open source tournament bracket and user management system. You can build an archive of players and keep track of all their scores over time as well as their regular characters, games, and aliases. (Source Code) MIT Javascript"
  },
  {
    "name": "GateOne",
    "url": "http://liftoffsoftware.com/Products/GateOne",
    "description": "Gate One is an HTML5 web-based terminal emulator and SSH client. (Source Code) AGPL-3.0 Python"
  },
  {
    "name": "Guacamole",
    "url": "http://guac-dev.org/",
    "description": "Guacamole is a clientless remote desktop gateway. It supports standard protocols like VNC and RDP. (Source Code) Apache-2.0 Java/C"
  },
  {
    "name": "oneye",
    "url": "https://oneye-project.org/",
    "description": "Cloud software to access your data from everywhere with any browser. (Demo, Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "OS.js",
    "url": "https://os.js.org/",
    "description": "Desktop implementation for your browser with a fully-fledged window manager, Application APIs, GUI toolkits and filesystem abstraction. (Demo, Source Code) BSD Nodejs"
  },
  {
    "name": "Citadel",
    "url": "http://www.citadel.org/doku.php",
    "description": "Groupware including email, calendar/scheduling, address books, forums, mailing lists, IM, wiki and blog engines, RSS aggregation and more. (Source Code) GPL-3.0 C"
  },
  {
    "name": "Cozy Cloud",
    "url": "https://cozy.io",
    "description": "Personal cloud where you can read your emails or manage and sync your contact, files or calendars, with an app store full of community contributions. (Source Code) GPL-3.0 Nodejs"
  },
  {
    "name": "egroupware",
    "url": "http://www.egroupware.org/",
    "description": "Software suite including calendars, address books, notepad, project management tools, client relationship management tools (CRM), knowledge management tools, a wiki and a CMS. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Horde",
    "url": "http://www.horde.org/",
    "description": "The Horde Project is about creating high quality Open Source applications and libraries, based on PHP and the Horde Framework. (Demo, Source Code) GPL-2.0 PHP"
  },
  {
    "name": "HRCloud2",
    "url": "https://www.honestrepair.net/index.php/hrcloud2/",
    "description": "Full-featured home hosted Cloud Drive, Personal Assistant, App Launcher, File Converter, Streamer, Share Tool and more. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Kolab",
    "url": "https://kolab.org/",
    "description": "Kolab community is a unified communication and collaboration system. (Source Code) GPL-2.0/LGPL-2.1/GPL-3.0 C++/Python/PHP"
  },
  {
    "name": "Kopano",
    "url": "https://kopano.com/",
    "description": "Groupware suite including e-mail, calendars, tasks, todos and notes. Featuring a modern WebApp, DeskApp and mobile access over Z-Push/ActiveSync. (Demo, Source Code) AGPL-3.0 C/Python/PHP"
  },
  {
    "name": "Openmeetings",
    "url": "https://openmeetings.apache.org/index.html",
    "description": "Openmeetings provides video conferencing, instant messaging, white board, collaborative document editing and other groupware tools using API functions of the Red5 Streaming Server for Remoting and Streaming. (Source Code) Apache-2.0 Java"
  },
  {
    "name": "SOGo",
    "url": "https://sogo.nu/",
    "description": "SOGo offers multiple ways to access the calendaring and messaging data. CalDAV, CardDAV, GroupDAV, as well as ActiveSync, including native Outlook compatibility and Web interface. (Demo, Source Code) LGPL-2.1 Objective-C"
  },
  {
    "name": "Tine 2.0",
    "url": "https://www.tine20.org",
    "description": "Contacts, Calendar, Tasks, WebDAV, ActiveSync, VOIP, Mail-Client, CRM, Sales, Projects, Timetracker. (Demo, Source Code) AGPL-3.0/Other PHP"
  },
  {
    "name": "Zimbra Collaboration",
    "url": "https://www.zimbra.com/",
    "description": "Email, calendar, collaboration server with Web interface and lots of integrations. (Source Code) GPL-2.0/CPAL-1.0 Java"
  },
  {
    "name": "admidio",
    "url": "https://www.admidio.org/",
    "description": "Admidio is a free open source user management system for websites of organizations and groups. The system has a flexible role model so that it’s possible to reflect the structure and permissions of your organization. (Demo, Source Code) GPL-2.0 PHP"
  },
  {
    "name": "IceHrm",
    "url": "https://icehrm.com/",
    "description": "IceHrm employee management system allows companies to centralize confidential employee information. (Demo, Source Code) Apache-2.0 PHP"
  },
  {
    "name": "OrangeHRM",
    "url": "https://www.orangehrm.com/",
    "description": "OrangeHRM is a comprehensive HRM system that captures all the essential functionalities required for any enterprise. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Sentrifugo",
    "url": "http://www.sentrifugo.com/",
    "description": "Sentrifugo is a HRM system that can be easily configured to meet your organizational needs. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "TimeOff.Management",
    "url": "https://timeoff.management",
    "description": "Simple yet powerful absence management software for small and medium size business. (Demo, Source Code) MIT Nodejs"
  },
  {
    "name": "Canvas LMS",
    "url": "https://www.canvaslms.com/",
    "description": "Canvas is the trusted, open-source learning management system (LMS) that is revolutionizing the way we educate. (Demo, Source Code) AGPL-3.0 Ruby"
  },
  {
    "name": "Chamilo LMS",
    "url": "https://chamilo.org/chamilo-lms/",
    "description": "Chamilo LMS allows you to create a virtual campus for the provision of online or semi-online training. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "edX",
    "url": "https://www.edx.org/",
    "description": "The Open edX platform is open-source code that powers edX.org. (Source Code) AGPL-3.0 Python"
  },
  {
    "name": "ILIAS",
    "url": "http://www.ilias.de",
    "description": "ILIAS is the Learning Management System that can cope with anything you throw at it. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "lxHive",
    "url": "http://www.lxhive.com/",
    "description": "Open Source ExperienceAPI compliant Learning Record Store (LRS) - previously code-named TinCanAPI. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Mahara",
    "url": "https://mahara.org/",
    "description": "Open Source fully featured web application to build students electronic portfolio. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Moodle",
    "url": "https://moodle.org/",
    "description": "Moodle is a learning and courses platform with one of the largest open source communities worldwide. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Open eClass",
    "url": "http://www.openeclass.org/",
    "description": "Open eClass is an advanced e-learning solution that can enhance the teaching and learning process. (Demo, Source Code) GPL-2.0 PHP"
  },
  {
    "name": "RELATE",
    "url": "https://documen.tician.de/relate/",
    "description": "RELATE is a web-based courseware package, includes features such as: flexible rules, statistics, multi-course support, class calendar. (Source Code) MIT Python"
  },
  {
    "name": "Sakai",
    "url": "https://www.sakaiproject.org/",
    "description": "The Sakai project provides a flexible and feature-rich environment for teaching, learning, research and other collaboration. (Demo, Source Code) ECL-2.0 Java"
  },
  {
    "name": "SchoolTool",
    "url": "http://schooltool.org/",
    "description": "SchoolTool is free administrative software for schools. It includes demographics, gradebook, attendance, calendaring, reporting and more for primary and secondary schools. (Source Code) GPL-2.0 Python"
  },
  {
    "name": "Graphhopper",
    "url": "https://graphhopper.com/",
    "description": "Fast routing library and server using OpenStreetMap. (Source Code) Apache-2.0 Java"
  },
  {
    "name": "MapBBCodeShare",
    "url": "https://github.com/MapBBCode/share.mapbbcode.org",
    "description": "Tool for sharing custom OSM maps. Support for annotated markers, polygons, lines, multi-format import/export, multiple layers, shortlinks. (Demo) WTFPL/Other PHP"
  },
  {
    "name": "OpenGTS",
    "url": "http://www.opengts.org/",
    "description": "Entry-level fleet tracking system. Supports variety of tracking devices and protocols. Comes with rich web-interface and reporting features. (Demo, Source Code) Apache-2.0 Java"
  },
  {
    "name": "OpenStreetMap",
    "url": "http://www.openstreetmap.org/",
    "description": "OpenStreetMap is a map of the world, created by people like you and free to use under an open license. (Source Code) GPL-2.0 Ruby"
  },
  {
    "name": "Orion",
    "url": "https://github.com/LINKIWI/orion-web",
    "description": "Powerful OwnTracks API-compliant location data visualization frontend for the web. (Demo) MIT Python/Nodejs"
  },
  {
    "name": "OwnTracks Recorder ⚠",
    "url": "https://github.com/owntracks/recorder",
    "description": "Store and access data published by OwnTracks location tracking apps. GPL-2.0 C/Lua"
  },
  {
    "name": "TileServer GL",
    "url": "http://tileserver.readthedocs.io/",
    "description": "Vector and raster maps with GL styles. Server side rendering by Mapbox GL Native. Map tile server for Mapbox GL JS, Android, iOS, Leaflet, OpenLayers, GIS via WMTS, etc. (Source Code) Multiple Nodejs"
  },
  {
    "name": "TileServer PHP",
    "url": "https://github.com/klokantech/tileserver-php",
    "description": "Serve map tiles from any PHP hosting. BSD PHP"
  },
  {
    "name": "Traccar",
    "url": "https://www.traccar.org/",
    "description": "Java application to track GPS positions. Supports loads of tracking devices and protocols, has an Android and iOS App. Has a web interface to view your trips. (Demo, Source Code) Apache-2.0 Java"
  },
  {
    "name": "uMap",
    "url": "https://umap.openstreetmap.fr/en/",
    "description": "Create maps with OpenStreetMap layers in a minute and embed them in your site. (Source Code) WTFPL Python"
  },
  {
    "name": "Darwin Streaming Server",
    "url": "https://macosforge.github.io/dss/",
    "description": "High performance server for streaming QuickTime and MPEG-4 media over RTP and RTSP protocols. Originated as Apple’s QTSS. (Source Code) APSL-2.0 C++"
  },
  {
    "name": "Flumotion",
    "url": "http://flumotion.net/",
    "description": "Streaming media server with intuitive graphical administration tools. (Source Code) LGPL-2.1 Python"
  },
  {
    "name": "homehost ⚠",
    "url": "https://github.com/ridhwaans/homehost",
    "description": "Self-hosted React + Redux app that streams your media collection (music, movies, books, podcasts, comics etc). MIT Nodejs"
  },
  {
    "name": "Icecast 2",
    "url": "http://www.icecast.org/",
    "description": "streaming audio/video server which can be used to create an Internet radio station or a privately running jukebox and many things in between. (Source Code, Clients) GPL-2.0 C"
  },
  {
    "name": "MistServer",
    "url": "http://mistserver.org/",
    "description": "Streaming media server that works well in any streaming environment. (Source Code) AGPL-3.0 C++"
  },
  {
    "name": "ReadyMedia",
    "url": "http://sourceforge.net/projects/minidlna/",
    "description": "Simple media server software, with the aim of being fully compliant with DLNA/UPnP-AV clients. GPL-2.0 C"
  },
  {
    "name": "Rygel",
    "url": "https://wiki.gnome.org/action/show/Projects/Rygel",
    "description": "Rygel is a UPnP AV MediaServer that allows you to easily share audio, video, and pictures. Media player software may use Rygel to become a MediaRenderer that may be controlled remotely by a UPnP or DLNA Controller. GPL-3.0 C"
  },
  {
    "name": "üWave ⚠",
    "url": "http://u-wave.net/",
    "description": "üWave is a self-hosted collaborative listening platform. Users take turns playing media—songs, talks, gameplay videos, or anything else—from a variety of media sources like YouTube and SoundCloud. (Demo, Source Code) MIT Nodejs"
  },
  {
    "name": "Ampache",
    "url": "http://ampache.org/",
    "description": "Web based audio/video streaming application. (Demo, Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Beets",
    "url": "http://beets.io/",
    "description": "Music library manager and MusicBrainz tagger (command-line and Web interface). (Source code) MIT Python"
  },
  {
    "name": "CherryMusic",
    "url": "http://www.fomori.org/cherrymusic/",
    "description": "Minimalistic Web-Mediaplayer. (Source Code) GPL-3.0 Python"
  },
  {
    "name": "cloudtunes ⚠",
    "url": "https://github.com/jkbrzt/cloudtunes",
    "description": "Web-based music player for the cloud. MIT Python"
  },
  {
    "name": "Compactd",
    "url": "https://github.com/compactd/compactd",
    "description": "Remote music player that supports adding content. MIT Nodejs"
  },
  {
    "name": "FriendsRadio ⚠",
    "url": "https://github.com/xouabita/friends-radio",
    "description": "Share music with your friends from Youtube and Soundcloud. (Demo) MIT Nodejs"
  },
  {
    "name": "Funkwhale",
    "url": "https://funkwhale.audio/",
    "description": "A modern, web-based, convivial, multi-user and free music server. (Demo, Source Code) BSD-3-Clause Python/Django"
  },
  {
    "name": "GNU FM",
    "url": "https://gnu.io/fm/",
    "description": "Running music community websites, alternative to last.fm. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Groove Basin",
    "url": "https://github.com/andrewrk/groovebasin",
    "description": "Music player server with a web-based user interface inspired by Amarok 1.4. MIT Nodejs"
  },
  {
    "name": "Icecast 2",
    "url": "http://www.icecast.org/",
    "description": "streaming audio/video server which can be used to create an Internet radio station or a privately running jukebox and many things in between. (Source Code) GPL-2.0 C"
  },
  {
    "name": "koel",
    "url": "http://koel.phanan.net/",
    "description": "Personal music streaming server that works. (Source Code) MIT PHP"
  },
  {
    "name": "Libresonic",
    "url": "http://libresonic.org/",
    "description": "Open-source web-based media streamer and jukebox. A fork of Subsonic's last open-source release, before it switched licenses. GPL-3.0 Java"
  },
  {
    "name": "LibreTime",
    "url": "http://libretime.org",
    "description": "Simple, open source platform that lets you broadcast streaming radio on the web (fork of Airtime). (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Mopidy",
    "url": "http://mopidy.readthedocs.org/",
    "description": "Extensible music server. Offers a superset of the mpd API, as well as integration with 3rd party services like Spotify, SoundCloud etc. (Source Code) Apache-2.0 Python"
  },
  {
    "name": "Moped",
    "url": "https://github.com/martijnboland/moped",
    "description": "Responsive HTML5 + Javascript client for the Mopidy music server. MIT HTML5"
  },
  {
    "name": "Mopidy MusicBox",
    "url": "https://github.com/pimusicbox/mopidy-musicbox-webclient",
    "description": "Web Client for Mopidy Music Server. Apache-2.0 HTML5"
  },
  {
    "name": "Mopidy-Party",
    "url": "https://github.com/Lesterpig/mopidy-party",
    "description": "Mopidy web extension designed for party! Let your guests manage the sound. Apache-2.0 Python"
  },
  {
    "name": "mpd",
    "url": "http://www.musicpd.org/",
    "description": "Daemon to remotely play music, stream music, handle and organize playlists. Many clients available. GPL-2.0 C++"
  },
  {
    "name": "ympd",
    "url": "http://www.ympd.org/",
    "description": "Standalone MPD Web GUI written in C, utilizing Websockets and Bootstrap/JS. (Source Code) GPL-2.0 C"
  },
  {
    "name": "mStream",
    "url": "http://mstream.io/",
    "description": "Music streaming server with GUI management tools. Runs on Mac, Windows, and Linux. (Demo, Source Code) GPL-2.0 Nodejs"
  },
  {
    "name": "Music Browser",
    "url": "https://github.com/henrik242/musicbrowser",
    "description": "Browser and streamer for your music collection. It is runs on most operating systems, and is light enough to run flawlessly on NAS devices. GPL-3.0 PHP"
  },
  {
    "name": "musikcube",
    "url": "https://musikcube.com/",
    "description": "Streaming audio server with Linux/macOS/Windows/Android clients. (Source code) BSD-3-Clause C++"
  },
  {
    "name": "Sonerezh",
    "url": "https://www.sonerezh.bzh/",
    "description": "Self-hosted, web-based application for stream your music, everywhere. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "crtmpserver",
    "url": "https://packages.debian.org/stable/crtmpserver",
    "description": "High performance RTMP/RTSP streaming server. GPL-3.0 C++"
  },
  {
    "name": "CyTube",
    "url": "https://github.com/calzoneman/sync",
    "description": "CyTube is a web application providing media synchronization, chat, and more for an arbitrary number of channels. (Demo) MIT Nodejs"
  },
  {
    "name": "Emby",
    "url": "https://emby.media/",
    "description": "Home media server supporting both DLNA and DIAL (Chromecast) devices out-of-the-box. (Source Code) GPL-2.0 C#"
  },
  {
    "name": "Hellowlol HTPC Manager fork",
    "url": "https://github.com/Hellowlol/HTPC-Manager",
    "description": "Fully responsive interface to manage all your favorite media on your HTPC. (Source Code) MIT Python"
  },
  {
    "name": "Icecast 2",
    "url": "http://www.icecast.org/",
    "description": "streaming audio/video server which can be used to create an Internet radio station or a privately running jukebox and many things in between. (Source Code, Clients) GPL-2.0 C"
  },
  {
    "name": "MistServer",
    "url": "http://mistserver.org/",
    "description": "Streaming media server that works well in any streaming environment. (Source Code) AGPL-3.0 C++"
  },
  {
    "name": "Myflix",
    "url": "https://github.com/pastapojken/Myflix",
    "description": "Self-hosted, super lightweight Netflix alternative. MIT Shell"
  },
  {
    "name": "Odd Networks",
    "url": "http://oddnetworks.com",
    "description": "Open source video management system (VMS) and API for collections and videos with supporting SDKs for Roku, Apple iOS/tvOS, Google Android, and Amazon FireTV. (Source Code) MIT Nodejs"
  },
  {
    "name": "PeerTube",
    "url": "https://framagit.org/chocobozzz/PeerTube",
    "description": "Decentralized video streaming platform using P2P (BitTorrent) directly in the web browser. AGPL-3.0 Nodejs"
  },
  {
    "name": "Restreamer",
    "url": "https://datarhei.github.io/restreamer/",
    "description": "Restreamer allows you to do h.264 real-time video streaming on your website without a streaming provider. (Source Code) Apache-2.0 Nodejs/Docker"
  },
  {
    "name": "Shinobi",
    "url": "https://moeiscool.github.io/Shinobi/",
    "description": "Open Source CCTV software written in Node with both IP and local camera support. (Source Code) GPL-2.0 Nodejs"
  },
  {
    "name": "Streama",
    "url": "https://github.com/dularion/streama",
    "description": "Self-hosted Netflix alternative. MIT Java"
  },
  {
    "name": "VideoLAN Client (VLC)",
    "url": "https://www.videolan.org/",
    "description": "Cross-platform multimedia player client and server supporting most multimedia files as well as DVDs, Audio CDs, VCDs, and various streaming protocols. (Source Code) Multiple C"
  },
  {
    "name": "Zoneminder",
    "url": "https://github.com/ZoneMinder/ZoneMinder",
    "description": "Closed-circuit television (CCTV) software application which supports IP, USB and Analog cameras. GPL-2.0 PHP"
  },
  {
    "name": "411",
    "url": "https://demo.fouroneone.io/",
    "description": "Alert Management Web Application. (Source Code) MIT PHP"
  },
  {
    "name": "Anchr",
    "url": "https://anchr.io",
    "description": "Anchr is a toolbox for tiny tasks on the internet, including bookmark collections, URL shortening and (encrypted) image uploads. (Source Code) GPL-3.0 Nodejs"
  },
  {
    "name": "asciiflow",
    "url": "http://asciiflow.com/",
    "description": "Flow Diagram Drawing Tool. (Source Code) GPL-3.0 Java/JavaScript"
  },
  {
    "name": "blynk",
    "url": "http://www.blynk.cc/",
    "description": "Platform with iOs and Android apps to control Arduino, ESP8266, Raspberry Pi and similar microcontroller boards over the Internet. (Source Code) AGPL-3.0 Java"
  },
  {
    "name": "CUPS",
    "url": "https://www.cups.org/",
    "description": "The Common Unix Print System uses Internet Printing Protocol (IPP) to support printing to local and network printers. (Source Code) GPL-2.0 C"
  },
  {
    "name": "DomainMOD",
    "url": "https://domainmod.org",
    "description": "Application to manage your domains and other internet assets in a central location. DomainMOD includes a Data Warehouse framework that allows you to import your WHM/cPanel web server data so that you can view, export, and report on your data. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "EasyBook Project",
    "url": "http://easybook-project.org/",
    "description": "Book publishing as easy as it should be. (Source Code) MIT PHP"
  },
  {
    "name": "Flox ⚠",
    "url": "https://github.com/devfake/flox",
    "description": "Self hosted movie, TV series and anime watch list with a 3-point rating system. Uses The Movie Database backend for information. (Demo) MIT PHP"
  },
  {
    "name": "formspree ⚠",
    "url": "https://formspree.io/",
    "description": "Just send your form to our URL and we'll forward it to your email. No PHP, Javascript or sign up required. (Demo, Source Code) AGPL-3.0 Python"
  },
  {
    "name": "GeneWeb",
    "url": "https://geneweb.tuxfamily.org/wiki/GeneWeb",
    "description": "GeneWeb is an open source genealogy software written in OCaml. It comes with a Web interface and can be used off-line or as a Web service. (Demo, Source Code) GPL-2.0 OCAML"
  },
  {
    "name": "How Secure Is My Password",
    "url": "https://github.com/howsecureismypassword/hsimp",
    "description": "Rather than just saying a password is \"weak\" or \"strong\", How Secure is My Password? lets your users know how long it would take someone to crack their password. (Demo) MIT Javascript"
  },
  {
    "name": "google-webfonts-helper ⚠",
    "url": "https://github.com/majodev/google-webfonts-helper",
    "description": "Hassle-Free Way to Self-Host Google Fonts. Get eot, ttf, svg, woff and woff2 files + CSS snippets. (Demo) MIT Nodejs"
  },
  {
    "name": "Kimai",
    "url": "http://www.kimai.org/",
    "description": "Simple time and project tracking. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "King Phisher",
    "url": "https://github.com/securestate/king-phisher",
    "description": "King Phisher is a tool for testing and promoting user awareness by simulating real world phishing attacks. BSD Python"
  },
  {
    "name": "LicAPI",
    "url": "https://projects.miguelpiedrafita.com/LicAPI",
    "description": "PHP API to manage license info. (Source Code) MPL-2.0 PHP"
  },
  {
    "name": "Mindmaps",
    "url": "https://github.com/drichard/mindmaps",
    "description": "Open source, offline capable, mind mapping application. (Demo) AGPL-3.0 HTML5"
  },
  {
    "name": "Monica",
    "url": "https://monicahq.com/",
    "description": "Personal relationship manager, and a new kind of CRM to organize interactions with your friends and family. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Musical Artifacts",
    "url": "https://musical-artifacts.com/",
    "description": "Helping to catalog, preserve and free the artifacts you need to produce music. (Source Code) MIT Ruby"
  },
  {
    "name": "My Mind",
    "url": "https://github.com/ondras/my-mind",
    "description": "Web application for creating and managing mind maps. (Demo) MIT Javascript"
  },
  {
    "name": "nnmm",
    "url": "https://nnmm.nl/",
    "description": "Super tiny pastebin/url minifier \"microservice\". (Source Code) Beerware PHP"
  },
  {
    "name": "Notica",
    "url": "https://notica.us",
    "description": "Lets you send browser notifications from your terminal to your desktop or phone. No installation or registration is required. (Source Code) MIT Nodejs"
  },
  {
    "name": "revealjs",
    "url": "https://revealjs.com",
    "description": "Framework for easily creating beautiful presentations using HTML (Demo, Source Code) MIT JavaScript"
  },
  {
    "name": "SANE Network Scanning",
    "url": "http://sane-project.org/",
    "description": "Allow remote clients to access image acquisition devices (scanners) available on the local host. (Source Code) GPL-2.0 C"
  },
  {
    "name": "Skygear",
    "url": "https://skygear.io",
    "description": "Complete backend server for web, mobile and iOT applcations. (Demo, Source Code) Apache-2.0 Go"
  },
  {
    "name": "Trello Burndown ⚠",
    "url": "https://github.com/swordbeta/trello-burndown",
    "description": "Easy to use SCRUM burndown chart for Trello boards. MIT Go/Docker"
  },
  {
    "name": "Ulterius",
    "url": "https://ulterius.io",
    "description": "Ulterius is an open-source remote desktop software with lots of awesome functions. (Demo, Source Code) MPL-2.0 C#"
  },
  {
    "name": "ViMbAdmin",
    "url": "http://www.vimbadmin.net/",
    "description": "Provides a web based virtual mailbox administration system to allow mail administrators to easily manage domains, mailboxes and aliases. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "visualCaptcha",
    "url": "http://visualcaptcha.net/",
    "description": "Configurable captcha solution, focusing on accessibility and simplicity whilst maintaining security. (Demo, Source Code) MIT PHP/Nodejs/Ruby/Python"
  },
  {
    "name": "Web fonts repository — A simple webfont hosting. Google Fonts alternative for your own fonts. MIT PHP",
    "url": "https://github.com/Finesse/web-fonts-repository"
  },
  {
    "name": "webtrees",
    "url": "https://www.webtrees.net",
    "description": "Webtrees is the web's leading on-line collaborative genealogy application. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Akaunting",
    "url": "https://akaunting.com/",
    "description": "Akaunting is a free, online and open source accounting software designed for small businesses and freelancers. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Benedetto",
    "url": "https://github.com/arecker/bennedetto",
    "description": "Bennedetto is a simple, turn-based budget management app. GPL-3.0 Python"
  },
  {
    "name": "Budget App",
    "url": "https://www.budgetapp.io/",
    "description": "Budget App is an open source personal budgeting application. (Demo, Source Code) Apache-2.0 Java"
  },
  {
    "name": "Dot Ledger",
    "url": "https://www.dotledger.com/",
    "description": "Web-based personal finance management tool. (Demo, Source Code) Apache-2.0 Ruby"
  },
  {
    "name": "Economizzer",
    "url": "http://www.economizzer.org/",
    "description": "Economizzer is a simple and open source personal finance manager system, available in English, Portuguese (PT|BR) and Russian. (Source Code) MIT PHP"
  },
  {
    "name": "ExMoney",
    "url": "https://github.com/gaynetdinov/ex_money",
    "description": "Self-hosted personal finance app. ISC Elixir"
  },
  {
    "name": "Firefly III",
    "url": "https://firefly-iii.org/",
    "description": "Firefly III is a modern financial manager. It helps you to keep track of your money and make budget forecasts. It supports credit cards, shared household accounts, and savings accounts. It's powered by Laravel and requires PHP7.1. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Galette",
    "url": "http://galette.eu/dc/",
    "description": "Galette is a membership management web application towards non profit organizations. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "GRR",
    "url": "http://grr.devome.com/?lang=en",
    "description": "Assets management and booking for small/medium companies. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Hospital Run",
    "url": "http://hospitalrun.io/",
    "description": "Hospital Run is offline enabled hospital management software. (Source Code, Demo) GPL-3.0 Nodejs"
  },
  {
    "name": "Inventaire",
    "url": "https://inventaire.io/welcome",
    "description": "Collaborative resources mapper project, while yet only focused on exploring books mapping with wikidata and ISBNs. (Source Code) AGPL-3.0 Nodejs"
  },
  {
    "name": "Invoice Ninja",
    "url": "https://www.invoiceninja.org/",
    "description": "Powerful tool to invoice clients online. (Demo, Source Code) AAL PHP"
  },
  {
    "name": "InvoicePlane",
    "url": "https://invoiceplane.com/",
    "description": "Manage quotes, invoices, payments and customers for your small business. (Demo, Source Code) MIT PHP"
  },
  {
    "name": "IHateMoney",
    "url": "http://ihatemoney.org/",
    "description": "Manage your shared expenses, easily. (Source Code) BSD Python"
  },
  {
    "name": "PartKeepr",
    "url": "https://www.partkeepr.org",
    "description": "PartKeepr is an electronic part inventory management software. It helps you to keep track of your available parts and assist you with re-ordering parts. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "SilverStrike",
    "url": "https://silverstrike.tk/",
    "description": "Personal finance management made easy. (Demo, Source Code) MIT Python/Django"
  },
  {
    "name": "StockazNG",
    "url": "https://dev.sigpipe.me/dashie/StockazNG",
    "description": "Asset Management System. MIT Python"
  },
  {
    "name": "BulletNotes",
    "url": "https://bulletnotes.io/",
    "description": "Workflowy / Dynalist clone with Kanban (Trello) and Calendar functionality. Organize everything. (Source Code) MIT Nodejs"
  },
  {
    "name": "Boostnote",
    "url": "https://boostnote.io/",
    "description": "The note-taking app for programmers that focuses on markdown, snippets, and customizability. (Source Code) GPL-3.0 JavaScript"
  },
  {
    "name": "dillinger",
    "url": "http://dillinger.io/",
    "description": "The last Markdown editor, ever. (Source Code) MIT Nodejs"
  },
  {
    "name": "draw.io",
    "url": "https://draw.io",
    "description": "Diagram software for making flowcharts, process diagrams, org charts, UML, ER and network diagrams. (Source Code) Apache-2.0 JavaScript"
  },
  {
    "name": "HackMD",
    "url": "https://www.hackmd.io",
    "description": "Realtime collaborative markdown notes on all platforms. (Source Code) AGPL-3.0 Node.js"
  },
  {
    "name": "Laverna",
    "url": "https://laverna.cc/",
    "description": "Laverna is a Javascript note taking application with Markdown editor and encryption support. Consider it like open source alternative to Evernote. (Demo, Source Code) MPL-2.0 Nodejs"
  },
  {
    "name": "Leanote",
    "url": "http://leanote.org/",
    "description": "Leanote, Not Just A Notepad! Open source cloud notepad. (Demo, Source Code) GPL-2.0 Go"
  },
  {
    "name": "Markdown Edit",
    "url": "http://georgeosddev.github.com/markdown-edit/",
    "description": "Online markdown editor/viewer. (Source Code) MIT HTML5"
  },
  {
    "name": "Meemo",
    "url": "https://meemo.minimal-space.de/",
    "description": "Personal notes stream with Markdown support. (Source Code) MIT Nodejs"
  },
  {
    "name": "minimalist-web-notepad",
    "url": "https://github.com/pereorga/minimalist-web-notepad",
    "description": "Minimalist notepad.cc clone. Apache-2.0 PHP"
  },
  {
    "name": "MiniNote",
    "url": "https://github.com/n1try/mininote",
    "description": "Simple Markdown note-taking app with persistence. MIT Nodejs"
  },
  {
    "name": "notes",
    "url": "https://github.com/SSilence/notes",
    "description": "Simple script for personal notes with a single page with a WYSIWYG Editor. GPL-3.0 PHP"
  },
  {
    "name": "OpenNote",
    "url": "https://github.com/FoxUSA/OpenNote",
    "description": "OpenNote was built to be an open web-based alternative to Microsoft OneNote (T) and EverNote. (Demo) MIT HTML5"
  },
  {
    "name": "Paperwork",
    "url": "http://paperwork.rocks",
    "description": "OpenSource note-taking and archiving alternative to Evernote, Microsoft OneNote and Google Keep. (Source Code) MIT PHP"
  },
  {
    "name": "savepad",
    "url": "https://github.com/novavex/textpad",
    "description": "Minimalist notepad based on notepad.cc. MIT PHP"
  },
  {
    "name": "SiMPad",
    "url": "https://gitlab.com/beli3ver/SiMPad",
    "description": "Simple self-hosted Markdown notepad. (Demo) MIT PHP"
  },
  {
    "name": "ShareLaTex",
    "url": "https://www.sharelatex.com/",
    "description": "Web-based collaborative LaTeX editor. (Source Code) AGPL-3.0 Ruby"
  },
  {
    "name": "Standard Notes",
    "url": "https://standardnotes.org",
    "description": "Simple and private notes app. Protect your privacy while getting more done. That's Standard Notes. (Demo, Source Code) GPL-3.0 Ruby"
  },
  {
    "name": "to-markdown",
    "url": "https://domchristie.github.io/to-markdown/",
    "description": "HTML to Markdown converter written in JavaScript. (Source Code) MIT JavaScript"
  },
  {
    "name": "Turtl",
    "url": "https://turtl.it/",
    "description": "Totally private personal database and note taking app. (Source Code) GPL-3.0 CommonLisp"
  },
  {
    "name": "EtherCalc",
    "url": "https://ethercalc.org/",
    "description": "Web spreadsheet. (Source Code) CPAL-1.0/Other Nodejs"
  },
  {
    "name": "EtherDraw",
    "url": "https://github.com/JohnMcLear/draw",
    "description": "Intuitive collaborative drawing web based tool. Apache-2.0 Nodejs"
  },
  {
    "name": "Etherpad",
    "url": "http://etherpad.org/",
    "description": "Etherpad is a highly customizable Open Source online editor providing collaborative editing in really real-time. (Demo, Source Code) Apache-2.0 Nodejs"
  },
  {
    "name": "Infinoted",
    "url": "https://github.com/gobby/gobby/wiki/Dedicated%20Server",
    "description": "Server for Gobby, a multi-platform collaborative text editor. (Source Code) MIT C++"
  },
  {
    "name": "ONLYOFFICE",
    "url": "http://onlyoffice.org/",
    "description": "Office suite that enables you to manage documents, projects, team and customer relations in one place. (Source Code) AGPL-3.0 Nodejs"
  },
  {
    "name": "PHPOffice",
    "url": "https://github.com/PHPOffice",
    "description": "PHPOffice contains libraries which permits to write and read files from most office suites. LGPL-3.0 PHP"
  },
  {
    "name": "WebODF",
    "url": "http://webodf.org/",
    "description": "Tools and libraries to view and edit Open Document Format (ODF) files. (Source Code) AGPL-3.0 HTML5"
  },
  {
    "name": "Bitwarden",
    "url": "https://bitwarden.com/",
    "description": "Password manager with webapp, browser extension, and mobile app. (Source Code) AGPL-3.0 C#"
  },
  {
    "name": "keeweb",
    "url": "https://keeweb.info/",
    "description": "This webapp is a browser and desktop password manager compatible with KeePass databases. (Source Code) MIT HTML5"
  },
  {
    "name": "Passbolt",
    "url": "https://www.passbolt.com/",
    "description": "Password manager dedicated for managing passwords in a collaborative way on any Web server, using a MySQL database backend. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "sysPass",
    "url": "http://www.syspass.org/",
    "description": "Multiuser password management system. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Teampass",
    "url": "http://teampass.net/",
    "description": "Password manager dedicated for managing passwords in a collaborative way on any server Apache, MySQL and PHP. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "0bin",
    "url": "https://github.com/sametmax/0bin",
    "description": "Client side encrypted pastebin. WTFPL Python"
  },
  {
    "name": "CoderVault",
    "url": "https://github.com/codervault",
    "description": "Open source, self-hosted, snippet manager. (Source Code) MIT Ruby"
  },
  {
    "name": "cryptonote",
    "url": "https://cryptonote.me/",
    "description": "Simple open source web application that lets users encrypt and share messages that can only be read once. (Source Code) BSD Ruby"
  },
  {
    "name": "CryptPad",
    "url": "https://cryptpad.fr/",
    "description": "CryptPad is the zero knowledge realtime collaborative editor. (Source Code) AGPL-3.0 Nodejs"
  },
  {
    "name": "EdPaste",
    "url": "https://github.com/Edraens/EdPaste",
    "description": "Self-hosted pastebin written in Laravel (PHP Framework). MIT PHP"
  },
  {
    "name": "fiche",
    "url": "https://github.com/solusipse/fiche",
    "description": "Command line pastebin, all you need is netcat. (Demo) MIT C"
  },
  {
    "name": "gist",
    "url": "https://gitnet.fr/deblan/gist",
    "description": "GIST is an open-source application to share code. GPL-3.0 PHP"
  },
  {
    "name": "hastebin",
    "url": "http://hastebin.com/about.md",
    "description": "Open source pastebin written in node.js. (Demo, Source Code) MIT Nodejs"
  },
  {
    "name": "localpaste",
    "url": "https://github.com/petermaloney/localpaste",
    "description": "Simple python based pastebin you can run locally, with curl for input. Supports RAW text by default and binary data such as images (no extensions on returned url). GPL-2.0 Python"
  },
  {
    "name": "Modern Paste",
    "url": "https://www.modernpaste.com",
    "description": "Modern pastebin with a contemporary, minimalistic user interface backed by a robust feature set. (Demo, Source Code) MIT Python"
  },
  {
    "name": "mojopaste",
    "url": "http://search.cpan.org/dist/App-mojopaste/",
    "description": "Perl based pastebin. (Demo, Source Code) Artistic-2.0 Perl"
  },
  {
    "name": "NoteHub",
    "url": "https://notehub.org",
    "description": "Free and Hassle-free Pastebin for Markdown Pages. Simple, clean, password provided, generated-short link. (Demo, Source Code) MIT Nodejs"
  },
  {
    "name": "Paste",
    "url": "http://phpaste.sourceforge.io/",
    "description": "Paste is forked from the original source pastebin.com used before it was bought. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "pastebin",
    "url": "https://github.com/prologic/pastebin",
    "description": "Simple pastebin service with convenient api and CLI. (Demo) MIT Go"
  },
  {
    "name": "Pastebin",
    "url": "https://github.com/ewhal/Pastebin",
    "description": "Modern self-hosted pastebin service with a restful API. MIT Go"
  },
  {
    "name": "pb",
    "url": "https://github.com/ptpb/pb",
    "description": "Lightweight pastebin (and url shortener) built using flask. (Demo) GPL-3.0 Python"
  },
  {
    "name": "pbnh",
    "url": "https://github.com/bhanderson/pbnh",
    "description": "Pastebin inspired from project pb and hastebin, with an API and a SQL-based backend. MIT Python"
  },
  {
    "name": "Phaste",
    "url": "https://pste.pw",
    "description": "Phalcon-based, MySQL pastebin application with privacy-respecting Piwik integration and syntax highlighting. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "PrivateBin",
    "url": "https://privatebin.info/",
    "description": "PrivateBin is a minimalist, opensource online pastebin/discussion board where the server has zero knowledge of hosted data. (Demo, Source Code) Zlib PHP"
  },
  {
    "name": "SharpPaste",
    "url": "https://github.com/phonicmouse/SharpPaste",
    "description": "Cross-platform C# pastebin with client-side AES-256 encryption that just works. (Demo) MIT C#/ASP.NET"
  },
  {
    "name": "snipt",
    "url": "https://snipt.net/",
    "description": "Long-term memory for coders. Share and store code snippets. (Source Code) BSD Python"
  },
  {
    "name": "Stikked",
    "url": "https://github.com/claudehohl/Stikked",
    "description": "Advanced and beautiful pastebin. GPL-3.0 PHP"
  },
  {
    "name": "Sup3rS3cretMes5age",
    "url": "https://github.com/algolia/sup3rS3cretMes5age",
    "description": "Very simple (to deploy and to use) secret message service using Hashicorp Vault as a secrets storage. MIT Go"
  },
  {
    "name": "tastebin",
    "url": "https://github.com/andreineculau/tastebin",
    "description": "Updated version of hastebin plus additional features. Apache-2.0 Nodejs"
  },
  {
    "name": "Baby Buddy",
    "url": "https://github.com/cdubz/babybuddy",
    "description": "Helps caregivers track baby sleep, feedings, diaper changes, and tummy time. (Demo) BSD Python"
  },
  {
    "name": "DeviceHive",
    "url": "https://www.devicehive.com/",
    "description": "Open Source IoT Plaform with a wide range of integration options. (Demo, Source Code) Apache-2.0 Java"
  },
  {
    "name": "Dj Diabetes",
    "url": "https://github.com/foxmask/dj-diabetes",
    "description": "My Glucose Manager - follow your daily health. BSD Python"
  },
  {
    "name": "Habitica",
    "url": "https://habitica.com/",
    "description": "Habit tracker app which treats your goals like a Role Playing Game. Previously called HabitRPG. (Source Code) GPL-3.0/CC-BY-NC-SA-3.0/CC-BY-SA-3.0 Nodejs"
  },
  {
    "name": "Homepage",
    "url": "https://github.com/thetomester13/homepage",
    "description": "Simple, standalone, self-hosted PHP page that is your window to your server and the web. MIT PHP"
  },
  {
    "name": "iDashboard-PHP",
    "url": "https://github.com/causefx/iDashboard-PHP",
    "description": "HTPC Dashboard to load website services. MIT PHP"
  },
  {
    "name": "Iotdashboard",
    "url": "http://iotdashboard.pythonanywhere.com/en/",
    "description": "Fast Django server for IOT Devices. (Source Code) Apache-2.0 JavaScript"
  },
  {
    "name": "simple-dash",
    "url": "https://github.com/Swagielka/simple-dash",
    "description": "A simple, fully responsive Dashboard to forward to the services of your choice! MIT PHP"
  },
  {
    "name": "Thingsboard",
    "url": "https://thingsboard.io/",
    "description": "Open-source IoT Platform - Device management, data collection, processing and visualization. (Demo, Source Code) Apache-2.0 Java"
  },
  {
    "name": "Thingspeak",
    "url": "https://thingspeak.com/",
    "description": "Open source “Internet of Things” application and API to store and retrieve data from things using HTTP. (Demo, Source Code) GPL-3.0 Ruby"
  },
  {
    "name": "Tipboard",
    "url": "http://allegro.tech/tipboard/",
    "description": "In-house, tasty, local dashboarding system. (Source Code) Apache-2.0 Python"
  },
  {
    "name": "wger",
    "url": "https://wger.de/",
    "description": "Web-based personal workout, fitness and weight logger/tracker. It can also be used as a simple gym management utility and offers a full REST API as well. (Demo, Source Code) AGPL-3.0 Python"
  },
  {
    "name": "Chevereto Free",
    "url": "https://chevereto.com/free",
    "description": "Powerful and fast image hosting script that allows you to create your very own full featured image hosting website in just minutes. (Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Coppermine",
    "url": "http://coppermine-gallery.net/",
    "description": "Multilingual photo gallery that integrates with various bulletin boards. Includes upload approval and password protected albums. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "CumulusClips",
    "url": "http://cumulusclips.org/",
    "description": "Your own video sharing website with CumulusClips video sharing script. You can build a YouTube clone where users can upload, rate, comment on videos, and much more. (Demo) GPL-2.0 PHP"
  },
  {
    "name": "Gallery CSS",
    "url": "https://benschwarz.github.io/gallery-css/",
    "description": "Gallery.css is all CSS. Think: Simple, maintainable and understandable galleries without the use of Javascript. (Source Code) MIT CSS"
  },
  {
    "name": "Lychee",
    "url": "http://lychee.electerious.com/",
    "description": "Open source grid and album based photo-management-system. (Source Code) MIT PHP"
  },
  {
    "name": "MediaDrop",
    "url": "http://mediadrop.net/",
    "description": "Video, audio and podcast publication platform. (Source Code) GPL-3.0 Python"
  },
  {
    "name": "Mediagoblin",
    "url": "http://mediagoblin.org",
    "description": "Free software media publishing platform that anyone can run. You can think of it as a decentralized alternative to Flickr, YouTube, SoundCloud, etc. (Source Code) AGPL-3.0 Python"
  },
  {
    "name": "MinigalNano",
    "url": "https://github.com/sebsauvage/MinigalNano",
    "description": "MinigalNano is a very simple image gallery. It adheres to the KISS principle and is very easy to install. MinigalNano does not have a web admin interface: You just upload your images in the photo folder on your server (using FTP, SFTP). AGPL-3.0 PHP"
  },
  {
    "name": "Photato",
    "url": "https://github.com/trebonius0/Photato",
    "description": "Self-hosted photo gallery, accessible through a responsive WebUI. Directly uses and indexes a specific folder in the filesystem. AGPL-3.0 Java"
  },
  {
    "name": "Photofloat",
    "url": "http://blog.zx2c4.com/567",
    "description": "Web 2.0 Photo Gallery Done Right via Static JSON and Dynamic Javascript. (Demo) GPL-2.0 Python"
  },
  {
    "name": "PhotoLight",
    "url": "https://github.com/thibaud-rohmer/PhotoLight",
    "description": "The easiest photo gallery there is. GPL-3.0 PHP"
  },
  {
    "name": "Photoshow",
    "url": "http://www.photoshow-gallery.com/",
    "description": "Responsive Web Gallery. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Piwigo",
    "url": "http://piwigo.org/",
    "description": "Photo gallery software for the web, built by an active community of users and developers. (Demo, Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Plumi",
    "url": "http://blog.plumi.org/",
    "description": "Create your own sophisticated video-sharing site. (Source Code) GPL-2.0 Python"
  },
  {
    "name": "sigal",
    "url": "https://github.com/saimn/sigal",
    "description": "Yet another simple static gallery generator. MIT Python"
  },
  {
    "name": "UberGallery",
    "url": "http://www.ubergallery.net",
    "description": "UberGallery is an easy to use, simple to manage, web photo gallery. UberGallery does not require a database and supports JPEG, GIF and PNG file types. Simply upload your images and UberGallery will automatically generate thumbnails and output HTML. (Source Code) MIT PHP"
  },
  {
    "name": "Videobin",
    "url": "http://videobin.org/code",
    "description": "Simple video upload and sharing service with transcoding. (Demo, Source Code) GPL-3.0 Python"
  },
  {
    "name": "Zenphoto",
    "url": "http://www.zenphoto.org/",
    "description": "Open-source gallery and CMS project. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Calagator",
    "url": "http://calagator.org/",
    "description": "Event aggregator. (Demo, Source code) MIT Ruby"
  },
  {
    "name": "Clerk",
    "url": "https://github.com/chr15m/Clerk",
    "description": "Simple event logger to keep track of periodic events, habits, etc. as they occur. GPL-3.0 PHP"
  },
  {
    "name": "dudle",
    "url": "http://primelife.ercim.eu/results/opensource/63-dudle",
    "description": "Online scheduling application. (Demo, Source code) AGPL-3.0 Ruby"
  },
  {
    "name": "Fider",
    "url": "http://getfider.com",
    "description": "Open source alternative to UserVoice for customer feedback. (Demo, Source Code) MIT Go"
  },
  {
    "name": "Framadate",
    "url": "https://framadate.org/",
    "description": "Online service for planning an appointment or make a decision quickly and easily: Make a poll, Define dates or subjects to choose, Send the poll link to your friends or colleagues, Discuss and make a decision. (Demo, Source Code) CECILL-B PHP"
  },
  {
    "name": "Kyélà",
    "url": "http://kyela.net/",
    "description": "Participation polls for group events. (Demo, Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "LimeSurvey",
    "url": "https://www.limesurvey.org",
    "description": "Feature-rich Open Source web based polling software. Supports extensive survey logic. (Demo, Source code) GPL-2.0 PHP"
  },
  {
    "name": "MaterialPoll",
    "url": "https://github.com/nearbycoder/materialpoll",
    "description": "Open source strawpoll.me clone for creating random polls. (Demo, Source Code) MIT Nodejs"
  },
  {
    "name": "Nuages",
    "url": "https://nuages.domainepublic.net/",
    "description": "Collaborative meeting poll system, similar to doodle or rdvz. (Source Code) GPL-3.0 Python"
  },
  {
    "name": "PHPBack",
    "url": "http://www.phpback.org",
    "description": "The open source feedback system. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "TellForm",
    "url": "https://tellform.com",
    "description": "Beautiful online form and survey creator. (Demo, Source Code) MIT Nodejs"
  },
  {
    "name": "http2-serverpush-proxy",
    "url": "https://github.com/n1try/http2-serverpush-proxy",
    "description": "Reverse proxy that helps to automatically utilize HTTP/2.0's server push mechanism for static websites. Available as middleware and standalone application. MIT Nodejs"
  },
  {
    "name": "iodine",
    "url": "http://code.kryo.se/iodine/",
    "description": "IPv4 over DNS tunnel solution, enabling you to start up a socks5 proxy listener. (Source Code) ISC C"
  },
  {
    "name": "microproxy",
    "url": "https://github.com/thekvs/microproxy",
    "description": "lightweight non-caching HTTP/HTTPS proxy server. (Source Code) MIT Go"
  },
  {
    "name": "miniProxy",
    "url": "https://github.com/joshdick/miniProxy/",
    "description": "Simple web proxy written in PHP that can allow you to bypass Internet content filters, or to browse the internet anonymously. Only one php file. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Oranjeproxy",
    "url": "http://lehollandaisvolant.net/tout/oranjeproxy/",
    "description": "Anonymizing web proxy. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "PHP-Proxy",
    "url": "https://www.php-proxy.com/",
    "description": "Web proxy script built specifically to be fast, easy to modify and to support video sites such as YouTube. (Demo, Source Code) MIT PHP"
  },
  {
    "name": "Pound",
    "url": "http://www.apsis.ch/pound/",
    "description": "Light-weight reverse proxy and load balancer for HTTP/HTTPS. (Source Code) GPL-2.0 C"
  },
  {
    "name": "Privoxy",
    "url": "http://www.privoxy.org",
    "description": "Non-caching web proxy with advanced filtering capabilities for enhancing privacy, modifying web page data and HTTP headers, controlling access, and removing ads and other obnoxious Internet junk. GPL-2.0 C"
  },
  {
    "name": "Redbird",
    "url": "https://github.com/OptimalBits/redbird",
    "description": "A modern reverse proxy for node that includes cluster, HTTP2, LetsEncrypt, and Docker support. BSD-2-Clause Javascript"
  },
  {
    "name": "Squid",
    "url": "http://www.squid-cache.org/",
    "description": "Caching proxy for the Web supporting HTTP, HTTPS, FTP, and more. It reduces bandwidth and improves response times by caching and reusing frequently-requested web pages. (Source Code) GPL-2.0 C"
  },
  {
    "name": "Swiperproxy",
    "url": "https://swiperproxy.github.io/",
    "description": "Lightning-fast, open source web proxy that is easy for you to run and customize. (Source Code) MIT Python"
  },
  {
    "name": "Tinyproxy",
    "url": "https://banu.com/tinyproxy/",
    "description": "Light-weight HTTP/HTTPS proxy daemon. (Source Code) GPL-2.0 C"
  },
  {
    "name": "Traefik",
    "url": "https://traefik.io/",
    "description": "Træfɪk is a modern HTTP reverse proxy and load balancer made to deploy microservices with ease. It supports several backends (Docker, Swarm, Mesos/Marathon, …) to manage its configuration automatically and dynamically. (Source Code) MIT Go"
  },
  {
    "name": "Nunux Keeper",
    "url": "http://keeper.nunux.org/",
    "description": "Your personal content curation service. (Source Code) GPL-3.0 Nodejs"
  },
  {
    "name": "Wallabag",
    "url": "https://www.wallabag.org",
    "description": "Wallabag, formerly Poche, is a web application allowing you to save articles to read them later with improved readability. (Demo, Source Code) MIT PHP"
  },
  {
    "name": "Ambar",
    "url": "https://ambar.cloud",
    "description": "Document Search Engine (OCR, Store & Search) (Demo, Source Code) MIT Nodejs/Python"
  },
  {
    "name": "Gigablast",
    "url": "http://www.gigablast.com/",
    "description": "open source search engine. (Demo, Source Code) Apache-2.0 C++"
  },
  {
    "name": "Seeks",
    "url": "https://beniz.github.io/seeks/",
    "description": "Web search proxy and collaborative distributed tool for websearch. (Source Code) AGPL-3.0 C++"
  },
  {
    "name": "Searx",
    "url": "https://asciimoo.github.io/searx/",
    "description": "Privacy-respecting, hackable metasearch engine. (Demo, Source Code) AGPL-3.0 Python"
  },
  {
    "name": "Yacy",
    "url": "http://yacy.net/en/index.html",
    "description": "Peer based, decentralized search engine server. (Demo, Source Code) GPL-2.0 Java"
  },
  {
    "name": "Apache Bloodhound",
    "url": "https://bloodhound.apache.org/",
    "description": "Manage software products, Keep track of features, tasks and bugs. Apache-2.0 Python"
  },
  {
    "name": "Bonobo Git Server",
    "url": "https://bonobogitserver.com/",
    "description": "Set up your own self hosted git server on IIS for Windows. Manage users and have full control over your repositories with a nice user friendly graphical interface. (Source Code) MIT C#"
  },
  {
    "name": "CaseBox",
    "url": "https://www.casebox.org",
    "description": "Manage all your organisation's information in one system. (Source Code) AGPL-3.0 PHP/Java"
  },
  {
    "name": "Fossil",
    "url": "https://www.fossil-scm.org/index.html/doc/trunk/www/index.wiki",
    "description": "Distributed version control system featuring wiki and bug tracker. BSD C"
  },
  {
    "name": "Gitblit",
    "url": "http://gitblit.com/",
    "description": "Pure Java stack for managing, viewing, and serving Git repositories. (Source Code) Apache-2.0 Java"
  },
  {
    "name": "gitbucket",
    "url": "https://gitbucket.github.io/gitbucket-news/",
    "description": "The easily installable GitHub clone powered by Scala. (Source Code) Apache-2.0 Scala/Java"
  },
  {
    "name": "Gitea",
    "url": "https://gitea.io",
    "description": "Community managed fork of Gogs, lightweight code hosting solution. (Demo, Source Code) MIT Go"
  },
  {
    "name": "GitLab",
    "url": "http://gitlab.org/",
    "description": "Self Hosted Git repository management, code reviews, issue tracking, activity feeds and wikis. (Demo, Source Code) MIT Ruby"
  },
  {
    "name": "Gitlist",
    "url": "http://gitlist.org/",
    "description": "Web-based git repository browser - GitList allows you to browse repositories using your favorite browser, viewing files under different revisions, commit history and diffs. (Source Code) BSD-3-Clause PHP"
  },
  {
    "name": "Gitolite",
    "url": "http://gitolite.com/gitolite/index.html",
    "description": "Gitolite allows you to setup git hosting on a central server, with fine-grained access control and many more powerful features. (Source Code) GPL-2.0 Perl"
  },
  {
    "name": "GitPrep",
    "url": "http://gitprep.yukikimoto.com/",
    "description": "Portable Github clone. (Demo, Source Code) Artistic-2.0 Perl"
  },
  {
    "name": "Git WebUI",
    "url": "https://github.com/alberthier/git-webui",
    "description": "Standalone web based user interface for git repositories. Apache-2.0 Python"
  },
  {
    "name": "Gogs",
    "url": "https://gogs.io/",
    "description": "Painless self-hosted Git Service written in Go. (Demo, Source Code) MIT Go"
  },
  {
    "name": "Kallithea",
    "url": "https://kallithea-scm.org/",
    "description": "Source code management system that supports two leading version control systems, Mercurial and Git, with a web interface. (Source Code) GPL-3.0 Python"
  },
  {
    "name": "Klaus",
    "url": "https://github.com/jonashaag/klaus/",
    "description": "Simple, easy-to-set-up Git web viewer that Just Works. ISC Python"
  },
  {
    "name": "Lavagna",
    "url": "http://lavagna.io",
    "description": "Lavagna is an open-source issue/project management tool designed for small teams. Lightweight, pure Java, easy to install, easy to use. (Source Code) GPL-3.0 Java"
  },
  {
    "name": "Octobox ⚠",
    "url": "https://octobox.io/",
    "description": "Take back control of your GitHub Notifications. (Source Code) AGPL-3.0 Ruby"
  },
  {
    "name": "OpenProject",
    "url": "https://www.openproject.org",
    "description": "OpenProject is a web-based project management system. (Source Code) GPL-3.0 Ruby"
  },
  {
    "name": "Phabricator",
    "url": "http://phabricator.org/",
    "description": "Collection of web applications that help build better software. (Demo, Source Code) Apache-2.0 PHP"
  },
  {
    "name": "Phproject",
    "url": "http://www.phproject.org/",
    "description": "High performance full-featured project management system. (Demo, Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Redmine",
    "url": "http://www.redmine.org/",
    "description": "Redmine is a flexible project management web application. (Demo, Source Code) GPL-2.0 Ruby"
  },
  {
    "name": "RhodeCode",
    "url": "https://rhodecode.com/",
    "description": "RhodeCode is an open source platform for software development teams. It unifies and simplifies repository management for Git, Subversion, and Mercurial. (Demo, Source Code) AGPL-3.0 Python"
  },
  {
    "name": "SCM Manager",
    "url": "https://www.scm-manager.org/",
    "description": "The easiest way to share and manage your Git, Mercurial and Subversion repositories over http. (Source Code) BSD Java"
  },
  {
    "name": "Taiga",
    "url": "https://taiga.io/",
    "description": "Agile Project Management Tool based on the Kanban and Scrum methods. (Source Code) AGPL-3.0 Python"
  },
  {
    "name": "The Bug Genie",
    "url": "http://www.thebuggenie.com/",
    "description": "The Bug Genie is a friendly project management and issue tracking tool. (Source Code) MPL-2.0 PHP"
  },
  {
    "name": "Trac",
    "url": "http://trac.edgewall.org/",
    "description": "Trac is an enhanced wiki and issue tracking system for software development projects. BSD Python"
  },
  {
    "name": "Tuleap",
    "url": "https://www.tuleap.org/",
    "description": "Tuleap is a libre suite to plan, track, code and collaborate on software projects. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Babelfish",
    "url": "https://doc.bblf.sh",
    "description": "Self-hosted server for source code parsing. It can parse any file, in any supported language, extract an Abstract Syntax Tree from it, and convert it to a Universal Abstract Syntax Tree which can enable further analysis and transformation. (Source Code) GPL-3.0 Go"
  },
  {
    "name": "Codiad",
    "url": "http://codiad.com/",
    "description": "Web-based IDE framework with a small footprint and minimal requirements. (Source Code) MIT PHP"
  },
  {
    "name": "Eclipse Che",
    "url": "http://www.eclipse.org/che/",
    "description": "Open source workspace server and cloud IDE. (Source Code) EPL-1.0 Docker/Java"
  },
  {
    "name": "ICEcoder",
    "url": "https://icecoder.net/",
    "description": "ICEcoder is a web IDE / browser based code editor, which allows you to develop websites directly within the web browser. (Demo, Source Code) MIT PHP"
  },
  {
    "name": "JS Bin",
    "url": "http://jsbin.com/",
    "description": "Open source collaborative web development debugging tool. (Source Code) MIT Nodejs"
  },
  {
    "name": "Judge0 API",
    "url": "https://api.judge0.com",
    "description": "Open source API to compile and run source code. (Source Code) GPL-3.0 Ruby"
  },
  {
    "name": "Koding",
    "url": "http://www.koding.com/",
    "description": "The simplest way to manage your entire Dev Infrastructure. (Source Code) Apache-2.0 Nodejs"
  },
  {
    "name": "Microglark",
    "url": "http://micro.glark.io",
    "description": "Hacky minimalistic remote pair programming editor. (Demo, Source Code) AGPL-3.0 Nodejs"
  },
  {
    "name": "Regexr",
    "url": "http://regexr.com/",
    "description": "RegExr is a HTML/JS based tool for creating, testing, and learning about Regular Expressions. (Source Code) MIT Nodejs"
  },
  {
    "name": "RequestBin",
    "url": "https://requestb.in/",
    "description": "Inspect HTTP requests. Debug webhooks. (Source Code) MIT python"
  },
  {
    "name": "RStudio Server",
    "url": "https://www.rstudio.com/products/rstudio/#Server",
    "description": "Web browser based IDE for R. (Source Code) AGPL-3.0 Java/C++"
  },
  {
    "name": "Selenoid",
    "url": "http://aerokube.com/selenoid/latest/",
    "description": "Lightweight Selenium hub implementation launching browsers within Docker containers. (Source Code) Apache-2.0 Go"
  },
  {
    "name": "Wide",
    "url": "https://github.com/b3log/wide",
    "description": "Web-based IDE for Teams using Go programming language/Golang. (Demo) Apache-2.0 Go"
  },
  {
    "name": "Zalenium",
    "url": "https://github.com/zalando/zalenium",
    "description": "Allows anyone to have a disposable and flexible Docker-based Selenium Grid infrastructure featuring video recording, live preview and online/offline dashboards. Apache-2.0 Java/Shell"
  },
  {
    "name": "Concourse",
    "url": "https://concourse.ci/",
    "description": "Concourse is a CI tool that treats pipelines as first class objects and containerizes every step along the way. (Demo, Source Code) Apache-2.0 Go"
  },
  {
    "name": "drone",
    "url": "https://drone.io/",
    "description": "Drone is a Continuous Delivery platform built on Docker, written in Go. (Source Code) Apache-2.0 Go"
  },
  {
    "name": "Factor",
    "url": "http://www.factor.io/",
    "description": "It's like IFTTT (if-this-then-that) for Dev and DevOps. (Source Code) MIT Ruby"
  },
  {
    "name": "GolangCI",
    "url": "https://golangci.com/",
    "description": "Open Source automated code review service for Go integrated with GitHub pull requests. (Source Code) AGPL-3.0 Go"
  },
  {
    "name": "Jenkins",
    "url": "https://jenkins-ci.org/",
    "description": "Continuous Integration Server. (Source Code) MIT Java"
  },
  {
    "name": "Laminar",
    "url": "http://laminar.ohwg.net",
    "description": "Fast, lightweight, simple and flexible Continuous Integration. (Source Code) GPL-3.0 C++"
  },
  {
    "name": "PHP Censor",
    "url": "https://github.com/php-censor/php-censor",
    "description": "Open source self-hosted continuous integration server for PHP projects. BSD-2-Clause PHP"
  },
  {
    "name": "PHPCI",
    "url": "https://www.phptesting.org/",
    "description": "Free and open source continuous integration specifically designed for PHP. (Source Code) BSD-2-Clause PHP"
  },
  {
    "name": "Strider",
    "url": "http://strider-cd.github.io/",
    "description": "Open Source Continuous Deployment / Continuous Integration platform. (Source Code) BSD Nodejs"
  },
  {
    "name": "FX",
    "url": "https://github.com/metrue/fx",
    "description": "fx is a tool to help you do Function as a Service with painless on your own servers. MIT Go"
  },
  {
    "name": "IronFunctions",
    "url": "https://github.com/iron-io/functions",
    "description": "the serverless microservices platform by iron.io Apache-2.0 Go"
  },
  {
    "name": "OpenFaaS",
    "url": "https://www.openfaas.com/",
    "description": "Serverless Functions Made Simple for Docker & Kubernetes. (Source Code) MIT Go"
  },
  {
    "name": "DreamFactory",
    "url": "https://www.dreamfactory.com/",
    "description": "Turns any SQL/NoSQL/Structured data into Restful API. (Source Code) Apache-2.0 PHP"
  },
  {
    "name": "Endpoint",
    "url": "https://github.com/LINKIWI/endpoint/",
    "description": "Super simple mock HTTP API endpoints that return static JSON data, for testing webhooks and client libraries in development. MIT Nodejs"
  },
  {
    "name": "Fusio",
    "url": "http://www.fusio-project.org/",
    "description": "Open-source API management platform which helps to build and manage REST APIs. (Demo, Source Code) AGPL-3.0 PHP"
  },
  {
    "name": "Hapttic",
    "url": "https://github.com/jsoendermann/hapttic",
    "description": "Simple HTTP server that forwards all requests to a shell script to handle webhooks you receive. Apache-2.0 Go"
  },
  {
    "name": "Para",
    "url": "http://www.paraio.org",
    "description": "Flexible and modular backend framework/server for object persistence, API development and authentication. (Source Code) Apache-2.0 Java"
  },
  {
    "name": "Docstore",
    "url": "http://haldean.org/",
    "description": "Static document hosting without any server-side processing, does not require you to recompile every time you change an article. Clone the repository and add articles in the text/ directory to get started. (Source Code) BSD-3-Clause Javascript"
  },
  {
    "name": "Flatdoc",
    "url": "http://ricostacruz.com/flatdoc/",
    "description": "Small Javascript file that fetches Markdown files and renders them as full pages. MIT Javascript"
  },
  {
    "name": "markdown-tree",
    "url": "https://github.com/mil/markdown-tree",
    "description": "Serve a hierarchy / tree directory of markdown files. Use intended for small sites built in markdown. MIT Ruby"
  },
  {
    "name": "Read the Docs",
    "url": "https://docs.readthedocs.org/en/latest/install.html",
    "description": "Host documentation, making it fully searchable and easy to find; import your docs using any major version control system, including Mercurial, Git, Subversion, and Bazaar. (Demo, Source Code) MIT Python"
  },
  {
    "name": "Accent",
    "url": "https://www.accent.reviews/",
    "description": "Open-source, self-hosted, developer-oriented translation tool. (Source code) BSD-3-Clause Elixir"
  },
  {
    "name": "Parrot",
    "url": "http://parrot-translate.github.io/parrot.github.io/",
    "description": "Self-hosted Localization Management Platform built with Go and Angular 2. (Source Code) MIT Go"
  },
  {
    "name": "Pootle",
    "url": "http://pootle.translatehouse.org",
    "description": "Online translation and localization tool. (Source Code) GPL-3.0 Python"
  },
  {
    "name": "Weblate",
    "url": "https://weblate.org",
    "description": "Web-based translation tool with tight version control integration. (Demo, Source Code) GPL-3.0 Python"
  },
  {
    "name": "Zanata",
    "url": "http://zanata.org",
    "description": "Web-based translation platform for translators, content creators and developers to manage localisation projects. (Source Code) GPL-2.0 Java"
  },
  {
    "name": "Crepido",
    "url": "https://github.com/arshad/crepido",
    "description": "Create (kanban) boards to track users and projects from flat markdown files. MIT Nodejs"
  },
  {
    "name": "Kanboard",
    "url": "http://kanboard.net/",
    "description": "Simple and open source visual task board. (Source Code) MIT PHP"
  },
  {
    "name": "Wheatbin",
    "url": "http://wheatbin.com/",
    "description": "Project management software that combines Kanban methodology with the Law of the Harvest. (Source Code) MIT PHP"
  },
  {
    "name": "myTinyTodo",
    "url": "http://www.mytinytodo.net/",
    "description": "Simple way to manage your todo list in AJAX style. Uses PHP, jQuery, SQLite/MySQL. GTD compliant. (Demo, Source Code) GPL-2.0 PHP"
  },
  {
    "name": "omgnata",
    "url": "https://github.com/chr15m/omgnata",
    "description": "Mobile friendly zero-feature TODO list web app. Unix philosophy. (Demo) GPL-3.0 ClojureScript"
  },
  {
    "name": "PHP Task/Todo list",
    "url": "https://github.com/lgg/tasks.php",
    "description": "Simple task/todo list that uses a JSON text file for the tasks. MIT PHP"
  },
  {
    "name": "Restyaboard",
    "url": "http://restya.com/board/",
    "description": "Open source Trello-like kanban board. (Demo, Source Code) OSL-3.0 PHP"
  },
  {
    "name": "scrumblr",
    "url": "http://scrumblr.ca/",
    "description": "Collaborative Online Scrum Tool Using Websockets, Node.js, jQuery, and CSS3. (Source Code) GPL-3.0 Nodejs"
  },
  {
    "name": "TaskBoard",
    "url": "http://taskboard.matthewross.me/",
    "description": "Kanban-inspired app for keeping track of things that need to get done. (Demo, Source Code) MIT PHP"
  },
  {
    "name": "Taskfreak",
    "url": "http://www.taskfreak.com/original",
    "description": "Simple but efficient web based task manager written in PHP. (Demo) GPL-3.0 PHP"
  },
  {
    "name": "Tasks",
    "url": "https://github.com/m1guelpf/tasks",
    "description": "Simple tasks and notes manager written in PHP, jQuery and Bootstrap using a custom flat file database. MPL-2.0 PHP"
  },
  {
    "name": "Tasks",
    "url": "https://github.com/thewhitetulip/Tasks",
    "description": "Kanban based to-do list manager written in Go. MIT Go"
  },
  {
    "name": "tasks.php",
    "url": "https://github.com/RaymiiOrg/tasks.php",
    "description": "Simple task/todo list manager. MIT PHP"
  },
  {
    "name": "Taskwarrior",
    "url": "https://taskwarrior.org/",
    "description": "Taskwarrior is Free and Open Source Software that manages your TODO list from your command line. It is flexible, fast, efficient, and unobtrusive. It does its job then gets out of your way. (Source Code) MIT C++"
  },
  {
    "name": "Tinyissue",
    "url": "https://github.com/satrun77/tinyissue",
    "description": "Simple Issue Tracking for Teams. MIT PHP"
  },
  {
    "name": "todo",
    "url": "https://github.com/prologic/todo",
    "description": "Simple todo list manager. (Demo) MIT Go"
  },
  {
    "name": "Tracks",
    "url": "http://www.getontracks.org/",
    "description": "Web-based application to help you implement David Allen’s Getting Things Done™ methodology. (Source Code) GPL-2.0 Ruby"
  },
  {
    "name": "Volition",
    "url": "https://www.usevolition.com",
    "description": "Opinionated open-source task management. (Demo, Source Code) MIT Ruby"
  },
  {
    "name": "Wekan",
    "url": "https://wekan.github.io/",
    "description": "Open-source Trello-like kanban. (Demo, Source Code) MIT Nodejs"
  },
  {
    "name": "Brimir",
    "url": "https://getbrimir.com/",
    "description": "Simple and clean open-source ticket manager written in Ruby on Rails. (Source Code) AGPL-3.0 Ruby"
  },
  {
    "name": "Bugzilla",
    "url": "https://www.bugzilla.org/",
    "description": "General-purpose bugtracker and testing tool originally developed and used by the Mozilla project. MPL-2.0 Perl"
  },
  {
    "name": "Bumpy Booby",
    "url": "http://bumpy-booby.derivoile.fr/",
    "description": "Simple, responsive and highly customizable PHP bug tracking system. (Source Code) MIT PHP"
  },
  {
    "name": "Cerb",
    "url": "http://www.cerberusweb.com/",
    "description": "Group-based e-mail management project. (Source Code) DPL PHP"
  },
  {
    "name": "Coordino",
    "url": "http://coordino.com/",
    "description": "Open Source question and answer system on top of CakePHP. (Source Code) MIT PHP"
  },
  {
    "name": "Deskulu",
    "url": "https://github.com/Taskulu/deskulu",
    "description": "Opensource helpdesk and ticketing system based on Drupal 7. (Demo) GPL-2.0 PHP"
  },
  {
    "name": "DiamanteDesk",
    "url": "http://diamantedesk.com/",
    "description": "DiamanteDesk is FREE Open Source easy-to-use help-desk solution. (Demo, Source Code) OSL-3.0 PHP"
  },
  {
    "name": "Flyspray",
    "url": "http://www.flyspray.org/",
    "description": "Uncomplicated, web-based bug tracking system. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "HuBoard ⚠",
    "url": "https://github.com/huboard/huboard",
    "description": "Instant project management for your GitHub issues (Connects directly GitHub API). MIT Ruby"
  },
  {
    "name": "MantisBT",
    "url": "https://www.mantisbt.org/",
    "description": "Self hosted bug tracker, fits best for software development. (Demo), (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "osTicket",
    "url": "http://osticket.com/",
    "description": " Manage, organize and archive all your support requests and responses in one place. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "OTRS",
    "url": "http://www.otrs.com/",
    "description": "Trouble ticket system for assigning tickets to incoming queries and tracking further communications. (Source Code) AGPL-3.0 Perl"
  },
  {
    "name": "Request Tracker",
    "url": "https://www.bestpractical.com/rt/",
    "description": " An enterprise-grade issue tracking system. (Source Code) GPL-2.0 Perl"
  },
  {
    "name": "SIT",
    "url": "http://sit-it.org/",
    "description": "SCM-agnostic, file-based, offline-first, immutable issue tracker. (Source Code) MIT Apache-2.0 Rust."
  },
  {
    "name": "TheBugGenie",
    "url": "http://www.thebuggenie.org",
    "description": "Ticket system with extensive user rights system. (Source Code) MPL-2.0 PHP"
  },
  {
    "name": "Zammad",
    "url": "https://zammad.org/",
    "description": "Easy to use but powerful open-source support and ticketing system. (Source Code) AGPL-3.0 Ruby"
  },
  {
    "name": "Link-shortener-bot ⚠",
    "url": "https://github.com/tommyku/link-shortener-front-end",
    "description": "URL shortener using a Telegram Bot. (Demo) MIT Ruby"
  },
  {
    "name": "Linkr",
    "url": "https://linkrapp.com",
    "description": "Beautiful, fast URL shortening. (Demo, Source Code) MIT Python/Nodejs"
  },
  {
    "name": "Lstu",
    "url": "https://github.com/ldidry/lstu",
    "description": "Let's SHorten That Url - Lightweight URL shortener. WTFPL Perl"
  },
  {
    "name": "Nimbus",
    "url": "https://github.com/ethanal/nimbus",
    "description": "URL shortener and file sharer with a drag-and-drop OS X menu bar client and web interface. MIT Python"
  },
  {
    "name": "Polr",
    "url": "https://project.polr.me/",
    "description": "Modern, minimalist, modular, and lightweight URL shortener. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "reduc.io",
    "url": "https://github.com/ziyasal/reducio",
    "description": "URL shortener service written in Scala, using Akka-Http and Redis. MIT Scala"
  },
  {
    "name": "schort",
    "url": "https://github.com/sqozz/schort",
    "description": "No login, no javascript, just short links. (Demo) CC0-1.0 Python"
  },
  {
    "name": "shorturl",
    "url": "https://github.com/prologic/shorturl",
    "description": "Simple URL shortener with very tiny URLs. (Demo) MIT Go"
  },
  {
    "name": "shuri",
    "url": "https://github.com/pips-/shuri",
    "description": "SHort URI - Lighweight URL shortener. MIT PHP"
  },
  {
    "name": "url-shortener ⚠",
    "url": "https://github.com/cagataycali/url-shortener",
    "description": "Shitty url shortener, emoji and AI powered. MIT Nodejs"
  },
  {
    "name": "YOURLS",
    "url": "http://yourls.org/",
    "description": "YOURLS is a set of PHP scripts that will allow you to run Your Own URL Shortener. Features include password protection, URL customization, bookmarklets, statistics, API, plugins, jsonp. (Source Code) MIT PHP"
  },
  {
    "name": "Blazekiss",
    "url": "http://projet.idleman.fr/blazekiss/",
    "description": "BlazeKiss is a KISS-based wiki (Keep It Simple, Stupid) - simplicity and functionality comes before all. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "BookStack",
    "url": "https://www.bookstackapp.com/",
    "description": "BookStack is a simple, self-hosted, easy-to-use platform for organizing and storing information. It allows for documentation to be stored in a book like fashion. (Demo, Source Code) MIT PHP"
  },
  {
    "name": "Cowyo",
    "url": "https://github.com/schollz/cowyo/",
    "description": "Cowyo is a feature-rich wiki for minimalists. (Demo) MIT Go"
  },
  {
    "name": "django-wiki",
    "url": "https://github.com/django-wiki/django-wiki",
    "description": "Wiki system with complex functionality for simple integration and a superb interface. Store your knowledge with style: Use django models. (Demo) GPL-3.0 Python"
  },
  {
    "name": "Documize",
    "url": "https://documize.com",
    "description": "Modern Docs + Wiki software with built-in workflow, single binary executable, just bring MySQL/Percona. (Source Code) AGPL-3.0 Go"
  },
  {
    "name": "Dokuwiki",
    "url": "https://www.dokuwiki.org/DokuWiki",
    "description": "Easy to use, lightweight, standards-compliant wiki engine with a simple syntax allowing reading the data outside the wiki. All data is stored in plain files, therefore no database is required. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "Gitit",
    "url": "https://github.com/jgm/gitit",
    "description": "Wiki program that stores pages and uploaded files in a git repository, which can then be modified using the VCS command line tools or the wiki's web interface. GPL-2.0 Haskell"
  },
  {
    "name": "Gollum",
    "url": "https://github.com/gollum/gollum",
    "description": "Simple, Git-powered wiki with a sweet API and local frontend. MIT Ruby"
  },
  {
    "name": "jingo",
    "url": "https://github.com/claudioc/jingo",
    "description": "Git based wiki engine written for node.js, with a decent design, a search capability and a good typography. (Demo, Source Code) MIT Nodejs"
  },
  {
    "name": "Mediawiki",
    "url": "https://www.mediawiki.org/wiki/MediaWiki",
    "description": "MediaWiki is a free and open-source wiki software package written in PHP. It serves as the platform for Wikipedia and the other Wikimedia projects, used by hundreds of millions of people each month. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "MoinMoin",
    "url": "https://moinmo.in/",
    "description": "Advanced, easy to use and extensible WikiEngine with a large community of users. (Source Code) GPL-2.0 Python"
  },
  {
    "name": "Olelo",
    "url": "https://github.com/minad/olelo",
    "description": "Olelo is a wiki that stores pages in a Git repository, supports many markup styles and has an extensible, hackable architecture. (Demo) MIT Ruby"
  },
  {
    "name": "Pepperminty Wiki",
    "url": "https://github.com/sbrl/Pepperminty-Wiki/",
    "description": "Complete markdown-powered wiki contained in a single PHP file. (Demo) MPL-2.0 PHP"
  },
  {
    "name": "PineDocs",
    "url": "https://github.com/xy2z/PineDocs",
    "description": "Simple, fast, customizable and lightweight site for browsing files. GPL-3.0 PHP"
  },
  {
    "name": "PmWiki",
    "url": "http://www.pmwiki.org",
    "description": "Wiki-based system for collaborative creation and maintenance of websites. GPL-3.0 PHP"
  },
  {
    "name": "Raneto",
    "url": "http://raneto.com/",
    "description": "Raneto is an open source Knowledgebase platform that uses static Markdown files to power your Knowledgebase. MIT Nodejs"
  },
  {
    "name": "Realms",
    "url": "http://realms.io/",
    "description": "Git-backed wiki inspired by Gollum. (Source Code) GPL-2.0 Python"
  },
  {
    "name": "TiddlyWiki",
    "url": "http://tiddlywiki.com/",
    "description": "Reusable non-linear personal web notebook. (Source Code) BSD Nodejs"
  },
  {
    "name": "Tiki",
    "url": "https://tiki.org",
    "description": "Wiki CMS Groupware with the most built-in features. (Demo, Source Code) LGPL-2.1 PHP"
  },
  {
    "name": "TWiki",
    "url": "http://twiki.org/",
    "description": "TWiki is a Perl-based structured wiki application, typically used to run a collaboration platform, knowledge or document management system, a knowledge base, or team portal. (Demo, Source Code) GPL-1.0 Perl"
  },
  {
    "name": "wiki",
    "url": "https://github.com/prologic/wiki",
    "description": "Simple Markdown based wiki engine. (Demo) MIT Go"
  },
  {
    "name": "Wiki.js",
    "url": "https://wiki.js.org/",
    "description": "Modern, lightweight and powerful wiki app built on NodeJS, Git and Markdown. (Demo) AGPL-3.0 Nodejs"
  },
  {
    "name": "WiKiss",
    "url": "http://wikiss.tuxfamily.org/",
    "description": "Wiki, simple to use and install. (Source Code) GPL-2.0 PHP"
  },
  {
    "name": "XWiki",
    "url": "http://www.xwiki.org",
    "description": "Second generation wiki that allows the user to extend its functionalities with a powerful extension-based architecture. (Demo, Source Code) LGPL-2.1 Java"
  },
  {
    "name": "1Backend",
    "url": "https://1backend.com",
    "description": "Self-host web apps, microservices and lambdas on your server. Advanced features enable service reuse and composition. (Source Code) AGPL-3.0 Go"
  },
  {
    "name": "Cloudron",
    "url": "https://cloudron.io",
    "description": "Effortlessly self-host web apps on your server. (Source Code) AGPL-3.0 Nodejs/Docker"
  },
  {
    "name": "DietPi",
    "url": "http://dietpi.com/",
    "description": "Minimal Debian OS optimized for single-board computers, which allows you to easily install and manage several services for selfhosting at home. (Source Code) GPL-2.0 Shell"
  },
  {
    "name": "DPlatform",
    "url": "https://dfabric.github.io/DPlatform-ShellCore/",
    "description": "Deploy self-hosted apps easily: simple, bloat-free, independent installation. (Source Code) MIT Shell"
  },
  {
    "name": "FreedomBone",
    "url": "https://freedombone.net/",
    "description": "Home server configuration based on Debian. (Source Code) AGPL-3.0 Shell"
  },
  {
    "name": "FreedomBox",
    "url": "https://wiki.debian.org/FreedomBox",
    "description": "Community project to develop, design and promote personal servers running free software for private, personal, communications. GPL-3.0 Python/Other"
  },
  {
    "name": "FreeNAS",
    "url": "https://www.freenas.org/",
    "description": "Network-attached storage (NAS) software based on FreeBSD and the OpenZFS file system. Support for SMB, AFP, NFS, iSCSI, SSH, rsync and FTP/TFTP protocols. Advanced features include full-disk encryption and plug-ins. (Source Code) BSD-3-Clause Python/Other"
  },
  {
    "name": "OpenMediaVault",
    "url": "http://www.openmediavault.org/",
    "description": "OpenMediaVault is the next generation network attached storage (NAS) solution based on Debian Linux. It contains services like SSH, (S)FTP, SMB/CIFS, DAAP media server, RSync, BitTorrent client and many more. (Source Code) GPL-3.0 PHP"
  },
  {
    "name": "Piratebox",
    "url": "https://piratebox.cc/start",
    "description": "DIY anonymous offline file-sharing and communications system built with free software and inexpensive off-the-shelf hardware. (Source Code). GPL-3.0 Python/Other"
  },
  {
    "name": "Puffin",
    "url": "http://puffin.rocks/",
    "description": "Lightweight webapp catalog based on containers, with user interface à la mobile app store. (Demo, Source Code) AGPL-3.0 Python/Docker"
  },
  {
    "name": "Sandstorm",
    "url": "https://sandstorm.io/",
    "description": "Personal server for running self-hosted apps easily and securely. (Demo, Source Code) Apache-2.0 C++/Other"
  },
  {
    "name": "sovereign",
    "url": "https://github.com/sovereign/sovereign",
    "description": "Set of Ansible playbooks to build and maintain your own private cloud: email, calendar, contacts, file sync, IRC bouncer, VPN, and more. GPL-3.0 YAML/Other"
  },
  {
    "name": "Syncloud",
    "url": "https://syncloud.org/",
    "description": "Your own online file storage, social network or email server. (Source Code) GPL-3.0 Python/Other"
  },
  {
    "name": "UBOS",
    "url": "http://ubos.net/",
    "description": "Linux distro that runs on indie boxes (personal servers and IoT devices). Single-command installation and management of apps - Jenkins, Mediawiki, Owncloud, WordPress, etc., and other features. GPL-3.0 Perl/Other"
  },
  {
    "name": "WikiSuite",
    "url": "http://WikiSuite.org",
    "description": "The most comprehensive and integrated Free / Libre / Open Source software suite ever developed. (Source Code) Multiple ClearOS"
  },
  {
    "name": "YunoHost",
    "url": "https://yunohost.org/",
    "description": "Server operating system aiming to make self-hosting accessible to everyone. (Demo, Source Code) AGPL-3.0 Python/Other"
  },
  {
    "name": "Awesome Big Data",
    "url": "https://github.com/onurakpolat/awesome-bigdata",
    "description": "Curated list of awesome big data frameworks, resources and other awesomeness."
  },
  {
    "name": "Awesome Sysadmin",
    "url": "https://github.com/n1trux/awesome-sysadmin",
    "description": "Curated list of amazingly awesome open source sysadmin resources."
  },
  {
    "name": "Lists of software aimed at privacy and decentralization in some form: PRISM Break, privacytools.io, Alternative Internet, Libre Projects",
    "url": "https://prism-break.org/en/"
  },
  {
    "name": "Dynamic Domain Name services: Afraid.org, Pagekite",
    "url": "https://freedns.afraid.org/domain/registry/"
  },
  {
    "name": "Communities/forums: /r/selfhosted, IndieWeb",
    "url": "https://www.reddit.com/r/selfhosted"
  }
]
