[
  {
    "name": "Articles | FAQs | Interview Questions",
    "url": "articles"
  },
  {
    "name": "topcoder Data Science Tutorials\nThis is a list of tutorials written by respected topcoder members. Many top programmers started learning data sciences from here.",
    "url": "https://www.topcoder.com/community/data-science/data-science-tutorials/"
  },
  {
    "name": "E-Maxx (Russian), (English)\nEmaxx is widely used in the Russian-speaking competitive programming scene. Only a small fraction of the original site is translated into English, but Google Translate would work okay.",
    "url": "http://e-maxx.ru/algo/"
  },
  {
    "name": "Algorithms | GeeksforGeeks\nGeeksforgeeks has a large amount of nicely written articles on different topics. It is a great complimentary resource for algorithm courses.",
    "url": "http://www.geeksforgeeks.org/fundamentals-of-algorithms/"
  },
  {
    "name": "PEGWiki\nPEGWiki has amazing in-depth wiki-like writeups on many topics. It's far better than those on Wikipedia in my opinion.",
    "url": "http://wcipeg.com/wiki/Special:AllPages"
  },
  {
    "name": "Notes | HackerEarth\nA great crowdsourcing platform for tutorials. Also visit Code Monk.",
    "url": "https://www.hackerearth.com/notes/trending/"
  },
  {
    "name": "USA Computing Olympiad (USACO)\nUSACO contains several training pages on its website which are designed to develop one's skills in programming solutions to difficult and varied algorithmic problems at one's own pace.",
    "url": "http://www.usaco.org/"
  },
  {
    "name": "OLYMPIADS IN INFORMATICS\nAn international journal focused on the research and practice of professionals who are working in the field of teaching and learning informatics to talented student. ",
    "url": "http://www.mii.lt/olympiads_in_informatics/index.html"
  },
  {
    "name": "algolist (Russian)\nalgolist is a website devoted to algorithms of all sorts.",
    "url": "http://algolist.manual.ru/"
  },
  {
    "name": "演算法筆記 (Algorithm Notes) (Chinese)\n演算法筆記 is one of the most popular tutorial websites among the Taiwanese competitive programming community. The maintainer for this website spends immense efforts on researching algorithms.",
    "url": "http://www.csie.ntnu.edu.tw/%7Eu91029/"
  },
  {
    "name": "国家集训队论文 1999-2015 (Papers from Chinese IOI training camps) (Chinese)\nThese are papers from the Chinese IOI training camps. It's interesting for the fact that one can tell different regions emphasize different things.",
    "url": "http://download.csdn.net/album/detail/657/1/1"
  },
  {
    "name": "IOI Syllabus\nA detailed syllabus on which IOI contestants will be tested. This is still somewhat relevant to ACM-ICPC.",
    "url": "https://people.ksp.sk/%7Emisof/ioi-syllabus/"
  },
  {
    "name": "Programming Camp Syllabus\nIt contains a list of important topics in competitive programming with exercise problems.",
    "url": "https://docs.google.com/document/d/1_dc3Ifg7Gg1LxhiqMMmE9UbTsXpdRiYh4pKILYG2eA4/edit"
  },
  {
    "name": "Good Blog Post Resources about Algorithm and Data Structures",
    "url": "http://codeforces.com/blog/entry/13529",
    "description": "Codeforces"
  },
  {
    "name": "Data Structures and Algorithms",
    "url": "https://discuss.codechef.com/questions/48877/data-structures-and-algorithms",
    "description": "CodeChef Discuss"
  },
  {
    "name": "hkirat/Algorithmic-Resources\nThis list collected materials for some relevant topics in competitive programming.",
    "url": "https://github.com/hkirat/Algorithmic-Resoureces"
  },
  {
    "name": "CodeLibrary, by Andrey Naumenko (indy256)\nThis site contains a large collection of implementations for algorithms and data structures in Java and C++. You may also visit his GitHub Repository.",
    "url": "http://www.codelibrary.ml/"
  },
  {
    "name": "Stanford University ACM Team Notebook (2014-15)\nStanford's team notebook is well maintained and the codes within are high-quality.",
    "url": "http://stanford.edu/%7Eliszt90/acm/notebook.html"
  },
  {
    "name": "bobogei81123/bcw_codebook, by team bcw0x1bd2 (darkhh, bobogei81123, step5) from National Taiwan University\nbcw0x1bd2 is the team representing National Taiwan University for the 2016 ACM-ICPC World Finals. This notebook contains robust implementations for advanced data structures and algorithms.",
    "url": "https://github.com/bobogei81123/bcw_codebook"
  },
  {
    "name": "SuprDewd/CompetitiveProgramming, by team viRUs from Reykjavik University\nOne of the very few notebooks to include a tester (even integration with Travis CI). A great notebook to learn from.",
    "url": "https://github.com/SuprDewd/CompetitiveProgramming"
  },
  {
    "name": "foreverbell/acm-icpc-cheat-sheet, by foreverbell (foreverbell)\nA notebook with some advanced data structures and algorithms including some from the China informatics scene.",
    "url": "https://github.com/foreverbell/acm-icpc-cheat-sheet"
  },
  {
    "name": "Spaghetti Source",
    "url": "http://www.prefield.com/algorithm/",
    "description": "各種アルゴリズムの C++ による実装 (Japanese), by 前原 貴憲 (maehara)"
  },
  {
    "name": "igor's code archive, by Igor Naverniouk (Abednego)\nA good notebook by Igor Naverniouk who is currently a software engineer at Google and part of the Google Code Jam team.",
    "url": "http://shygypsy.com/tools/"
  },
  {
    "name": "Power up C++ with the Standard Template Library: Part 1 – topcoder\nPower up C++ with the Standard Template Library: Part 2 – topcoder\nLearn how to use basic C++ standard template libraries.",
    "url": "https://www.topcoder.com/community/data-science/data-science-tutorials/power-up-c-with-the-standard-template-library-part-1/"
  },
  {
    "name": "Yet again on C++ input/output",
    "url": "http://codeforces.com/blog/entry/5217",
    "description": "Codeforces"
  },
  {
    "name": "C++ Tricks",
    "url": "http://codeforces.com/blog/entry/15643",
    "description": "Codeforces"
  },
  {
    "name": "C++ STL: Policy based data structures",
    "url": "http://codeforces.com/blog/entry/11080",
    "description": "Codeforces"
  },
  {
    "name": "C++11 FAQ (English, Chinese, Russian, Japanese, Korean)\nA list of FAQs regarding C++11 collected and written by Bjarne Stroustrup, the creator of C++.",
    "url": "http://www.stroustrup.com/C++11FAQ.html"
  },
  {
    "name": "How to read input in Java — tutorial",
    "url": "http://codeforces.com/blog/entry/7018",
    "description": "Codeforces"
  },
  {
    "name": "How to sort arrays in Java and avoid TLE",
    "url": "http://codeforces.com/blog/entry/7108",
    "description": "Codeforces"
  },
  {
    "name": "Java.math.BigInteger Class",
    "url": "http://www.tutorialspoint.com/java/math/java_math_biginteger.htm",
    "description": "TutorialPrint"
  },
  {
    "name": "BigNum arithmetic in Java — Let's outperform BigInteger!",
    "url": "http://codeforces.com/blog/entry/17235",
    "description": "Codeforces"
  },
  {
    "name": "EZ Collections, EZ Life (new Java library for contests)",
    "url": "http://codeforces.com/blog/entry/14328",
    "description": "Codeforces"
  },
  {
    "name": "Bit Twiddling Hacks\nA huge compiled list of bit manipulation tricks.",
    "url": "https://graphics.stanford.edu/%7Eseander/bithacks.html"
  },
  {
    "name": "Comparing Floating Point Numbers, 2012 Edition | Random ASCII\nThis post teaches everything one needs to know about floating point numbers. A must read especially for geometry topics.",
    "url": "https://randomascii.wordpress.com/2012/02/25/comparing-floating-point-numbers-2012-edition/"
  },
  {
    "name": "你应该知道的浮点数基础知识 • cenalulu's Tech Blog (Chinese)\nSimilar post on floating point numbers.",
    "url": "http://cenalulu.github.io/linux/about-denormalized-float-number/"
  },
  {
    "name": "Object-Oriented C Style Languages: C++, Objective-C, Java, C#",
    "url": "http://hyperpolyglot.org/cpp",
    "description": "a side-by-side reference sheet"
  },
  {
    "name": "VisuAlgo\nVisuAlgo features a large collection of visualization tools for algorithms and data structures.",
    "url": "http://visualgo.net"
  },
  {
    "name": "CHelper, for IntelliJ IDEA (Java) (manual)",
    "url": "https://plugins.jetbrains.com/plugin/7091?pr=idea"
  },
  {
    "name": "caide, for Visual Studio and CodeLite (C/C++/C#)",
    "url": "https://github.com/slycelote/caide"
  },
  {
    "name": "JHelper, for AppCode and CLion (C/C++)",
    "url": "http://codeforces.com/blog/entry/13369"
  },
  {
    "name": "Codeforces Parser",
    "url": "https://github.com/johnathan79717/codeforces-parser"
  },
  {
    "name": "GoCF",
    "url": "https://github.com/sukeesh/GoCF"
  },
  {
    "name": "cfparser, for emacs",
    "url": "https://github.com/gnull/cfparser"
  },
  {
    "name": "The On-Line Encyclopedia of Integer Sequences (OEIS)\nA stunning encyclopedia with a database of countless integer sequences. It also features a powerful search engine. Sometimes a seemingly difficult combinatorics problem can be equivalent to a simple or known and studied integer sequence.",
    "url": "https://oeis.org/"
  },
  {
    "name": "Ineffable\nIneffable is a simple command-line grader for local grading of solutions for problems of competitive programming contests.",
    "url": "http://codeforces.com/blog/entry/19083"
  },
  {
    "name": "polygon\npolygon provides a platform and a rich set of tools for professional contest preparation.\nAn example: Validators with testlib.h",
    "url": "https://polygon.codeforces.com/",
    "description": "Codeforces"
  },
  {
    "name": "A simple tool for graph visualization\nThis is a very simple tool to visualize small graphs.",
    "url": "http://mxwell.github.io/draw-graph/"
  },
  {
    "name": "Virtual Judge (vjudge)\nVirtual Judge (vjudge) allows users to create virtual contests with problems from notable problem archives.",
    "url": "http://vjudge.net"
  },
  {
    "name": "BNU Online Judge\nBNU Online Judge also allows users to create virtual contests.",
    "url": "http://www.bnuoj.com/v3/"
  },
  {
    "name": "Kattis\nKattis assists in contest preparation (E-mail them for assistance).",
    "url": "https://open.kattis.com/"
  },
  {
    "name": "Code Monk, by HackerEarth\nThis is a fantastic step-by-step guide to gear you up with some essential topics in competitive programming.",
    "url": "https://www.hackerearth.com/codemonk/"
  },
  {
    "name": "Stanford CS 97SI: Introduction to Competitive Programming Contests\nThis course offers comprehensive lecture slides and a short list of exercise problems.",
    "url": "http://web.stanford.edu/class/cs97si/"
  },
  {
    "name": "Reykjavik T-414-ÁFLV: A Competitive Programming Course\nAn awesome course taught by Bjarki Ágúst Guðmundsson (SuprDewd). These lectures feature neat slides and a nice list of problems to practice.",
    "url": "https://algo.is/competitive-programming-course/"
  },
  {
    "name": "NCTU DCP4631: Problem Solving and Programming Techniques\nA course on basic topics featuring good lecture slides.",
    "url": "https://sites.google.com/site/mzshieh/courses/problem-solving-and-programming-techniques-spring-2014"
  },
  {
    "name": "建國中學資訊科培訓 (CKHS Training) (Chinese)\nGood lecture materials made by CKHS Infor Club.",
    "url": "http://pisces.ck.tp.edu.tw/%7Epeng/index.php?year=2012"
  },
  {
    "name": "prakhar1989/awesome-courses#algorithms\nA fantastic list of open courses offered by notable institutions (MIT, Stanford, UC Berkeley ... etc.).",
    "url": "https://github.com/prakhar1989/awesome-courses#algorithms"
  },
  {
    "name": "MIT SMA 5503: Introduction to Algorithms\nThis one isn't included on the list above, but it's by far my personal favorite. This course was lectured by Prof. Charles Leiserson (coauthor of  Introduction to Algorithms) and Prof. Erik Demaine who is a brilliant and established scholar in the field. The course offered great materials and generally more intuitive proofs and analyses.",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-046j-introduction-to-algorithms-sma-5503-fall-2005/"
  },
  {
    "name": "Competitive Programming, by Steven and Felix Halim\nThis book contains a collection of relevant data structures, algorithms, and programming tips. It's a well-received book.\nThe first edition is free for download (pdf).",
    "url": "http://cpbook.net/"
  },
  {
    "name": "Programming Challenges: The Programming Contest Training Manual, by Steven Skiena and Miguel Revilla\nThis book includes more than 100 programming challenges, as well as the theory and key concepts necessary for approaching them. Problems are organized by topic, and supplemented by complete tutorial material.",
    "url": "http://www.amazon.com/Programming-Challenges-Contest-Training-Computer/dp/0387001638"
  },
  {
    "name": "Looking for a Challenge, written by a group of authors associated with the Polish Olympiads\nMost of the problems described in the book are really hard but they are explained in such a way that even beginners can understand.\nIt appears to be out of stock (as of Feb 10, 2016), but you can reserve one on their official website. ",
    "url": "http://www.lookingforachallengethebook.com/"
  },
  {
    "name": "Computational Geometry: Algorithms and Applications, by Mark de Berg, Otfried Cheong, Marc van Kreveld, Mark Overmars\nThis is a well-written book which covers a broad range of computational geometry problems.",
    "url": "http://www.amazon.com/Computational-Geometry-Applications-Mark-Berg/dp/3540779736"
  },
  {
    "name": "The Hitchhiker’s Guide to the Programming Contests, by Nite Nimajneb\nThis book is free for download (pdf). This book covered various topics relevant to competitive programming.",
    "url": "http://comscigate.com/Books/contests/icpc.pdf"
  },
  {
    "name": "プログラミングコンテストチャレンジブック (Japanese), by 秋葉拓哉, 岩田陽一, 北川宜稔\n培養與鍛鍊程式設計的邏輯腦：世界級程式設計大賽的知識、心得與解題分享 (Chinese Traditional)",
    "url": "http://goo.gl/M4yfbr"
  },
  {
    "name": "算法竞赛入门经典 (Chinese), by 刘汝佳\nThe Art of Algorithms and Programming Contests (English)\n打下好基礎：程式設計與演算法競賽入門經典 (Chinese Traditional)",
    "url": "http://www.tup.com.cn/booksCenter/book_05568701.html"
  },
  {
    "name": "算法竞赛入门经典——训练指南 (Chinese), by 刘汝佳, 陈锋\n提升程式設計的解題思考力─國際演算法程式設計競賽訓練指南 (Chinese Traditional)",
    "url": "http://www.amazon.cn/%E7%AE%97%E6%B3%95%E7%AB%9E%E8%B5%9B%E5%85%A5%E9%97%A8%E7%BB%8F%E5%85%B8-%E8%AE%AD%E7%BB%83%E6%8C%87%E5%8D%97-%E5%88%98%E6%B1%9D%E4%BD%B3/dp/B009SJJGOU"
  },
  {
    "name": "算法艺术与信息学竞赛 (Chinese), by 刘汝佳, 黄亮",
    "url": "http://goo.gl/O1tr8v"
  },
  {
    "name": "Introduction to Algorithms, by Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest and Clifford Stein\nAlso known as CLRS (taken from name initials), this book is often referred to as the \"bible\" for algorithms and data structures. It's one of the most popular textbooks for university algorithm courses. This book covered various algorithms and data structures in great detail. The writing is more rigorous and can be difficult to some.",
    "url": "https://mitpress.mit.edu/books/introduction-algorithms"
  },
  {
    "name": "Algorithm Design, by Jon Kleinberg and Éva Tardos\nThis book revolves around techniques for designing algorithms. It's well-organized and written in a clear, understandable language. Each chapter is backed with practical examples and helpful exercises. The chapter on network flow is highly praised by lots.\nThe lecture slides that accompany the textbook are available on its official website.",
    "url": "http://www.aw-bc.com/info/kleinberg/"
  },
  {
    "name": "The Algorithm Design Manual, by Steven S. Skiena\nThe book is written in more readable text. Some find it comprehensive than other books. You can also find some good resources (including the author's own video lectures) on its official website.",
    "url": "http://www.amazon.com/Algorithm-Design-Manual-Steven-Skiena/dp/1848000693"
  },
  {
    "name": "Algorithms, by Robert Sedgewick and Kevin Wayne\nThis book is neatly categorized, coupled with elaborate explanations and fantastic illustrations. It seems to be used in some IOI training camps as textbook.",
    "url": "http://www.amazon.com/Algorithms-4th-Robert-Sedgewick/dp/032157351X"
  },
  {
    "name": "Discrete Mathematics and Its Applications, by Kenneth H. Rosen\nDiscrete Mathematics is closely relevant to competitive programming. This book provides comprehensive materials on a wide range of topics including: Logics and Proofs, Sets, Functions, Sequences, Matrices, Number Theory, Recursion, Counting, Probablity, Graphs, Trees and Boolean Alegra to name but a few.",
    "url": "http://www.amazon.com/Discrete-Mathematics-Applications-Kenneth-Rosen/dp/0072899050"
  },
  {
    "name": "Concrete Mathematics: A Foundation for Computer Science, by Ronald L. Graham, Donald E. Knuth, Oren Patashnik\nThe book offers a deeper look into Discrete Mathematics with more stresses on number-related topics.",
    "url": "http://www.amazon.com/Concrete-Mathematics-Foundation-Computer-Science/dp/0201558025"
  },
  {
    "name": "Linear Algebra and Its Applications, by David C. Lay, Steven R. Lay, Judi J. McDonald\nThe book does a good job at bridging the gap between a physical system (for scientists and engineers) and an abstract system (for mathematicians).",
    "url": "http://www.amazon.com/Linear-Algebra-Its-Applications-5th/dp/032198238X/ref=sr_1_1?ie=UTF8&qid=1455475253&sr=8-1&keywords=Linear+Algebra+and+Its+Applications"
  },
  {
    "name": "Introduction to Probability, by Charles M. Grinstead, J. Laurie Snell\nThis is a well-written introductory probabilities book. It's free for download (pdf) (released under GNU Free Documentation License).",
    "url": "http://www.dartmouth.edu/%7Echance/teaching_aids/books_articles/probability_book/book.html"
  },
  {
    "name": "How to Solve It: A New Aspect of Mathematical Method, by G. Polya\nAn old-time classic. Overall, the author provides a systematic way to creatively solve problems.",
    "url": "http://www.amazon.com/How-Solve-It-Mathematical-Princeton/dp/069111966X"
  },
  {
    "name": "Codeforces\nCodeforces is one of the most popular contest platforms in the world. Currently maintained by Saratov State University, it features regular contests and numerous awesome original problems. Every contest provides immediate helpful tutorials. Furthermore, many warm-hearted Codeforces members kindly answers questions on Codeforces. One would indeed learn and improve tremendously here.",
    "url": "http://codeforces.com/"
  },
  {
    "name": "topcoder\ntopcoder has been around since 2001. Rich in history, It's considered to be one of the most prestigious organizations when it comes to technology competitions. Hundreds of SRMs gave birth to an abundant problemset. Problems here are typically more challenging than others and topcoder therefore appeals to many elite programmers . The annual topcoder Open (TCO) is also a widely-discussed event.",
    "url": "https://www.topcoder.com/"
  },
  {
    "name": "Google Code Jam\nGoogle Code Jam is certainly one of the most highly-esteemed programming competitions. The competition consists of unique programming challenges which must be solved in a fixed amount of time. Competitors may use any programming language and development environment to obtain their solutions.",
    "url": "https://code.google.com/codejam"
  },
  {
    "name": "CodeChef\nCodeChef is a non-profit educational initiative of Directi. It's a global competitive programming platform and has a large community of programmers that helps students and professionals test and improve their coding skills. Its objective is to provide a platform for practice, competition and improvement for both students and professional software developers. Apart from this, it aims to reach out to students while they are young and inculcate a culture of programming in India.",
    "url": "https://www.codechef.com/"
  },
  {
    "name": "SPOJ\nThe SPOJ platform is centered around an online judge system. It holds a staggering amount of problems prepared by its community of problem setters or taken from previous programming contests, some of which are great problems for practice (refer to the Problem classifiers section). SPOJ also allows advanced users to organize contests under their own rules.",
    "url": "http://www.spoj.com/"
  },
  {
    "name": "Timus\nTimus Online Judge is the largest Russian archive of programming problems with automatic judging system. Problems are mostly collected from contests held at the Ural Federal University, Ural Championships, Ural ACM ICPC Subregional Contests, and Petrozavodsk Training Camps.",
    "url": "http://acm.timus.ru/"
  },
  {
    "name": "SGU\nSGU is an old-school online judge maintained by Saratov State University. A high-rated competitive programmer",
    "url": "http://acm.sgu.ru/",
    "description": "Huang I-Wen (dreamoon) thinks that it's the hardest online judge because its problems require unusual skills."
  },
  {
    "name": "HDU\nHDU is an online judge maintained by Hangzhou Dianzi University. It's home to many classic problems from the Chinese IOI scene.",
    "url": "http://acm.hdu.edu.cn/"
  },
  {
    "name": "UVa\nAn old-school problem archive / online judge with rich history. Thousands of problems, including many classic ones, are featured here. However, it is strongly advised that you practice with uHunt following its \"Competitive Programming Exercise\" section.",
    "url": "https://uva.onlinejudge.org/"
  },
  {
    "name": "HackerRank\nHackerRank is a company that focuses on competitive programming challenges for both consumers and businesses. HackerRank's programming challenges can be solved in a variety of programming languages (including, but not limited to, Java, C++, PHP, SQL) and span multiple computer science domains.",
    "url": "https://www.hackerrank.com"
  },
  {
    "name": "POJ\nPOJ is an online judge maintained by Peking University. It holds a large amount of great problems.",
    "url": "http://poj.org/"
  },
  {
    "name": "Project Euler\nThere are lots of good math problems on this site. You may also discuss with others on its forum.",
    "url": "https://projecteuler.net/"
  },
  {
    "name": "Hackerearth\nHackerEarth is a startup technology company based in Bangalore, India that provides recruitment solutions. Its clients include Adobe, Altimetrik, Citrix Systems, InMobi, Symantec and Wipro.",
    "url": "https://www.hackerearth.com/"
  },
  {
    "name": "Aizu Online Judge\nAizu online judge is a contest platform and problem archive hosted by The University of Aizu. It has a lot of great problems from programming competitions in Japan.",
    "url": "http://judge.u-aizu.ac.jp/onlinejudge/index.jsp"
  },
  {
    "name": "A2 Online Judge (Mixed)",
    "url": "http://a2oj.com/Categories.jsp"
  },
  {
    "name": "Problem Classifier (SPOJ)",
    "url": "http://problemclassifier.appspot.com/"
  },
  {
    "name": "UVa Online Judge (Competitive Programming Book)",
    "url": "https://uva.onlinejudge.org/index.php?option=com_onlinejudge&Itemid=8"
  },
  {
    "name": "Codeforces Tags (DP as an example)",
    "url": "http://codeforces.com/problemset/tags/dp"
  },
  {
    "name": "HackerRank",
    "url": "https://www.hackerrank.com/domains/algorithms/warmup"
  },
  {
    "name": "Lucky貓的 UVA（ACM）園地 (Chinese)",
    "url": "http://luckycat.kshs.kh.edu.tw/"
  },
  {
    "name": "Programming Contest Calendar | HackerRank",
    "url": "https://www.hackerrank.com/calendar"
  },
  {
    "name": "clist.by",
    "url": "http://clist.by/"
  },
  {
    "name": "Coding Calendar (Android App)",
    "url": "https://play.google.com/store/apps/details?id=com.limitskyapps.CodingCalendar"
  },
  {
    "name": "Coder's Calendar: Android App, Chrome Extension, Firefox Add-on",
    "url": "https://github.com/nishanthvijayan/CoderCalendar"
  },
  {
    "name": "CodeHorizon: iOS App, Android App",
    "url": "http://www.star-lord.me/CodeHorizon/"
  },
  {
    "name": "Codeforces\nFor quick answers, Codeforces is definitely the go-to place to ask about anything competition-related.",
    "url": "http://codeforces.com/"
  },
  {
    "name": "Competitive Programming",
    "url": "https://www.quora.com/topic/Competitive-Programming",
    "description": "Quora"
  },
  {
    "name": "Theoretical Computer Science Stack Exchange\nThis place is generally for the academics, so don't ask questions about contest problems here.",
    "url": "http://cstheory.stackexchange.com/"
  },
  {
    "name": "Codeforces blogs",
    "url": "http://codeforces.com/"
  },
  {
    "name": "Petr Mitrichev (Petr): Algorithms Weekly",
    "url": "http://petr-mitrichev.blogspot.com/"
  },
  {
    "name": "Bruce Merry (bmerry): Entropy always increases",
    "url": "http://blog.brucemerry.org.za/"
  },
  {
    "name": "Przemysław Dębiak (Psyho): Psyho's blog",
    "url": "http://psyho.gg/"
  },
  {
    "name": "Anudeep Nekkanti (anudeep2011): Namespace Anudeep ;)",
    "url": "http://blog.anudeep2011.com/"
  },
  {
    "name": "vexorian (vexorian): vexorian's blog",
    "url": "http://www.vexorian.com/"
  },
  {
    "name": "Ashar Fuadi (fushar): Fushar's blog",
    "url": "http://fusharblog.com/"
  },
  {
    "name": "LiJie Chen (WJMZBMR): WJMZBMR (Chinese)",
    "url": "http://wjmzbmr.com/"
  },
  {
    "name": "Huang I-Wen (dreamoon): 小月的耍廢日誌 (Chinese)",
    "url": "http://dreamoon4.blogspot.tw/"
  },
  {
    "name": "Po-Jui Chen (a00012025): code倉庫 (Chinese)",
    "url": "http://cbdcoding.blogspot.tw/"
  },
  {
    "name": "Shiang-Yun Yang (morris1028): Morris' Blog (Chinese)",
    "url": "http://morris821028.github.io/"
  },
  {
    "name": "Yuhao Du (TooDifficuIt, TooSimple, xudyh): xudyh (Chinese, Emptied)",
    "url": "http://xudyh.github.io/"
  },
  {
    "name": "Dreadnought (TankEngineer, rowdark, AngryBacon): Dreadnought's Wiki (Chinese)",
    "url": "http://dreadnought.icpc-camp.org/"
  },
  {
    "name": "HackerRank Live Youtube",
    "url": "https://www.youtube.com/channel/UCmyXobPA1T5Vsf28lrBkiSw"
  },
  {
    "name": "Petr Mitrichev (Petr): Youtube",
    "url": "https://www.youtube.com/channel/UCdmeooqNtlN7IhrKlq7hGDA"
  },
  {
    "name": "Egor Kulikov (Egor): Youtube",
    "url": "https://www.youtube.com/channel/UCjlLfxSPkYluCDetlwbLpjQ"
  },
  {
    "name": "Adam Bardashevich (subscriber): Youtube",
    "url": "https://www.youtube.com/channel/UCc4jWVeWjUfpUo8z4PHfopw"
  },
  {
    "name": "Bohdan Pryshchenko (I_love_Tanya_Romanova): Twitch, Youtube",
    "url": "https://www.twitch.tv/lebron_stream"
  },
  {
    "name": "Vladimir Smykalov (enot.1.10): Twitch, Youtube",
    "url": "https://www.twitch.tv/enot110"
  },
  {
    "name": "Aleksandar Abas (Alex7): Youtube",
    "url": "https://www.youtube.com/channel/UCQ5k0-BMFhfvfJQik1r5ZVw"
  },
  {
    "name": "The 'science' of training in competitive programming",
    "url": "http://codeforces.com/blog/entry/17842",
    "description": "Codeforces, by Thanh Trung Nguyen (I_love_Hoang_Yen)"
  },
  {
    "name": "If you ask me how to improve your algorithm competition skill, I will give you the link of this blog.",
    "url": "http://codeforces.com/blog/entry/16599",
    "description": "Codeforces, by Huang I-Wen (dreamoon)"
  },
  {
    "name": "How do I start competitive programming?",
    "url": "https://www.quora.com/How-do-I-start-competitive-programming-5",
    "description": "Quora"
  },
  {
    "name": "How can I become good at competitive programming?",
    "url": "https://www.quora.com/How-can-I-become-good-at-competitive-programming-Are-there-any-courses-that-will-take-me-one-step-forward-before-I-start-doing-SPOJ-or-TopCoder-problems",
    "description": "Quora"
  },
  {
    "name": "How is competitive programming different from real-life programming?",
    "url": "https://www.quora.com/How-is-competitive-programming-different-from-real-life-programming",
    "description": "Quora"
  },
  {
    "name": "What have you gained from competitive programming?",
    "url": "https://www.quora.com/What-have-you-gained-from-competitive-programming",
    "description": "Quora"
  },
  {
    "name": "LeetCode Video Tutorials\nA set of videos explaining LeetCode problems.",
    "url": "https://www.youtube.com/playlist?list=PLvHc59peqCbM43SNkoQpk59Ys05kHbHjH"
  },
  {
    "name": "数据结构与算法/leetcode/lintcode题解 (LeetCode tutorials) (Chinese)\nThis site offers tutorials on popular interview topics.",
    "url": "http://algorithm.yuanbin.me/zh-hans/index.html"
  }
]
