[
  {
    "name": "Codingame",
    "url": "https://www.codingame.com/home",
    "description": "A platform to learn and compete. Proposes a variety of multiplayer games and contests as well as optimisation challenges and solo puzzles. You can contribute your own too. Choose your language, enjoy the graphics."
  },
  {
    "name": "CodeCombat",
    "url": "https://codecombat.com",
    "description": "Choose your hero and code your way through the ogre patrols, lava pits, and laser beams of Kithgard Dungeon. Level up, earn gems, and loot magic items to unlock new programming powers. Join millions of players and go from a total beginner to writing advanced multiplayer AI in Python, JavaScript, CoffeeScript, or Lua in this open-source programming game."
  },
  {
    "name": "Vindinium",
    "url": "https://www.codingame.com/multiplayer/bot-programming/vindinium",
    "description": "Players write scripts in the programming language of their choice (optionally using one of the many starter packs) to control a 16-bit hero through HTTP requests, guiding him to collect gold, do battle with other players, and even visit the tavern."
  },
  {
    "name": "RealTimeBattle",
    "url": "http://realtimebattle.sourceforge.net",
    "description": "A programming game in which robots controlled by programs are fighting each other. The goal is to destroy the enemies, using the radar to examine the environment and the cannon to shoot."
  },
  {
    "name": "Battlesnake",
    "url": "https://play.battlesnake.com",
    "description": "Join a community of developers from around the world as you compete for fame and glory in Battlesnake, a multi-player programming competition based on the classic game - snake! All you need to play is a live web server that implements the Battlesnake API and the language of your choice to begin battling to find food, avoid other Battlesnakes, and stay alive as long as possible."
  },
  {
    "name": "Robocode",
    "url": "https://github.com/turkishviking/Python-Robocode",
    "description": "The goal is to develop a robot battle tank to battle against other tanks. The robot battles are running in real-time and on-screen."
  },
  {
    "name": "Robot Rumble",
    "url": "https://robotrumble.org/",
    "description": "A free and open source AI competition platform. Code an algorithm for a team of robots battling in 1x1 grid-based arenas, and test your skills against others on the site. Robots can move and attack in one of four directions, and the team with more robots after 100 turns wins. Supports Python and Javascript, and comes with a desktop-based command line tool."
  },
  {
    "name": "Robocode",
    "url": "https://robocode.sourceforge.io",
    "description": "The goal is to develop a robot battle tank to battle against other tanks. The robot battles are running in real-time and on-screen."
  },
  {
    "name": "Screeps",
    "url": "https://screeps.com",
    "description": "No point and clicking any longer! You write real JavaScript which controls your units autonomously. Any time, everywhere, even while you are offline."
  },
  {
    "name": "JavaScript Fight Club",
    "url": "https://jsfight.club",
    "description": "The Red King and the Blue King are at war! Your JavaScript skills are needed to determine the victor: Can you code an effective AI for honor and glory?"
  },
  {
    "name": "Elevator Saga",
    "url": "http://play.elevatorsaga.com",
    "description": "Write JavaScript directly in the browser to program an elevator, such that it reaches its efficiency goals. Start with simple \"getting started\" scripts, and ramp up to much more complex situations with many floors and multiple elevators."
  },
  {
    "name": "Untrusted",
    "url": "https://alexnisnevich.github.io/untrusted",
    "description": "The game presents you with a roguelike-like playing environment and a console window with the JavaScript code generating each level. As loaded, each level is unbeatable, and most of the JavaScript is blocked from editing. The challenge is to open a path to the next level using only the limited tools left open to you."
  },
  {
    "name": "Robot Rumble",
    "url": "https://robotrumble.org/",
    "description": "A free and open source AI competition platform. Code an algorithm for a team of robots battling in 1x1 grid-based arenas, and test your skills against others on the site. Robots can move and attack in one of four directions, and the team with more robots after 100 turns wins. Supports Python and Javascript, and comes with a desktop-based command line tool."
  },
  {
    "name": "Robocode",
    "url": "http://robocode.sourceforge.io/robocode.dotnet",
    "description": "The goal is to develop a robot battle tank to battle against other tanks. The robot battles are running in real-time and on-screen."
  },
  {
    "name": "Code Hero",
    "url": "http://www.codehero.org",
    "description": "A first-person coding puzzle platformer that equips you with a code ray that casts C# at your target."
  },
  {
    "name": "RubyWarrior",
    "url": "https://www.bloc.io/ruby-warrior",
    "description": "A browser based game where you control your avatar through various levels filled with enemies using Ruby."
  },
  {
    "name": "Embedded Security CTF",
    "url": "https://microcorruption.com",
    "description": "The purpose is to bypass a series of locks, essentially hacking them, in order to get through a series of warehouses."
  },
  {
    "name": "Box-256",
    "url": "http://box-256.com",
    "description": "Write assembly code to match a shown graphic."
  },
  {
    "name": "Robocode",
    "url": "https://github.com/d6y/scala-robot-dev",
    "description": "The goal is to develop a robot battle tank to battle against other tanks in Java or .NET. The robot battles are running in real-time and on-screen."
  },
  {
    "name": "Scalatron",
    "url": "http://scalatron.github.io",
    "description": "Coders pit bot programs (written in Scala) against each other. It is an educational resource for groups of programmers or individuals that want to learn more about the Scala programming language or want to hone their Scala programming skills."
  },
  {
    "name": "Generals IO",
    "url": "http://generals.io",
    "description": "A fast-paced strategy game where you expand your land and battle with enemies over theirs. You lose when your general is taken, but capturing an opponent's general gives you control of their entire empire."
  },
  {
    "name": "Robo Dojo",
    "url": "http://robodojo.club",
    "description": "You build robots that build, corrupt and destroy other robots in an attempt to eliminate all competitors."
  },
  {
    "name": "Corewars",
    "url": "http://www.corewars.org",
    "description": "A game of warrior vs warrior, programmed by two opponents, and placed into a virtual 'ring' to fight to the death."
  },
  {
    "name": "TIS-100",
    "url": "http://www.zachtronics.com/tis-100",
    "description": "Open-ended programming game by Zachtronics, the creators of SpaceChem and Infinifactory, in which you rewrite corrupted code segments to repair the TIS-100 and unlock its secrets. It's the assembly language programming game you never asked for!"
  },
  {
    "name": "Shenzhen I/O",
    "url": "http://www.zachtronics.com/shenzhen-io",
    "description": "You build circuits using a variety of components from different manufacturers, like microcontrollers, memory, and logic gates, and then write code in a compact and powerful assembly language where every instruction can be conditionally executed."
  },
  {
    "name": "MHRD",
    "url": "http://store.steampowered.com/app/576030",
    "description": "Hardware design game, in which you design various hardware circuits in a hardware description language. The hardware circuits you design get more complex as you go until you create a fully functional CPU design."
  },
  {
    "name": "Colobot",
    "url": "https://colobot.info",
    "description": "3D video game where you program your bots to ride, fly, find, bring, refuel and destroy. Game is using a language called CBOT, similar to C++ and Java. Colobot offers tutorialed campaign with gradually harder tasks or you can play scenarios to challenge your skill."
  },
  {
    "name": "Code Games",
    "url": "http://codegames.io/en",
    "description": "Real time programming game where you compete against other players by coding the behaviour of a space ship. The programming language is easy to learn and the game is super fun. Subscribe to one of our tournaments and compete for the prize."
  },
  {
    "name": "Mudlet",
    "url": "http://www.mudlet.org",
    "description": "Game client that allows you to play MUDs (text-only MMORPGs). You can write Lua code in Mudlet to help you play MUDs."
  },
  {
    "name": "CSS Diner",
    "url": "http://flukeout.github.io",
    "description": "A CSS item arrangement game, teaching the concepts and use of CSS selectors and layout. You modify CSS to arrange HTML elements representing plates and bento boxes on a dining table."
  },
  {
    "name": "Guido van Robot",
    "url": "http://gvr.sourceforge.net",
    "description": "Programming language and free software application designed to introduce beginners to the fundamentals of programming. GvR runs on Windows, Macintosh, and GNU/Linux, in a variety of languages! It's great in both the classroom and the home as a way of introducing people to the basic concepts of programming."
  }
]
