[
  {
    "name": "MvvmCross (label: first-timers-only)  The .NET MVVM framework for cross-platform solutions, including Xamarin.iOS, Xamarin.Android, Windows and Mac.",
    "url": "https://github.com/MvvmCross/MvvmCross"
  },
  {
    "name": "RawCMS (label: good-first-issue)  RawCMS is a headless CMS written in ASP.NET Core, built for developers that embrace API-first technology.",
    "url": "https://github.com/arduosoft/RawCMS"
  },
  {
    "name": "Shouldly (label: Jump-In)  Should testing for .NET",
    "url": "https://github.com/shouldly/shouldly",
    "description": "the way Asserting Should be!"
  },
  {
    "name": "Neovim (label: good-first-issue)  Vim-fork focused on extensibility and agility.",
    "url": "https://github.com/neovim/neovim"
  },
  {
    "name": "Profanity (label: good-first-issue)  Ncurses XMPP chat client.",
    "url": "https://github.com/profanity-im/profanity"
  },
  {
    "name": "Cake (label: Good-first-issue)  Cake (C# Make) is a free and open source cross-platform build automation system with a C# DSL for tasks such as compiling code, copying files and folders, running unit tests, compressing files and building NuGet packages.",
    "url": "https://github.com/cake-build/cake"
  },
  {
    "name": "grok.net (label: good-first-issue)  Cross platform .NET grok implementation",
    "url": "https://github.com/Marusyk/grok.net"
  },
  {
    "name": "OpenRA (label: Easy)  A Real Time Strategy game engine supporting early Westwood classics such as Command & Conquer: Red Alert.",
    "url": "https://github.com/OpenRA/OpenRA"
  },
  {
    "name": "osu! (label: good-first-issue)  Music game. Rhythm is just a click away!",
    "url": "https://github.com/ppy/osu"
  },
  {
    "name": "Uno Platform (label: good-first-issue)  OSS project for creating pixel-perfect, single-source C# and XAML apps which run natively on iOS, Android, macOS, Linux and Web via WebAssembly.",
    "url": "https://github.com/unoplatform/uno"
  },
  {
    "name": "electron (label: good-first-issue)  Build cross platform desktop apps with JavaScript, HTML, and CSS",
    "url": "https://github.com/electron/electron"
  },
  {
    "name": "Godot Engine (label: good first issue)  2D and 3D cross-platform game engine. Also has C# and Python code.",
    "url": "https://github.com/godotengine/godot"
  },
  {
    "name": "MoveIt (label: good-first-issue)  Easy-to-use open source robotics manipulation platform for developing commercial applications, prototyping designs, and benchmarking algorithms.",
    "url": "https://github.com/ros-planning/moveit"
  },
  {
    "name": "projectM (label: good-first-issue)  A music visualizer library using OpenGL and GLSL. Has applications using Qt5, SDL, emscripten, iTunes, Kodi.",
    "url": "https://github.com/projectM-visualizer/projectm"
  },
  {
    "name": "Roc Toolkit (label: help-wanted)  A toolkit for real-time audio streaming over the network.",
    "url": "https://github.com/roc-streaming/roc-toolkit"
  },
  {
    "name": "tensorflow (label: stat:contributions-welcome)  Computation using data flow graphs for scalable machine learning",
    "url": "https://github.com/tensorflow/tensorflow"
  },
  {
    "name": "Yugabyte DB (label: good-first-issue)  Distributed SQL database.",
    "url": "https://github.com/yugabyte/yugabyte-db"
  },
  {
    "name": "Alda (label: low-hanging-fruit)  A music programming language for musicians. 🎶",
    "url": "https://github.com/alda-lang/alda"
  },
  {
    "name": "LightTable (label: good-first-issue)  The Next Generation code editor! One of the top funded projects on KickStarter.",
    "url": "https://github.com/LightTable/LightTable"
  },
  {
    "name": "sButtons (label: good-first-issue)  Simple buttons you can easily use for your next project.",
    "url": "https://github.com/shahednasser/sbuttons"
  },
  {
    "name": "dart.dev (label: beginner)  A website covering Dart language and common libraries, for developers of Dart libraries, web apps, server-side code, and mobile (Flutter) apps.",
    "url": "https://github.com/dart-lang/site-www"
  },
  {
    "name": "flutter (label: good first contribution)  Flutter is Google's UI toolkit for building beautiful, natively compiled applications for mobile, web, desktop, and embedded devices from a single codebase.",
    "url": "https://github.com/flutter/flutter"
  },
  {
    "name": "Ecto (label: Level:Starter)  Ecto is a database wrapper and language integrated query for Elixir",
    "url": "https://github.com/elixir-ecto/ecto"
  },
  {
    "name": "Elixir (label: Level:Starter)  Elixir is a dynamic, functional language designed for building scalable and maintainable applications",
    "url": "https://github.com/elixir-lang/elixir"
  },
  {
    "name": "containerd (label: exp/beginner)  Industry-standard container runtime with an emphasis on simplicity, robustness and portability.",
    "url": "https://github.com/containerd/containerd"
  },
  {
    "name": "Docker/CLI (label: exp/beginner)  The Docker CLI",
    "url": "https://github.com/docker/cli"
  },
  {
    "name": "Helm (label: good-first-issue)  The Kubernetes Package Manager",
    "url": "https://github.com/kubernetes/helm"
  },
  {
    "name": "httpexpect (label: help-wanted)  End-to-end HTTP and REST API testing for Go.",
    "url": "https://github.com/gavv/httpexpect"
  },
  {
    "name": "Hugo (label: GoodFirstIssue)  A Fast and Flexible Static Site Generator built with love in GoLang",
    "url": "https://github.com/gohugoio/hugo"
  },
  {
    "name": "Killgrave (label: good-first-issue)  Simple way to generate mock servers in Go.",
    "url": "https://github.com/friendsofgo/killgrave"
  },
  {
    "name": "Kubernetes (label: good-first-issue)  Production-Grade Container Scheduling and Management System",
    "url": "https://github.com/kubernetes/kubernetes"
  },
  {
    "name": "lxd (label: easy)  System container and virtual machine manager.",
    "url": "https://github.com/lxc/lxd"
  },
  {
    "name": "Mattermost (label: n/a)  Open source Slack-alternative in Golang and React",
    "url": "https://github.com/mattermost/mattermost-server/issues?utf8=%E2%9C%93&q=is:open+label:%22Up+For+Grabs%22+label:%22Difficulty/1:Easy%22+label:%22Tech/Go%22"
  },
  {
    "name": "Meshery (label: good-first-issue)  Meshery, the service mesh management plane.",
    "url": "https://github.com/layer5io/meshery"
  },
  {
    "name": "Moby (label: exp/beginner)  Open-source application container engine",
    "url": "https://github.com/moby/moby"
  },
  {
    "name": "PureLB (label: n/a)  Load-balancer orchestrator for Kubernetes that uses standard Linux networking and routing protocols.",
    "url": "https://gitlab.com/purelb/purelb/-/issues?label_name%5B%5D=GoodFirstIssue"
  },
  {
    "name": "script (label: good-first-issue)  A Go library for doing the kind of tasks that shell scripts are good at: reading files, executing subprocesses, counting lines, matching strings, and so on. Beginners are very welcome and will get detailed code review and help through the PR process.",
    "url": "https://github.com/bitfield/script"
  },
  {
    "name": "Terraform (label: good-first-issue)  A tool for building, changing, and versioning infrastructure safely and efficiently.",
    "url": "https://github.com/hashicorp/terraform"
  },
  {
    "name": "TiDB (label: for-new-contributors)  A distributed scalable Hybrid Transactional and Analytical Processing (HTAP) database",
    "url": "https://github.com/pingcap/tidb"
  },
  {
    "name": "appsmith (label: good-first-issue)  Drag & Drop internal tool builder",
    "url": "https://github.com/appsmithorg/appsmith"
  },
  {
    "name": "Codename One (label: good-first-issue)  Cross-platform mobile app development framework for Java developers",
    "url": "https://github.com/codenameone/CodenameOne"
  },
  {
    "name": "elasticsearch (label: good-first-issue)  Open Source, Distributed, RESTful Search Engine.",
    "url": "https://github.com/elastic/elasticsearch"
  },
  {
    "name": "Images-to-PDF (label: good-first-issue)  An android app to convert images to PDF file.",
    "url": "https://github.com/Swati4star/Images-to-PDF"
  },
  {
    "name": "JabRef (label: good-first-issue)  Desktop application for managing literature references using modern Java features including JavaFX. Dedicated to code quality and constructive feedback: Each Pull Request is reviewed by two developers to provide high-quality feedback and to ensure high quality of new contributions.",
    "url": "https://github.com/JabRef/jabref"
  },
  {
    "name": "OpenMetadata (label: good first issue)  OpenMetadata is an all-in-one platform for data discovery, data quality, observability, governance, data lineage, and team collaboration.",
    "url": "https://github.com/open-metadata/OpenMetadata"
  },
  {
    "name": "SirixDB (label: good-first-issue)  SirixDB is an evolutionary, versioned NoSQL document store (XML and JSON) written (mostly) in Java. It stores compact snapshots during commits with many concepts borrowed from ZFS and Git. Each revision is indexed and the document store can be queried with temporal queries. It's especially well suited for modern hardware.",
    "url": "https://github.com/sirixdb/sirix"
  },
  {
    "name": "Strongbox (label: good-first-issue)  Strongbox is an artifact repository manager written in Java.",
    "url": "https://github.com/strongbox/strongbox"
  },
  {
    "name": "TEAMMATES (label: good-first-issue)  TEAMMATES is a free online tool for managing peer evaluations and other feedback paths of your students.",
    "url": "https://github.com/TEAMMATES/teammates"
  },
  {
    "name": "Trino (formerly Presto SQL) (label: good-first-issue)  A distributed SQL query engine for big data. Ask for guidance on project's Slack.",
    "url": "https://github.com/trinodb/trino"
  },
  {
    "name": "Wikimedia Commons Android App (label: good-first-issue)  Allows users to upload pictures from their Android phone/tablet to Wikimedia Commons.",
    "url": "https://github.com/commons-app/apps-android-commons"
  },
  {
    "name": "XWiki (label: n/a)  XWiki is a free wiki software platform written in Java with a design emphasis on extensibility. Beginners should follow the onboarding wiki.",
    "url": "https://jira.xwiki.org/issues/?jql=labels-%3D-Onboarding"
  },
  {
    "name": "zerocode (label: good-first-issue)  API Automation without coding, easy JSON response assertions, Testing REST, SOAP, Kafka and Java/DB APIs, CI/Jenkins Friendly.",
    "url": "https://github.com/authorjapps/zerocode"
  },
  {
    "name": "altair (label: good-first-issue)  A beautiful feature-rich GraphQL Client for all platforms.",
    "url": "https://github.com/imolorhe/altair"
  },
  {
    "name": "Ancient Beast (label: easy)  Turn based strategy game where you 3d print a squad of creatures with unique abilities in order to defeat your enemies.",
    "url": "https://github.com/FreezingMoon/AncientBeast"
  },
  {
    "name": "appsmith (label: good-first-issue)  Drag & Drop internal tool builder",
    "url": "https://github.com/appsmithorg/appsmith"
  },
  {
    "name": "AVA (label: good-for-beginner)  Futuristic test runner.",
    "url": "https://github.com/sindresorhus/ava"
  },
  {
    "name": "Babel (label: good-first-issue)  A compiler for writing next generation JavaScript.",
    "url": "https://github.com/babel/babel"
  },
  {
    "name": "Binari (label: up-for-grabs)  Interactive code editor with a live binary tree visual designed to teach new developers the fundementals of dynamic programming.",
    "url": "https://github.com/BrandonArmand/Binari"
  },
  {
    "name": "Botpress (label: contributor-friendly)  The only sane way to build great bots.",
    "url": "https://github.com/botpress/botpress"
  },
  {
    "name": "Brave Browser (label: good-first-issue)  Desktop browser for macOS, Windows, and Linux.",
    "url": "https://github.com/brave/brave-browser"
  },
  {
    "name": "cdnjs (label: good-first-issue)  The best FOSS web front-end resource CDN",
    "url": "https://github.com/cdnjs/cdnjs"
  },
  {
    "name": "Check It Out (label: good-first-issue)  Check It Out is an ncurses-like CLI to let the user interactively navigate and select a git branch to check out.",
    "url": "https://github.com/jwu910/check-it-out"
  },
  {
    "name": "Create React App (label: good-first-issue)  Create React apps with no build configuration.",
    "url": "https://github.com/facebook/create-react-app"
  },
  {
    "name": "cypress (label: good first issue)  Fast, easy and reliable testing for anything that runs in a browser.",
    "url": "https://github.com/cypress-io/cypress"
  },
  {
    "name": "electron (label: good-first-issue)  Build cross platform desktop apps with JavaScript, HTML, and CSS",
    "url": "https://github.com/electron/electron"
  },
  {
    "name": "Ember.js (label: Good-for-New-Contributors)  A JavaScript framework for creating ambitious web applications.",
    "url": "https://github.com/emberjs/ember.js"
  },
  {
    "name": "Ember.js Data (label: Good-for-New-Contributors)  A data persistence library for Ember.js.",
    "url": "https://github.com/emberjs/data"
  },
  {
    "name": "ESLint (label: good-first-issue)  A fully pluggable tool for identifying and reporting on patterns in JavaScript.",
    "url": "https://github.com/eslint/eslint"
  },
  {
    "name": "eslint-plugin-unicorn (label: good-for-beginner)  Awesome ESLint rules.",
    "url": "https://github.com/sindresorhus/eslint-plugin-unicorn"
  },
  {
    "name": "Fastify (label: good-first-issue)  Fast and low overhead web framework, for Node.js.",
    "url": "https://github.com/fastify/fastify"
  },
  {
    "name": "freeCodeCamp (label: first-timers-only)  Open source codebase and curriculum. Learn to code and help nonprofits.",
    "url": "https://github.com/freeCodeCamp/freeCodeCamp"
  },
  {
    "name": "Gatsby.js (label: good-first-issue)  Build blazing fast, modern apps and websites with React.",
    "url": "https://github.com/gatsbyjs/gatsby"
  },
  {
    "name": "Ghost (label: good-first-issue)  Just a blogging platform",
    "url": "https://github.com/TryGhost/Ghost"
  },
  {
    "name": "Habitica (label: good-first-issue)  Habitica is a gamified task manager, webapp and android/ios app, really wonderful atmosphere. Guidance for contributing here (mongo, express, vue, node stack for webapp)",
    "url": "https://github.com/HabitRPG/habitica"
  },
  {
    "name": "Hoppscotch (label: good-first-issue)  A free, fast and beautiful API request builder.",
    "url": "https://github.com/hoppscotch/hoppscotch"
  },
  {
    "name": "Hyper (label: good-first-issue)  JS/HTML/CSS Terminal",
    "url": "https://github.com/zeit/hyper"
  },
  {
    "name": "iD (label: good-first-issue)  The easy-to-use OpenStreetMap editor in JavaScript.",
    "url": "https://github.com/openstreetmap/iD"
  },
  {
    "name": "Jest (label: good-first-issue)  A complete and easy to set up JavaScript testing solution.",
    "url": "https://github.com/facebook/jest"
  },
  {
    "name": "json-editor (label: good-first-issue)  JSON Schema Based Editor. JSON Editor takes a JSON Schema and uses it to generate an HTML form. It has full support for JSON Schema version 3 and 4 and can integrate with several popular CSS frameworks (bootstrap, spectre, tailwind).",
    "url": "https://github.com/json-editor/json-editor"
  },
  {
    "name": "Kap (label: good-first-issue)  An open-source screen recorder built with web technology",
    "url": "https://github.com/wulkano/kap"
  },
  {
    "name": "Kinto.js (label: easy-pick)  An offline-first JavaScript client leveraging the Kinto API for remote data synchronization.",
    "url": "https://github.com/Kinto/kinto.js"
  },
  {
    "name": "Leaflet (label: good-first-issue)  JavaScript library for mobile-friendly interactive maps.",
    "url": "https://github.com/Leaflet/Leaflet"
  },
  {
    "name": "Letra Extension (label: good-first-issue)  Passively learn a new language every time you open a new tab.",
    "url": "https://github.com/jayehernandez/letra-extension"
  },
  {
    "name": "material-ui (label: good-first-issue)  React components for faster and easier web development. Build your own design system, or start with Material Design.",
    "url": "https://github.com/mui-org/material-ui"
  },
  {
    "name": "Mattermost (label: n/a)  Open source Slack-alternative in Golang and React",
    "url": "https://github.com/mattermost/mattermost-server/issues?utf8=%E2%9C%93&q=is:open+label:%22Up+For+Grabs%22+label:%22Difficulty/1:Easy%22+label:%22Tech/Go%22"
  },
  {
    "name": "md-page (label: good-first-issue)  Create a webpage with just markdown.",
    "url": "https://github.com/oscarmorrison/md-page"
  },
  {
    "name": "Meteor (label: good-first-issue)  Meteor is an ultra-simple environment for building modern web applications.",
    "url": "https://github.com/meteor/meteor"
  },
  {
    "name": "Mocha (label: good-first-issue)  Javascript test framework for Node.js and the browser.",
    "url": "https://github.com/mochajs/mocha"
  },
  {
    "name": "Moment.js (label: Up-For-Grabs)  A lightweight JavaScript date library for parsing, validating, manipulating, and formatting dates.",
    "url": "https://github.com/moment/moment"
  },
  {
    "name": "name-suggestion-index (label: good-first-issue)  Canonical common brand names for OpenStreetMap",
    "url": "https://github.com/osmlab/name-suggestion-index"
  },
  {
    "name": "NativeScript (label: good-first-issue)  NativeScript is an open source framework for building truly native mobile apps with JavaScript. Use web skills, like Angular and Vue.js, FlexBox and CSS, and get native UI and performance on iOS and Android.",
    "url": "https://github.com/NativeScript/NativeScript"
  },
  {
    "name": "netlify-cms (label: good-first-issue)  Open source content management for your git workflow.",
    "url": "https://github.com/netlify/netlify-cms"
  },
  {
    "name": "Next.js (label: good-first-issue)  A minimalistic framework for universal server-rendered React applications",
    "url": "https://github.com/zeit/next.js"
  },
  {
    "name": "Node.js core (label: good-first-issue)  JavaScript runtime built on Chrome's V8 JavaScript engine",
    "url": "https://github.com/nodejs/node"
  },
  {
    "name": "nuclear (label: good-first-issue)  Multiplatform music player that streams from free sources.",
    "url": "https://github.com/nukeop/nuclear"
  },
  {
    "name": "p5.js (label: good-first-issue)  p5.js is a client-side JS platform that empowers artists, designers, students, and anyone to learn to code and express themselves creatively on the web.",
    "url": "https://github.com/processing/p5.js"
  },
  {
    "name": "pixi.js (label: 🤩 Good First PR)  A 2D JavaScript Renderer",
    "url": "https://github.com/pixijs/pixi.js"
  },
  {
    "name": "PouchDB (label: help-wanted)  PouchDB is a pocket-sized database.",
    "url": "https://github.com/pouchdb/pouchdb"
  },
  {
    "name": "Predator (label: good-first-issue)  A powerful open-source platform for load testing APIs.",
    "url": "https://github.com/Zooz/predator"
  },
  {
    "name": "ramda-adjunct (label: help-wanted)  Ramda Adjunct is the most popular and most comprehensive set of functional utilities for use with Ramda, providing a variety of useful, well tested functions with excellent documentation.",
    "url": "https://github.com/char0n/ramda-adjunct"
  },
  {
    "name": "React (label: good-first-issue)  A declarative, efficient, and flexible JavaScript library for building user interfaces.",
    "url": "https://github.com/facebook/react"
  },
  {
    "name": "React Help Create (label: first-timers-only)  This command line helps you create components, pages and even redux implementation for your react project.",
    "url": "https://github.com/Omar-Belghaouti/react-help-create"
  },
  {
    "name": "React Native (label: Good-first-issue)  A framework for building native apps with React.",
    "url": "https://github.com/facebook/react-native"
  },
  {
    "name": "React server (label: good-first-contribution)  React framework with server render for blazing fast page load and seamless transitions between pages in the browser.",
    "url": "https://github.com/redfin/react-server"
  },
  {
    "name": "React-content-loader (label: good-first-issue)  Tool to create your own react-content-loader easily.",
    "url": "https://github.com/danilowoz/create-content-loader"
  },
  {
    "name": "ReactiveSearch (label: good-first-issue-👋)  A UI components library for Elasticsearch: Available for React, Vue and React Native.",
    "url": "https://github.com/appbaseio/reactivesearch"
  },
  {
    "name": "reactjs.org (label: good-first-issue)  The documenation website for reactjs",
    "url": "https://github.com/reactjs/reactjs.org"
  },
  {
    "name": "Reddit Enhancement Suite (label: help-wanted)  A browser extension to enhance the Reddit browsing experience.",
    "url": "https://github.com/honestbleeps/Reddit-Enhancement-Suite"
  },
  {
    "name": "Semantic-UI-React (label: good-first-issue)  The official React integration for Semantic UI.",
    "url": "https://github.com/Semantic-Org/Semantic-UI-React"
  },
  {
    "name": "serverless (label: good-first-issue)  The Serverless Framework",
    "url": "https://github.com/serverless/serverless"
  },
  {
    "name": "SimplQ (label: good-first-issue)  Free online queue manager for easy and instant crowd control.",
    "url": "https://github.com/SimplQ/simplQ-frontend"
  },
  {
    "name": "SirixDB (label: good-first-issue)  A Svelte/Sapper based web front-end for SirixDB, which is a versioned NoSQL document store (XML and JSON) written in Java.",
    "url": "https://github.com/sirixdb/sirix-svelte-front-end"
  },
  {
    "name": "stryker (label: 👶 Good first issue)  The JavaScript mutation testing framework",
    "url": "https://github.com/stryker-mutator/stryker"
  },
  {
    "name": "Superalgos (label: good first issue)  A completely Open Source crypto trading bot rewarding good contributions with the SA(Superalgos)-Token.",
    "url": "https://github.com/Superalgos/Superalgos"
  },
  {
    "name": "Svelte (label: good-first-issue)  Component framework that runs at build time, converting your components into highly efficient imperative code that surgically updates the DOM.",
    "url": "https://github.com/sveltejs/svelte"
  },
  {
    "name": "swag-for-dev (label: good-first-issue)  Swag opportunities for developers.",
    "url": "https://github.com/swapagarwal/swag-for-dev"
  },
  {
    "name": "Tessel 2 CLI (label: contribution-starter)  Command line interface to Tessel 2.",
    "url": "https://github.com/tessel/t2-cli"
  },
  {
    "name": "Time to Leave (label: good-first-issue)  Working hours time tracker app based on Electron and Javascript.",
    "url": "https://github.com/thamara/time-to-leave"
  },
  {
    "name": "Vest (label: good-first-issue)  Validations framework inspired by unit testing frameworks.",
    "url": "https://github.com/ealush/vest"
  },
  {
    "name": "Video Hub App (label: good-first-issue)  Angular & Electron app for browsing and searching videos on your PC.",
    "url": "https://github.com/whyboris/Video-Hub-App"
  },
  {
    "name": "Video.js (label: good first issue)  The player framework",
    "url": "https://github.com/videojs/video.js"
  },
  {
    "name": "Vue CLI (label: good-first-issue)  Standard Tooling for Vue.js Development",
    "url": "https://github.com/vuejs/vue-cli"
  },
  {
    "name": "Vue Router (label: good-first-issue)  The official router for Vue.js.",
    "url": "https://github.com/vuejs/vue-router"
  },
  {
    "name": "Vue.js (label: good-first-issue)  The Progressive JavaScript Framework.",
    "url": "https://github.com/vuejs/vue"
  },
  {
    "name": "VuePress (label: good-first-issue)  Minimalistic Vue-powered static site generator",
    "url": "https://github.com/vuejs/vuepress"
  },
  {
    "name": "webdriver.io (label: first-timers-only)  Next-gen browser and mobile automation test framework for Node.js",
    "url": "https://github.com/webdriverio/webdriverio"
  },
  {
    "name": "Yarn (label: good-first-issue)  Fast, reliable, and secure dependency management.",
    "url": "https://github.com/yarnpkg/yarn"
  },
  {
    "name": "Julia Language: Good first issue (label: good-first-issue)  \"Move like Python, Run like C\"",
    "url": "https://github.com/JuliaLang/julia",
    "description": "A fresh approach to technical computing!"
  },
  {
    "name": "Julia Language: Help wanted (label: help-wanted)  \"Move like Python, Run like C\"",
    "url": "https://github.com/JuliaLang/julia",
    "description": "A fresh approach to technical computing!"
  },
  {
    "name": "Atrium (label: good-first-issue)  Multiplatform assertion library for Kotlin",
    "url": "https://github.com/robstoll/atrium"
  },
  {
    "name": "Hexagon (label: help-wanted)  A microservices toolkit written in Kotlin",
    "url": "https://github.com/hexagonkt/hexagon"
  },
  {
    "name": "Kotlin Libraries Playground (label: good-first-issue)  A playground to gain a wider and deeper knowledge of the libraries in the Kotlin ecosystem. Also the official sample for gradle refreshVersions.",
    "url": "https://github.com/LouisCAD/kotlin-libraries-playground"
  },
  {
    "name": "Non-Blocking SirixDB HTTP(S)-Server (label: good-first-issue)  A non-blocking HTTP(S)-Server for SirixDB, a temporal, evolutionary NoSQL document store for XML and JSON.",
    "url": "https://github.com/sirixdb/sirix"
  },
  {
    "name": "Algorithmic Pseudocode (label: good-first-issue)  A collection of language independent pseudocodes (pdf) for interview preparation and competitive programming.",
    "url": "https://github.com/just-a-visitor/algorithmic-pseudocode"
  },
  {
    "name": "tldr-pages (label: help-wanted)  Collaborative cheatsheets for console commands.",
    "url": "https://github.com/tldr-pages/tldr"
  },
  {
    "name": "Ravada (label: good-first-issue)  Remote Virtual Desktops Manager.",
    "url": "https://github.com/UPC/ravada"
  },
  {
    "name": "Appwrite (label: good-first-issue)  An End-to-end backend server for frontend and mobile developers. 🚀",
    "url": "https://github.com/appwrite/appwrite"
  },
  {
    "name": "Deployer (label: good-for-beginner)  A deployment tool written in PHP with support for popular frameworks out of the box.",
    "url": "https://github.com/deployphp/deployer"
  },
  {
    "name": "Drupal (label: n/a)  Leading open-source CMS for ambitious digital experiences that reach your audience across multiple channels.",
    "url": "https://www.drupal.org/getting-involved-guide"
  },
  {
    "name": "Flarum (label: Good-first-issue)  Simple forum software for building great communities.",
    "url": "https://github.com/flarum/core"
  },
  {
    "name": "Laravel Newsletters (label: good-first-issue)  A package that provides an easy way to integrate MailChimp with Laravel 5.",
    "url": "https://github.com/spatie/laravel-newsletter"
  },
  {
    "name": "Matomo (label: help-wanted)  Matomo is the leading Free/Libre open analytics platform.",
    "url": "https://github.com/matomo-org/matomo"
  },
  {
    "name": "MediaWiki (label: n/a)  The free and open-source wiki software package that powers Wikipedia.",
    "url": "https://phabricator.wikimedia.org/maniphest/query/4Q5_qR51u_oz/#R"
  },
  {
    "name": "NextCloud Server (label: good-first-issue)  Nextcloud server, a safe home for all your data.",
    "url": "https://github.com/nextcloud/server"
  },
  {
    "name": "OrgManager (label: beginners-only)  Supercharge your GitHub organizations!",
    "url": "https://github.com/orgmanager/orgmanager"
  },
  {
    "name": "PHP Censor (label: good-for-beginner)  Open source self-hosted continuous integration server for PHP projects.",
    "url": "https://github.com/php-censor/php-censor"
  },
  {
    "name": "phpMyAdmin (label: newbie)  Admin interface for MySQL written in PHP.",
    "url": "https://github.com/phpmyadmin/phpmyadmin"
  },
  {
    "name": "PrestaShop (label: good-first-issue)  The open source ecommerce solution to start your online business and start selling online.",
    "url": "https://github.com/PrestaShop/PrestaShop"
  },
  {
    "name": "Symfony (label: good-first-issue)  Symfony is a PHP framework for web applications and a set of reusable PHP components.",
    "url": "https://github.com/symfony/symfony"
  },
  {
    "name": "Ansible (label: easyfix)  A simple IT automation platform",
    "url": "https://github.com/ansible/ansible"
  },
  {
    "name": "ArviZ (label: Beginner)  Exploratory Anaylsis of Bayesian Models.",
    "url": "https://github.com/arviz-devs/arviz"
  },
  {
    "name": "Bokeh (label: good-first-issue)  Bokeh is an interactive visualization library for modern web browsers.",
    "url": "https://github.com/bokeh/bokeh"
  },
  {
    "name": "BorgBackup (label: easy)  Deduplicating backup program with compression and authenticated encryption.",
    "url": "https://github.com/borgbackup/borg"
  },
  {
    "name": "CiviWiki (label: good-first-issue)  Building a Better Democracy for the Internet Age",
    "url": "https://github.com/CiviWiki/OpenCiviWiki"
  },
  {
    "name": "coala (label: n/a)  A unified command-line interface for linting and fixing all your code, regardless of the programming languages you use.",
    "url": "https://github.com/issues?utf8=%E2%9C%93&q=is:open+is:issue+user:coala+label:difficulty/newcomer++no:assignee"
  },
  {
    "name": "Colossal-AI (label: good first issue)  An open-source deep learning system for large-scale model training and inference with high efficiency and low cost.",
    "url": "https://github.com/hpcaitech/ColossalAI"
  },
  {
    "name": "cookiecutter (label: good first issue)  A command-line utility that creates projects from cookiecutters (project templates). E.g. Python package projects, jQuery plugin projects.",
    "url": "https://github.com/cookiecutter/cookiecutter"
  },
  {
    "name": "Create aio app (label: good-first-issue)  A command line utility that creates the aiohttp template with the best practices.",
    "url": "https://github.com/aio-libs/create-aio-app"
  },
  {
    "name": "datascience (label: good-first-issue)  A Jupyter notebook Python library for introductory data science.",
    "url": "https://github.com/data-8/datascience"
  },
  {
    "name": "django cookiecutter (label: hacktoberfest)  An implementation of Python for backend web development.",
    "url": "https://github.com/pydanny/cookiecutter-django"
  },
  {
    "name": "Fabric (label: Low-hanging-fruit)  Pythonic remote execution and deployment.",
    "url": "https://github.com/fabric/fabric"
  },
  {
    "name": "H2O Wave (label: good first issue)  Realtime Web Apps and Dashboards framework for Python and R. Suited (not only) for AI audience.",
    "url": "https://github.com/h2oai/wave"
  },
  {
    "name": "jarvis (label: difficulty/newcomer)  A personal assistant for Linux, MacOs and Windows based on Command line Interface.",
    "url": "https://github.com/sukeesh/Jarvis"
  },
  {
    "name": "JARVIS-on-Messenger (label: Low-Hanging-Fruit)  💬 A community-driven python bot that aims to be as simple as possible to serve humans with their everyday tasks http://m.me/J.A.R.V.I.S.on.Messenger",
    "url": "https://github.com/swapagarwal/JARVIS-on-Messenger"
  },
  {
    "name": "Jupyter notebook (label: good-first-issue)  Jupyter interactive notebook.",
    "url": "https://github.com/jupyter/notebook"
  },
  {
    "name": "Kinto (label: easy-pick)  A lightweight JSON storage service with synchronisation and sharing abilities.",
    "url": "https://github.com/Kinto/kinto"
  },
  {
    "name": "Kinto.sh (label: first-timers-only)  Make Linux & Windows type like a mac.",
    "url": "https://github.com/rbreaves/kinto"
  },
  {
    "name": "Mailpile (label: Low-Hanging-Fruit)  A free & open modern, fast email client with user-friendly encryption and privacy features",
    "url": "https://github.com/mailpile/Mailpile"
  },
  {
    "name": "matplotlib (label: good-first-issue)  Matplotlib is a comprehensive library for creating static, animated, and interactive visualizations in Python.",
    "url": "https://github.com/matplotlib/matplotlib"
  },
  {
    "name": "MindsDB (label: good-first-issue)  MindsDB is an open source AI layer for existing databases.",
    "url": "https://github.com/mindsdb/mindsdb"
  },
  {
    "name": "mitmproxy (label: help-wanted)  An interactive TLS-capable intercepting HTTP proxy for penetration testers and software developers",
    "url": "https://github.com/mitmproxy/mitmproxy"
  },
  {
    "name": "mygpo (label: starter-issue)  The webservice for gpodder.net, a libre web service that allows users to manage their podcast subscriptions and discover new content.",
    "url": "https://github.com/gpodder/mygpo"
  },
  {
    "name": "mypy (label: good-first-issue)  An optional static typing for python.",
    "url": "https://github.com/python/mypy"
  },
  {
    "name": "OpenMetadata (label: good first issue)  OpenMetadata is an all-in-one platform for data discovery, data quality, observability, governance, data lineage, and team collaboration.",
    "url": "https://github.com/open-metadata/OpenMetadata"
  },
  {
    "name": "opsdroid (label: good-first-issue)  An open source chat-ops bot framework.",
    "url": "https://github.com/opsdroid/opsdroid"
  },
  {
    "name": "pandas (label: good-first-issue)  Flexible and powerful data analysis / manipulation library for Python, providing labeled data structures similar to R data.frame objects, statistical functions, and much more",
    "url": "https://github.com/pandas-dev/pandas"
  },
  {
    "name": "Pytest (label: status:-easy)  The pytest framework makes it easy to write small tests, yet scales to support complex functional testing.",
    "url": "https://github.com/pytest-dev/pytest"
  },
  {
    "name": "Python Babel (label: difficulty/low)  The Python Internationalization Library.",
    "url": "https://github.com/python-babel/babel"
  },
  {
    "name": "pythonping (label: good first issue)  PythonPing is a simple library to execute ICMP pings natively in Python without resorting to spawning a shell.",
    "url": "https://github.com/alessandromaggio/pythonping"
  },
  {
    "name": "Pytorch (label: good-first-issue)  PyTorch is an open source machine learning library based on the Torch library, used for applications such as computer vision and natural language processing.",
    "url": "https://github.com/pytorch/pytorch"
  },
  {
    "name": "SaltStack (label: good-first-issue)  Software to automate the management and configuration of any infrastructure or application at scale.",
    "url": "https://github.com/saltstack/salt"
  },
  {
    "name": "scikit-learn (label: good-first-issue)  Scikit-learn is a machine learning library for Python.",
    "url": "https://github.com/scikit-learn/scikit-learn"
  },
  {
    "name": "scrapy (label: good-first-issue)  A fast high-level web crawling & scraping framework for Python.",
    "url": "https://github.com/scrapy/scrapy"
  },
  {
    "name": "Sorting-Algorithms-Visualizer (label: good-first-issue)  A tool for visualizing sorting algorithms with a educational Wiki Page.",
    "url": "https://github.com/LucasPilla/Sorting-Algorithms-Visualizer"
  },
  {
    "name": "SymPy (label: Easy-to-Fix)  A Python library for symbolic mathematics.",
    "url": "https://github.com/sympy/sympy"
  },
  {
    "name": "tree-sitter-legesher-python (label: Good-First-Issue)  Learn and code in Python using your native language.",
    "url": "https://github.com/legesher/tree-sitter-legesher-python"
  },
  {
    "name": "wemake-python-styleguide (label: level:starter)  The strictest and most opinionated python linter ever!",
    "url": "https://github.com/wemake-services/wemake-python-styleguide"
  },
  {
    "name": "Zulip (label: good-first-issue)  Powerful open source group chat.",
    "url": "https://github.com/zulip/zulip"
  },
  {
    "name": "bolt (label: Beginner-Friendly)  Bolt is a Ruby command-line tool for executing commands, scripts, and tasks on remote systems using SSH and WinRM.",
    "url": "https://github.com/puppetlabs/bolt"
  },
  {
    "name": "chatwoot (label: good-first-issue)  Opensource customer support platform which can be an alternative to Intercom, Zendesk, Drift, Crisp etc.",
    "url": "https://github.com/chatwoot/chatwoot"
  },
  {
    "name": "chef (label: Type:-Jump-In)  A systems integration framework, built to bring the benefits of configuration management to your entire infrastructure",
    "url": "https://github.com/chef/chef"
  },
  {
    "name": "Discourse (label: n/a)  Civilized discussion platform. See \"How to contribute to Discourse\".",
    "url": "https://meta.discourse.org/tags/starter-task"
  },
  {
    "name": "Faker (label: good-first-issue)  Faker is a Ruby library for generating fake data such as names, addresses, and phone numbers.",
    "url": "https://github.com/faker-ruby/faker"
  },
  {
    "name": "Goby (label: n/a)  Framework for developing text-RPGs.",
    "url": "https://github.com/nskins/goby"
  },
  {
    "name": "Hanami (label: easy)  A modern framework for Ruby.",
    "url": "https://github.com/hanami/hanami"
  },
  {
    "name": "JRuby (label: beginner)  An implementation of Ruby on the Java Virtual Machine.",
    "url": "https://github.com/jruby/jruby"
  },
  {
    "name": "mapknitter (label: first-timers-only)  Upload your own aerial images, position (rubbersheet) them in a web interface over existing map data, and share via web or composite and export for print.",
    "url": "https://github.com/publiclab/mapknitter"
  },
  {
    "name": "Matestack (label: good-first-issue)  Write dynamic User Interfaces in pure Ruby. Rails engine built on top of Vue.js",
    "url": "https://github.com/matestack/matestack-ui-core"
  },
  {
    "name": "ohai (label: Type:-Jump-In)  Ohai profiles your system and emits JSON",
    "url": "https://github.com/chef/ohai"
  },
  {
    "name": "open-build-service (label: good-first-issue-🥇)  A generic system to build and distribute packages from sources in an automatic, consistent and reproducible way.",
    "url": "https://github.com/openSUSE/open-build-service"
  },
  {
    "name": "osem (label: good-first-issue)  Open Source Event Manager. An event management tool tailored to Free and Open Source Software conferences",
    "url": "https://github.com/openSUSE/osem"
  },
  {
    "name": "PublicLab.org (label: first-timers-only)  An open source publishing platform for environmental projects. Check out new contributors welcome page.",
    "url": "https://github.com/publiclab/plots2"
  },
  {
    "name": "Ruby on Rails (label: good-first-issue)  Ruby on Rails (Rails) is an open source web application framework written in Ruby.",
    "url": "https://github.com/rails/rails"
  },
  {
    "name": "Sinatra (label: good-first-issue)  Classy web-development dressed in a DSL.",
    "url": "https://github.com/sinatra/sinatra"
  },
  {
    "name": "a-b-street (label: good first issue)  Transportation planning and traffic simulation software for creating cities friendlier to walking, biking, and public transit.",
    "url": "https://github.com/a-b-street/abstreet"
  },
  {
    "name": "dotenv-linter (label: good-first-issue)  Lightning-fast linter for .env files. Written in Rust",
    "url": "https://github.com/dotenv-linter/dotenv-linter"
  },
  {
    "name": "Hyper (label: E-easy)  A fast, safe and correct low-level HTTP library for Rust.",
    "url": "https://github.com/hyperium/hyper"
  },
  {
    "name": "Iron (label: easy)  An extensible, concurrent web framework for Rust",
    "url": "https://github.com/iron/iron"
  },
  {
    "name": "nushell (label: good-first-issue)  A modern shell for the GitHub era written in Rust.",
    "url": "https://github.com/nushell/nushell"
  },
  {
    "name": "Ockam (label: good first issue)  End-to-end encryption and mutual authentication for distributed applications.",
    "url": "https://github.com/ockam-network/ockam"
  },
  {
    "name": "Rust-Clippy (label: good-first-issue)  A bunch of lints to catch common mistakes and improve Rust code",
    "url": "https://github.com/rust-lang/rust-clippy"
  },
  {
    "name": "Rustfmt (label: good-first-issue)  A tool for formatting Rust code according to style guidelines.",
    "url": "https://github.com/rust-lang-nursery/rustfmt"
  },
  {
    "name": "Servo (label: E-easy)  A browser engine designed for applications including embedded use.",
    "url": "https://github.com/servo/servo"
  },
  {
    "name": "TiKV (label: difficulty/easy)  A distributed transactional key-value database",
    "url": "https://github.com/tikv/tikv"
  },
  {
    "name": "Veloren (label: n/a)  Veloren is a multiplayer voxel RPG written in Rust.",
    "url": "https://gitlab.com/veloren/veloren/-/issues?label_name%5B%5D=beginner"
  },
  {
    "name": "playframework (label: good-first-issue)  The High Velocity Web Framework",
    "url": "https://github.com/playframework/playframework"
  },
  {
    "name": "Twitter Util (label: good-first-issue)  Wonderful reusable code from Twitter",
    "url": "https://github.com/twitter/util"
  },
  {
    "name": "Pharo (label: good-first-issue)  A dynamic reflective pure object-oriented language supporting live programming inspired by Smalltalk.",
    "url": "https://github.com/pharo-project/pharo"
  },
  {
    "name": "OpenFoodFacts-iOS (label: help-wanted)  Collaborative, free and open database of food products from around the world. Scan barcode to get info or add a product",
    "url": "https://github.com/openfoodfacts/openfoodfacts-ios"
  },
  {
    "name": "Amplication (label: good first issue)  Amplication is an open-source development tool. It helps you develop quality Node.js applications without spending time on repetitive coding tasks.",
    "url": "https://github.com/amplication/amplication"
  },
  {
    "name": "Booster (label: good-first-issue)  A truly serverless framework, write your code and deploy it in seconds without any server configuration files.",
    "url": "https://github.com/boostercloud/booster"
  },
  {
    "name": "game-of-life (label: good-first-issue)  Conway's Game of Life web version!",
    "url": "https://github.com/TroyTae/game-of-life"
  },
  {
    "name": "Graphback (label: good-first-issue)  A CLI and runtime framework to generate a GraphQL API in seconds.",
    "url": "https://github.com/aerogear/graphback"
  },
  {
    "name": "jupyterlab-lsp (label: good-first-issue)  Coding assistance for JupyterLab (code navigation + hover suggestions + linters + autocompletion + rename)",
    "url": "https://github.com/krassowski/jupyterlab-lsp"
  },
  {
    "name": "LitmusChaos (label: good-first-issue)  Litmus is a toolset to do cloud-native chaos engineering.",
    "url": "https://github.com/litmuschaos/litmus"
  },
  {
    "name": "reatom (label: good-first-issue)  Reatom is declarative and reactive state manager, designed for both simple and complex applications.",
    "url": "https://github.com/artalar/reatom"
  },
  {
    "name": "tinyhttp (label: good-first-issue)  A 0-legacy, tiny & fast web framework as a replacement of Express.",
    "url": "https://github.com/talentlessguy/tinyhttp"
  },
  {
    "name": "TypeScript (label: good-first-issue)  A superset of JavaScript that compiles to clean JavaScript output.",
    "url": "https://github.com/Microsoft/TypeScript"
  },
  {
    "name": "typescript-eslint (label: good first issue)  Monorepo for all the tooling which enables ESLint to support TypeScript.",
    "url": "https://github.com/typescript-eslint/typescript-eslint"
  },
  {
    "name": "Visual Studio Code (label: good-first-issue)  A new type of tool that combines the simplicity of a code editor with what developers need for their core edit-build-debug cycle.",
    "url": "https://github.com/Microsoft/vscode"
  },
  {
    "name": "H2O Wave (label: good first issue)  Realtime Web Apps and Dashboards framework for Python and R. Suited (not only) for AI audience.",
    "url": "https://github.com/h2oai/wave"
  },
  {
    "name": "Node Efficientnet (label: good first issue)  EfficientNet Image Recognition model for Node JS ( written with tensorflow.js ).",
    "url": "https://github.com/ntedgi/node-efficientnet"
  },
  {
    "name": "OpenMetadata (label: good first issue)  OpenMetadata is an all-in-one platform for data discovery, data quality, observability, governance, data lineage, and team collaboration.",
    "url": "https://github.com/open-metadata/OpenMetadata"
  }
]
