[
  {
    "name": "Ecocina Rocket Stoves",
    "url": "http://www.stoveteam.org/",
    "description": "Wood fired cook stove that uses ~40-50% less fuel than traditional fires and emits ~1/3 the CO2. Learn how to build one!  Check out their research center at Aprovecho."
  },
  {
    "name": "Go Sun",
    "url": "https://www.gosun.co/",
    "description": "An innovative portable ultra-efficient solar cooker that can be used for backpacking, boating, car camping, etc."
  },
  {
    "name": "Insulated Cooking",
    "url": "https://www.milkwood.net/2015/07/06/thermal-cooking/",
    "description": "Discover a great way not only to use less energy in food preparation, but to serve tastier and more nutritious meals at the same time.  Any recipe that calls for boiling, simmering, steaming, or roasting will often taste better— hot from the haybox — than it would with regular stove preparation ... and you'll save heat energy at the same time.  You can pick up a pot-sized thermal cooker, or simply put a blanket in a cooler."
  },
  {
    "name": "Preserve Extra Food With A Solar Dehydrator",
    "url": "https://www.motherearthnews.com/diy/tools/solar-food-dehydrator-plans-zm0z14jjzmar",
    "description": "A solar food dehydrator is a device that removes moisture from food to aid in its preservation. You can buy a simple one or make your own.  Food drying is a method of preserving fruit, vegetables, and animal proteins that has been practiced since antiquity."
  },
  {
    "name": "Sun Oven",
    "url": "https://www.sunoven.com",
    "description": "Insulated solar oven that can cook food just like a regular oven."
  },
  {
    "name": "Able & Cole",
    "url": "https://www.abelandcole.co.uk/",
    "description": "Get fruit, veg, pantry staples, and other organic food delivered in returnable, reusable, recyclable packaging. Seasonal boxes of veg so its not traveling around the world, sustainably sourced fish, they've even got beer."
  },
  {
    "name": "Agricool",
    "url": "https://www.agricool.co/fr",
    "description": "Local, healthy, sustainable food - Des fruits et légumes, cultivés au coeur des villes, à moins de 15km de leur lieu de consommation. Frais, locaux, sans pesticides."
  },
  {
    "name": "NotCo",
    "url": "https://notco.com",
    "description": "The Not Company is a Foodtech, that reinvents animal-based foods using only plants. Unlike traditional food businesses, the company uses technology to recreate the same products we love to eat in a natural, sustainable and affordable way, keeping it functional, easy to use and mouthwateringly delicious. They use Artificial Intelligence to build a library of thousands of Plants and find how to use them, to recreate the same taste, smell, function, look and feel of the products we love. ALL PLANT-BASED."
  },
  {
    "name": "All Plants",
    "url": "https://allplants.com/",
    "description": "Vegan Prepared Meals - Get super tasty and 100% plant-based meals cooked by chefs and delivered straight to your door. Two people getting six meals works out at £5 a meal, which is amazing. Use this referral link to get £10 off your first box. We'll get £10 off our next box, so we'll spend that saving on trees on Offset Earth. 🥳"
  },
  {
    "name": "Bees Wrap",
    "url": "https://www.beeswrap.com/",
    "description": "Stop using cling film and start using reusable recyclable wraps made from bees wax and organic jojoba oil."
  },
  {
    "name": "Boulder Food Rescue",
    "url": "https://www.boulderfoodrescue.org/",
    "description": "We facilitate the sustainable redistribution of healthy food that would otherwise be wasted to low-income communities, by bicycle. We work with communities to facilitate their own food redistribution and create decentralized systems to bypass barriers to food access. Our work envisions a world in which everyone has equitable access to healthy food."
  },
  {
    "name": "City Harvest",
    "url": "https://www.cityharvest.org/",
    "description": "City Harvest is New York City’s largest food rescue organization. They rescue food and deliver it to hundreds of food pantries, soup kitchens and other community partners."
  },
  {
    "name": "EIT Food",
    "url": "https://www.eitfood.eu/",
    "description": "EIT Food is Europe’s leading food innovation initiative, working to make the food system more sustainable, healthy and trusted by consumers."
  },
  {
    "name": "Farm Drop",
    "url": "https://www.farmdrop.com/",
    "description": "Next day delivery in London for groceries and household products from local and independent producers."
  },
  {
    "name": "Food Cloud",
    "url": "https://food.cloud/",
    "description": "FoodCloud is a social enterprise that connects businesses with surplus food to charities in their local communities that need it via a software platform."
  },
  {
    "name": "Foodsharing.de",
    "url": "https://foodsharing.de/",
    "description": "If you are located in Germany, join your local food rescuing group on foodsharing.de."
  },
  {
    "name": "Forkful",
    "url": "https://www.forkful.app/",
    "description": "Sustainable, nutritious eating that is as good for you as it is for the planet. With our powerful recipe search, you can view the nutritional benefit and environmental impact of thousands of recipes at a glance, empowering you to make awesome decisions."
  },
  {
    "name": "Geev",
    "url": "https://corporate.geev.com/",
    "description": "An online application to exchange stuffs and food between people. Easily discuss, meet and give a second life to objects and food.  The more you give the more people trust you when you want to get something."
  },
  {
    "name": "Giki",
    "url": "https://gikibadges.com/",
    "description": "The Giki app provides accessible, independent, transparent information to help people change habits to live more sustainably. Our 14 badges cover sustainability, health and fairness."
  },
  {
    "name": "Green Ease",
    "url": "http://www.greenease.co/",
    "description": "Greenease Business lets chefs update and track their farms, push out specials on the app and search for farm-fresh products. Farms/purveyors interested in bringing fresh, local food to all can can login to verify who’s buying from them and list their products for search by chefs and restaurants."
  },
  {
    "name": "Grocy",
    "url": "https://grocy.info/",
    "description": "Grocy is a web-based self-hosted groceries and household management solution for your home.  Scan barcodes, track your purchases, automate and optimize your shopping list, waste less by keeping track of what's expiring next, plan meals, and more."
  },
  {
    "name": "GrowNYC Food Scrap Collection Schedule",
    "url": "https://www.grownyc.org/compost/locations",
    "description": "Interactive map with over 150 residential Food Scrap Drop-Off sites in NYC."
  },
  {
    "name": "Happy Cow",
    "url": "https://www.happycow.net",
    "description": "Reduce or avoid meat entirely by finding great vegetarian or vegan food all over the world."
  },
  {
    "name": "Impossible Foods",
    "url": "https://impossiblefoods.com/",
    "description": "We’re making meat from plants so that we never have to use animals again.  Just one Impossible Burger (instead of a burger made from cows) will use 96% less land, 87% less water, and 89% fewer GHG emissions."
  },
  {
    "name": "Karma",
    "url": "https://karma.life/",
    "description": "Rescue unsold meals, delivered, always 50% off in hundreds of cities across Sweden, United Kingdom, and France."
  },
  {
    "name": "Karma",
    "url": "https://new.karma.life/",
    "description": "A Swedish company that lets restaurants sell surplus food at a lower price. It lets you pay less for food and prevent food waste."
  },
  {
    "name": "Karrot",
    "url": "https://karrot.world/",
    "description": "Join or start a group in your home town that rescues food. Karrot is a free and open-source tool for grassroots initiatives and groups of people that want to coordinate face-to-face activities on a local, autonomous and voluntary basis."
  },
  {
    "name": "Kitche",
    "url": "https://kitche.co/",
    "description": "Kitche works to reduce waste from inside users’ kitchens and makes it easier than ever before to manage food at home, saving money and reducing food waste all within one app. Scan receipts and stop wasting money!"
  },
  {
    "name": "Makkelijke Moestuin (Easy Vegetable Garden)",
    "url": "https://www.makkelijkemoestuin.nl/",
    "description": "We make the vegetable garden easy. Thanks to our stuff and app, you can immediately garden like a pro.  Setting up your vegetable garden perfectly is 80% of the work. Our stuff is specially made for that. With the other 20% - maintenance - our app helps you completely.  You harvest 5 times as much per m² as from an ordinary vegetable garden. Ka-ching!"
  },
  {
    "name": "Milk Run",
    "url": "https://localmilkrun.com",
    "description": "Shop for and subscribe to deliveries from our hub of local farmers, butchers, bakers, and makers in Portland, Oregon."
  },
  {
    "name": "No Food Wasted",
    "url": "http://www.nofoodwasted.com/",
    "description": "NoFoodWasted maps products that reach the best before date and shows where and how much you can save. Download the app, select a provider near you and start saving today."
  },
  {
    "name": "No Meat Today",
    "url": "https://nomeat.today/",
    "description": "Your companion to eat less meat. It's good for you and the planet, but let's be honest, eating less meat is hard. Don't do it alone!"
  },
  {
    "name": "No Waste",
    "url": "https://www.nowasteapp.com/",
    "description": "With lists for your freezer, fridge and pantry, you can easily check what food you have left, see what food you need to use first, plan your meals, create a shopping list, avoid unnecessary purchases, reduce food waste and save a bunch of money."
  },
  {
    "name": "Olio",
    "url": "https://olioex.com/",
    "description": "We connect neighbors to share food, and other things, rather than chuck them away."
  },
  {
    "name": "Pieter Pot",
    "url": "https://www.pieter-pot.nl/",
    "description": "Your groceries, delivered without packaging. Pieter Pot delivers your groceries with a cargo bike in beautiful glass jars in The Netherlands. Empty pot? Then we fill it again. This is how we make it fun and easy to do shopping without all those unnecessary (plastic) packaging. That's nice, right?"
  },
  {
    "name": "Rethink Food NYC",
    "url": "https://www.rethinkfood.nyc/",
    "description": "They pick up unused, excess food from restaurants, farms, and other food purveyors, and re-purpose it into delicious and nutritious meals for under-served New Yorkers."
  },
  {
    "name": "Seafood Watch",
    "url": "https://www.seafoodwatch.org/",
    "description": "Seafood Watch recommends seafood that is fished or farmed in ways that promote healthy oceans. They recommend best options, good alternatives, and things to avoid."
  },
  {
    "name": "The Rotten Fruit Box",
    "url": "https://therottenfruitbox.com/",
    "description": "100% Natural Freeze-Dried Fruit Snacks from Spain and Portugal shipped to you. The fruit you’re enjoying would have otherwise gone unused and rotted away on the ground. We also think that the name \"Rotten\" helps bring attention to the serious issue of food waste. Delicious, healthy, 100% natural, with a long shelf life, our freeze dried fruit snack pouches are ideal for home, work, office, to take to school, camping or just about anywhere. Help reduce food waste. Help small local farmers. 100% compostable packaging, ships with your local postal service because it is the lowest carbon footprint option."
  },
  {
    "name": "Tight5 farm",
    "url": "https://tight5.farm",
    "description": "Delivered by cargo bicycle, our microgreens, sprouts, and culinary herbs are grown sustainably at production scale in an ultra-minimalist hydroponic vertical farming unit"
  },
  {
    "name": "Too Good To Go",
    "url": "https://toogoodtogo.co.uk/",
    "description": "Sell your surplus food, easily and sustainably! Save delicious food and fight food waste. Find your favorite food and go rescue it."
  },
  {
    "name": "We Are Phenix",
    "url": "https://wearephenix.com/en/",
    "description": "Buy unsold goods from local businesses at a reduced price.  Sell expired products to clients, donate to charities, reuse organic waste for animal food, and more.  With over 100k meals saved per day, we are well on our way to reach the objective of zero food waste."
  },
  {
    "name": "The Felix Project",
    "url": "https://thefelixproject.org/",
    "description": "London-based charity that collects fresh, nutritious food that cannot be sold. Deliver this surplus food to charities and schools so they can provide healthy meals and help the most vulnerable in our society. Reducing food waste and poverty."
  },
  {
    "name": "OddBox",
    "url": "https://www.oddbox.co.uk",
    "description": "English Certified B Corp that is reducing food waste. Collects food rejected by Supermarkets, directly from farms and delivers to your door. £10 off your first box with this link (https://mention-me.com/m/ol/qd4ho-0d5026f88d). I will plant trees through Ecologi with the £10 I get for this."
  },
  {
    "name": "Creating a Land Trust",
    "url": "https://conservationtools.org/guides/150-what-is-a-land-trust",
    "description": "A land trust is a charitable organization that acquires land or conservation easements, or that stewards land or easements, for conservation purposes. Land owners may consider designating portions of their land as a land trust, in order to preserve natural features in perpetuity, and be eligible for tax benefits as a result."
  },
  {
    "name": "Dronecoria",
    "url": "http://dronecoria.org/",
    "description": "Open-source drone reforestation technology. Drones, coupled with native coated seeds, can transform the efficiency with which we restore ecosystems."
  },
  {
    "name": "Droneseed",
    "url": "https://www.droneseed.co/",
    "description": "They plant native trees & vegetation using drone swarms and spray to protect them. Provide valuable insights to customers by collecting data in the field. Work with governments, nonprofits, and private land owners as a service provider."
  },
  {
    "name": "Farm Bot",
    "url": "https://farm.bot/",
    "description": "Farm Bot is a fully automated, open-source, crowd-funded project, which helps you grow food for yourself, your family, and your community. Install FarmBot on a raised bed, urban rooftop, or in a small greenhouse at home. Hyper-local food production has never been easier."
  },
  {
    "name": "Natural Resources Conservation Service (NRCS)",
    "url": "https://www.nrcs.usda.gov/",
    "description": "NRCS will pay you to steward your land, in ways you define. It offers voluntary programs to eligible landowners and agricultural producers to provide financial and technical assistance to help manage natural resources in a sustainable manner. Programs include emergency watershed protection and flood prevention, watershed rehabilitation, surveys and planning, healthy forest reserve easements, agricultural conservation easements, conservation stewardship, and environmental quality incentives."
  },
  {
    "name": "Permaculture Earthworks Handbook",
    "url": "https://permacultureearthworks.com/",
    "description": "A detailed guide to the proper design and construction of water harvesting earthworks. It covers the function, design, and construction methods for nine main types of water harvesting earthworks across a full range of climates. Free alternatives are an online course by Permaculture Women, and a four-part documentary by Geoff Lawton."
  },
  {
    "name": "Woodland Trust",
    "url": "https://www.woodlandtrust.org.uk/",
    "description": "The Woodland Trust is reforesting the United Kingdom, working with communities, local authorities, and land owners, to get trees in the ground."
  },
  {
    "name": "Ecotalk",
    "url": "https://www.ecotalk.co.uk",
    "description": "UK-based mobile network powered by renewable energy. Profits are used to buy land which is then given back to nature."
  },
  {
    "name": "Democracy Now!",
    "url": "https://www.democracynow.org/topics/climate_change",
    "description": "Independent global news produced daily, hosted by award-winning journalists Amy Goodman and Juan González. Our reporting includes breaking daily news headlines and in-depth interviews with people on the front lines of the world’s most pressing issues by a diversity of voices.  Free from government funding, corporate sponsorship, underwriting or advertising revenue."
  },
  {
    "name": "How to Save a Planet",
    "url": "https://gimletmedia.com/shows/howtosaveaplanet",
    "description": "weekly-ish podcast by Gimlet Media that asks the big questions: what do we need to do to solve the climate crisis, and how do we get it done? Journalist Alex Blumberg and scientist and policy nerd Dr. Ayana Elizabeth Johnson talk to people who are making a difference and work to figure out how to build the future we want, tackling a different subject related to the climate crisis each episode."
  },
  {
    "name": "People Fixing the World",
    "url": "https://www.bbc.co.uk/programmes/p04grdbc",
    "description": "BBC World Service - Brilliant solutions to the world’s problems. We meet people with ideas to make the world a better place and investigate whether they work."
  },
  {
    "name": "Sustainababble",
    "url": "http://www.sustainababble.fish/",
    "description": "A weekly podcast about the environment, for and by the confused. Your hosts Ol and Dave are supposed to be experts in how to save the planet. But why’s everything got to be so confusing? Each week they try to get a little bit closer to enlightenment. They may fail. They sift through the most egregious eco-guff out there, exposing the real eco-villians vs the hapless incompetents."
  },
  {
    "name": "TIL Climate Podcast",
    "url": "https://climate.mit.edu/users/tilclimate-podcast",
    "description": "This MIT podcast breaks down the science, technologies, and policies behind climate change, how it’s impacting us, and what we can do about it. Each quick episode gives you the what, why, and how on climate change -- from real scientists -- to help us make informed decisions for our future."
  },
  {
    "name": "Talking Headways: A Book Club for the Future of Transportation",
    "url": "https://streetsblog.libsyn.com/",
    "description": "We explore the intersection of sustainable transportation, urban planning, city living, economic development, and anything else that piques our interest. A staple and almost an obligatory source of information on the latest trends in urban mobility and urban planning."
  },
  {
    "name": "The Climate Fix",
    "url": "https://theclimatefix.com/",
    "description": "We shine a spotlight on people and organisations working on sustainable solutions, help connect them to talent & investment as well as give people hope that there are climate solutions as well as climate problems."
  },
  {
    "name": "The Energy Transition Show",
    "url": "https://xenetwork.org/ets/",
    "description": "Straight talk about the world’s transition from fossil fuels to renewables with energy expert Chris Nelder."
  },
  {
    "name": "The Yikes Podcast",
    "url": "https://radiopublic.com/the-yikes-podcast-6nKDQq",
    "description": "Climate Change, Human Rights and the messiness of everything going on at the moment can be really overwhelming BUT we want to provide a space to chat about these things and find hope in the midst of it all."
  },
  {
    "name": "You've Been Warmed",
    "url": "https://www.youvebeenwarmed.com/",
    "description": "By interviewing the top scientists, entrepreneurs, activists & politicians, we seek to find answers to all of the above while uncovering the leaders behind our fight for the preservation of our planet."
  },
  {
    "name": "Green Pulse",
    "url": "https://omny.fm/shows/green-pulse-1",
    "description": "The Straits Times (A Singapore news outlet) analyses the beat of the changing environment, from biodiversity conservation to climate change."
  },
  {
    "name": "Big Clean Switch",
    "url": "https://bigcleanswitch.org/",
    "description": "Do energy differently. Switch in minutes to a green electricity tariff from one of the UK's leading suppliers."
  },
  {
    "name": "Community Power",
    "url": "https://communitypower.ie/",
    "description": "Ireland's first community owned electricity supplier which collaborates with Local Sustainable Energy Communities! Whether you are a household, community, business, public or private building, you can switch and buy your electricity from Community Power."
  },
  {
    "name": "Domestic Renewable Heat Incentive (RHI)",
    "url": "https://www.gov.uk/domestic-renewable-heat-incentive",
    "description": "You could get money towards renewable heating costs in your home. You can claim for biomass boilers, solar water heating, heat pumps. Payments are made for 7 years and are based on the amount of renewable heat made by your heating system."
  },
  {
    "name": "Ecotricity",
    "url": "https://www.ecotricity.co.uk/",
    "description": "100% green electricity. They generate 1/5th from their fleet of windmills and sunmills, and buy the rest from other green generators. They also turn our customers’ bills into new sources of green energy, making more green electricity all the time."
  },
  {
    "name": "Electricity Map",
    "url": "https://www.electricitymap.org/",
    "description": "A map showing the energy consumption, renewable penetration and carbon emissions from energy for many countries around the world. If you're country isn't covered you can contribute a data source."
  },
  {
    "name": "Good Energy",
    "url": "https://www.goodenergy.co.uk/",
    "description": "One of the few energy suppliers in the UK to generate renewable power from their own wind and solar farms, and buy renewable power from small independent renewable generators. From local farmers and community energy schemes to sustainable businesses that generate their own power and sell them the excess. A true renewable supplier, not just coal power + offset credits."
  },
  {
    "name": "Green-E",
    "url": "https://www.green-e.org/",
    "description": "Find a renewable energy provider near you. Green-e certified renewable energy and carbon offset products meet the most stringent environmental and consumer protection standards in North America. You can search below for certified green power and renewable energy certificate programs for your home or business, and carbon offset products to offset your emissions from activities like driving and flying. As a third-party certifier, Green-e® doesn't sell renewable energy or offsets, but offers these links to retailers that do."
  },
  {
    "name": "Non-domestic Renewable Heat Incentive (RHI)",
    "url": "https://www.gov.uk/non-domestic-renewable-heat-incentive",
    "description": "The non-domestic Renewable Heat Incentive helps businesses, public sector and non-profit organisations meet the cost of installing renewable heat technologies."
  },
  {
    "name": "Project Sunroof",
    "url": "https://www.google.com/get/sunroof",
    "description": "Find out if you could save money switching to solar panels. This Google project uses Google Earth imagery to analyze your roof shape and local weather patterns to create a personalized solar plan. Adjust your electric bill to fine-tune your savings estimate and the recommended number of solar panels for your home, then compare loan, lease, and purchase options for your solar panels based on your results."
  },
  {
    "name": "SparkMeter",
    "url": "http://www.sparkmeter.io/",
    "description": "Humanitarian smart energy metering solution that purchases wasted unused electricity from utilities and resells it to hard-to-reach places and under served markets, thus reducing overall energy consumption."
  },
  {
    "name": "UK Carbon Intensity",
    "url": "https://carbonintensity.org.uk/",
    "description": "This officially backed open API from Oxford University and the National Grid ESO gives a snapshot of how much carbon each unit of electricity consumed in the UK emits for every half hour. Also carries forecasts, regional breakdowns with some great charts and re-useable widgets. They also have an app."
  },
  {
    "name": "Climate Town",
    "url": "https://www.youtube.com/channel/UCuVLG9pThvBABcYCm7pkNkA",
    "description": "Rollie Williams and a ragtag team of climate communicators, creatives and comedians are here to examine climate change in a way that doesn’t make you want to eat a cyanide pill."
  },
  {
    "name": "ClimateAdam",
    "url": "https://www.youtube.com/user/ClimateAdam",
    "description": "Doctor in climate science from Oxford. Trying to make sense of climate change with fun YouTube vids."
  },
  {
    "name": "Hot Mess",
    "url": "https://www.youtube.com/channel/UCsaEBhRsI6tmmz12fkSEYdw",
    "description": "A show about how climate change impacts all of us, and about how we can create a better future for our planet and ourselves. Hosted by Miriam Nielsen, Talia Buford, and Joe Hanson."
  },
  {
    "name": "Our Changing Climate",
    "url": "https://www.youtube.com/channel/UCNXvxXpDJXp-mZu3pFMzYHQ",
    "description": "A bi-weekly video essay series that investigates humanity's relationship to the natural world."
  },
  {
    "name": "Simon Clark",
    "url": "https://www.youtube.com/user/SimonOxfPhys",
    "description": "PhD in climate physics by day, YouTuber by night. He makes videos about both!"
  },
  {
    "name": "Berkley Water Filters",
    "url": "https://www.berkeyfilters.com/",
    "description": "21,000,000 Americans drink water that violates U.S. health standards. Berkey water filter systems are actually water purifiers because they remove bacteria and viruses that conventional filters cannot."
  },
  {
    "name": "Kent Zero Water Wastage Technology",
    "url": "https://www.kent.co.in/water-purifiers/zero-water-wastage-technology",
    "description": "KENT RO Purifiers equipped with the ‘Zero Water Wastage’ Technology push back the rejected water to the overhead tank, thereby rendering wastage to zero. As a result, instead of wasting the rejected water, it gets diluted and reused as normal tap water for household purposes."
  }
]
