[
  {
    "name": "Ecocina Rocket Stoves",
    "url": "http://www.stoveteam.org/",
    "description": "Wood fired cook stove that uses ~40-50% less fuel than traditional fires and emits ~1/3 the CO2. Learn how to build one!  Check out their research center at Aprovecho."
  },
  {
    "name": "Go Sun",
    "url": "https://www.gosun.co/",
    "description": "An innovative portable ultra-efficient solar cooker that can be used for backpacking, boating, car camping, etc."
  },
  {
    "name": "Insulated Cooking",
    "url": "https://www.milkwood.net/2015/07/06/thermal-cooking/",
    "description": "Discover a great way not only to use less energy in food preparation, but to serve tastier and more nutritious meals at the same time.  Any recipe that calls for boiling, simmering, steaming, or roasting will often taste better— hot from the haybox — than it would with regular stove preparation ... and you'll save heat energy at the same time.  You can pick up a pot-sized thermal cooker, or simply put a blanket in a cooler."
  },
  {
    "name": "Preserve extra food with a solar dehydrator",
    "url": "https://www.motherearthnews.com/diy/tools/solar-food-dehydrator-plans-zm0z14jjzmar",
    "description": "A solar food dehydrator is a device that removes moisture from food to aid in its preservation. You can buy a simple one or make your own.  Food drying is a method of preserving fruit, vegetables, and animal proteins that has been practiced since antiquity."
  },
  {
    "name": "Seafood Watch",
    "url": "https://www.seafoodwatch.org/",
    "description": "Seafood Watch recommends seafood that is fished or farmed in ways that promote healthy oceans. They recommend best options, good alternatives, and things to avoid."
  },
  {
    "name": "Sun Oven",
    "url": "https://www.sunoven.com",
    "description": "Insulated solar oven that can cook food just like a regular oven."
  },
  {
    "name": "Creating a Land Trust",
    "url": "https://conservationtools.org/guides/150-what-is-a-land-trust",
    "description": "A land trust is a charitable organization that acquires land or conservation easements, or that stewards land or easements, for conservation purposes. Land owners may consider designating portions of their land as a land trust, in order to preserve natural features in perpetuity, and be eligible for tax benefits as a result."
  },
  {
    "name": "Dronecoria",
    "url": "http://dronecoria.org/",
    "description": "Open-source drone reforestation technology. Drones, coupled with native coated seeds, can transform the efficiency with which we restore ecosystems."
  },
  {
    "name": "Droneseed",
    "url": "https://www.droneseed.co/",
    "description": "They plant native trees & vegetation using drone swarms and spray to protect them. Provide valuable insights to customers by collecting data in the field. Work with Governments, nonprofits, and private land owners as a service provider."
  },
  {
    "name": "Farm Bot",
    "url": "https://farm.bot/",
    "description": "Farm Bot is a fully automated, open-source, crowd-funded project, which helps you grow food for yourself, your family, and your community. Install FarmBot on a raised bed, urban rooftop, or in a small greenhouse at home. Hyper-local food production has never been easier."
  },
  {
    "name": "Natural Resources Conservation Service (NRCS)",
    "url": "https://www.nrcs.usda.gov/",
    "description": "NRCS will pay you to steward your land, in ways you define. It offers voluntary programs to eligible landowners and agricultural producers to provide financial and technical assistance to help manage natural resources in a sustainable manner. Programs include emergency watershed protection and flood prevention, watershed rehabilitation, surveys and planning, healthy forest reserve easements, agricultural conservation easements, conservation stewardship, and environmental quality incentives."
  },
  {
    "name": "Permaculture Earthworks Handbook",
    "url": "https://permacultureearthworks.com/",
    "description": "A detailed guide to the proper design and construction of water harvesting earthworks. It covers the function, design, and construction methods for nine main types of water harvesting earthworks across a full range of climates. Free alternatives are an online course by Permaculture Women, and a four-part documentary by Geoff Lawton."
  },
  {
    "name": "Woodland Trust",
    "url": "https://www.woodlandtrust.org.uk/",
    "description": "The Woodland Trust is reforesting the United Kingdom, working with communities, local authorities, and land owners, to get trees in the ground."
  },
  {
    "name": "Arbor Day Foundation",
    "url": "https://www.arborday.org/",
    "description": "The Arbor Day Foundation is a 501(c)(3) nonprofit conservation and education organization. A million members, donors, and partners support our programs to make our world greener and healthier."
  },
  {
    "name": "Dronecoria",
    "url": "http://dronecoria.org/",
    "description": "Open-source drone reforestation technology. Drones, coupled with native coated seeds, can transform the efficiency with which we restore ecosystems."
  },
  {
    "name": "Droneseed",
    "url": "https://www.droneseed.co/",
    "description": "They plant native trees & vegetation using drone swarms and spray to protect them. Provide valuable insights to customers by collecting data in the field. Work with Governments, nonprofits, and private land owners as a service provider."
  },
  {
    "name": "EcoTree",
    "url": "https://ecotree.green/",
    "description": "Support the European forests and reap the benefits. Plant trees and compensate your CO2 footprint.  Offer trees as an original and meaningful gift. Building complex, resistant, and multifunctional forests to promote resilience. For every tree harvested, three new ones are planted."
  },
  {
    "name": "Eden Reforestation Projects",
    "url": "https://edenprojects.org/",
    "description": "Eden Reforestation Projects reduces extreme poverty and restores healthy forests by employing local villagers to plant millions of trees every year."
  },
  {
    "name": "Form Ghana",
    "url": "https://www.formghana.com/",
    "description": "A forest plantation management company based in central Ghana that provides services in the field of reforestation of degraded Forest Reserves and plantation management."
  },
  {
    "name": "Form International",
    "url": "https://www.forminternational.nl/",
    "description": "Form International is a forest management and services company that manages forest assets in Africa and delivers a range of technical and financial services to clients worldwide."
  },
  {
    "name": "Land Life Company",
    "url": "https://landlifecompany.com/",
    "description": "Their mission is to reforest the world’s 2 billion hectares of degraded land. Using drones and automated planting, they plant at scale in urban environments using a fraction of the water."
  },
  {
    "name": "MyClimate",
    "url": "https://myclimate.org/",
    "description": "Helping reduce emissions through a whole bunch of different projects, from consulting companies on their footprint (and helping them to reduce), to education at schools, forest restoration, providing people in Rwanda with efficient cook stoves, and a whole bunch more. Fund them via donations, and use their flight/car/house/company footprint calculators."
  },
  {
    "name": "Offset Earth",
    "url": "https://offset.earth/?r=5d01f2ed12ae7a358b75fdd7",
    "description": "Monthly subscriptions for you, your family, and your business, where money goes to Eden Reforestation Projects who plant trees and offset and reduce carbon emissions around the world in a myriad of ways."
  },
  {
    "name": "Team Trees",
    "url": "https://teamtrees.org/",
    "description": "TeamTrees started in May 2019 when the internet challenged Mr. Beast to plant 20 million trees to commemorate hitting the 20M subscriber milestone. Fans then suggested he band together with a bunch of other YouTubers and influencers to make it happen."
  },
  {
    "name": "Tree-Nation",
    "url": "https://tree-nation.com/projects",
    "description": "Buy trees for you or your company, and get them planted all over the world."
  },
  {
    "name": "Treedom",
    "url": "https://www.treedom.net/",
    "description": "Treedom lets you buy or gift a real tree, where somebody will plant it for you and follow it online."
  },
  {
    "name": "Trees for the Future",
    "url": "https://trees.org/",
    "description": "TREES plants all sorts of trees and plants, and nearly all of the trees used are either native or naturalized in the environments where they are planted. They partner with farmers to understand their needs and match them with species that will suit their needs and be environmentally benign."
  },
  {
    "name": "WeForest",
    "url": "https://www.weforest.org/",
    "description": "Building upon corporate and scientific partnerships, WeForest empowers communities to sustainably advance and implement innovative, high standard, scalable and lasting solutions to restore forest landscapes."
  },
  {
    "name": "Big Clean Switch",
    "url": "https://bigcleanswitch.org/",
    "description": "Do energy differently. Switch in minutes to a green electricity tariff from one of the UK's leading suppliers."
  },
  {
    "name": "Carbon Intensity API",
    "url": "https://carbonintensity.org.uk/",
    "description": "This officially backed open API from Oxford University and the National Grid ESO gives a snapshot of how much carbon each unit of electricity consumed in the UK emits for every half hour. Also carries forecasts, regional breakdowns with some great charts and re-useable widgets. They also have an APP!"
  },
  {
    "name": "Community Power",
    "url": "https://communitypower.ie/",
    "description": "Ireland's first community owned electricity supplier which collaborates with Local Sustainable Energy Communities! Whether you are a household, community, business, public or private building, you can switch and buy your electricity from Community Power."
  },
  {
    "name": "Domestic Renewable Heat Incentive (RHI)",
    "url": "https://www.gov.uk/domestic-renewable-heat-incentive",
    "description": "You could get money towards renewable heating costs in your home. You can claim for biomass boilers, solar water heating, heat pumps. Payments are made for 7 years and are based on the amount of renewable heat made by your heating system."
  },
  {
    "name": "Ecotricity",
    "url": "https://www.ecotricity.co.uk/",
    "description": "100% green electricity. They generate 1/5th from their fleet of windmills and sunmills, and buy the rest from other green generators. They also turn our customers’ bills into new sources of green energy, making more green electricity all the time."
  },
  {
    "name": "Electricity Map",
    "url": "https://www.electricitymap.org/",
    "description": "A map showing the energy consumption, renewable penetration and carbon emissions from energy for many countries around the world. If you're country isn't covered you can contribute a data source."
  },
  {
    "name": "Good Energy",
    "url": "https://www.goodenergy.co.uk/",
    "description": "One of the few energy suppliers in the UK to generate renewable power from their own wind and solar farms, and buy renewable power from small independent renewable generators. From local farmers and community energy schemes to sustainable businesses that generate their own power and sell them the excess. A true renewable supplier, not just coal power + offset credits."
  },
  {
    "name": "Green-E",
    "url": "https://www.green-e.org/",
    "description": "Find a renewable energy provider near you. Green-e certified renewable energy and carbon offset products meet the most stringent environmental and consumer protection standards in North America. You can search below for certified green power and renewable energy certificate programs for your home or business, and carbon offset products to offset your emissions from activities like driving and flying. As a third-party certifier, Green-e® doesn't sell renewable energy or offsets, but offers these links to retailers that do."
  },
  {
    "name": "Non-domestic Renewable Heat Incentive (RHI)",
    "url": "https://www.gov.uk/non-domestic-renewable-heat-incentive",
    "description": "The non-domestic Renewable Heat Incentive helps businesses, public sector and non-profit organisations meet the cost of installing renewable heat technologies."
  },
  {
    "name": "SparkMeter",
    "url": "http://www.sparkmeter.io/",
    "description": "Humanitarian smart energy metering solution that purchases wasted unused electricity from utilities and resells it to hard-to-reach places and under served markets, thus reducing overall energy consumption."
  }
]
