[
  {
    "name": "",
    "url": "https://camo.githubusercontent.com/41fd765c5e790461111087135fba87a5b80d8a90/68747470733a2f2f6173736574732d63646e2e6769746875622e636f6d2f696d616765732f69636f6e732f656d6f6a692f756e69636f64652f31663466392e706e67",
    "description": "Lecture Videos"
  },
  {
    "name": "",
    "url": "https://camo.githubusercontent.com/d9a27663e9638d286a07942ee48d0db4f13028e8/68747470733a2f2f6173736574732d63646e2e6769746875622e636f6d2f696d616765732f69636f6e732f656d6f6a692f756e69636f64652f31663464642e706e67",
    "description": "Lecture Notes"
  },
  {
    "name": "",
    "url": "https://camo.githubusercontent.com/d14cad692e3b868f3ad0a656b13aad9cd1bbecc2/68747470733a2f2f6173736574732d63646e2e6769746875622e636f6d2f696d616765732f69636f6e732f656d6f6a692f756e69636f64652f31663462622e706e67",
    "description": "Assignments / Labs"
  },
  {
    "name": "",
    "url": "https://camo.githubusercontent.com/66c536acd93c38b5ad59675b706a70e0535f9eb1/68747470733a2f2f6173736574732d63646e2e6769746875622e636f6d2f696d616765732f69636f6e732f656d6f6a692f756e69636f64652f31663464612e706e67",
    "description": "Readings"
  },
  {
    "name": "CS 61C Great Ideas in Computer Architecture (Machine Structures) UC Berkeley   \n\nThe subjects covered in this course include: C and assembly language programming, translation of high-level programs into machine language, computer organization, caches, performance measurement, parallelism, CPU design, warehouse-scale computing, and related topics.\nLecture Videos\nLecture Notes\nResources\nOld Exams\n\n",
    "url": "http://www-inst.eecs.berkeley.edu/%7Ecs61c/sp15/"
  },
  {
    "name": "Lecture Videos",
    "url": "https://archive.org/details/ucberkeley-webcast-PL-XXv-cvA_iCl2-D-FS5mk0jFF6cYSJs_?sort=titleSorter"
  },
  {
    "name": "Lecture Notes",
    "url": "http://www-inst.eecs.berkeley.edu/%7Ecs61c/sp15/#Calendar"
  },
  {
    "name": "Resources",
    "url": "http://www-inst.eecs.berkeley.edu/%7Ecs61c/sp15/#Resources"
  },
  {
    "name": "Old Exams",
    "url": "https://hkn.eecs.berkeley.edu/exams/course/CS/61C"
  },
  {
    "name": "CS 107 Computer Organization & Systems Stanford University  \n\nCS107 is the third course in Stanford's introductory programming sequence. The course will work from the C programming language down to the microprocessor to de-mystify the machine. With a complete understanding of how computer systems execute programs and manipulate data, you will become a more effective programmer, especially in dealing with issues of debugging, performance, portability, and robustness.\nLecture Videos\nAssignments\n\n",
    "url": "https://courseware.stanford.edu/pg/courses/lectures/371747"
  },
  {
    "name": "Lecture Videos",
    "url": "https://www.youtube.com/playlist?list=PL08D9FA018A965057&spfreload=10"
  },
  {
    "name": "Assignments",
    "url": "http://web.stanford.edu/class/cs107/assignments.html"
  },
  {
    "name": "CS 140 Operating Systems Stanford University  \n\nThis class introduces the basic facilities provided in modern operating systems. The course divides into three major sections. The first part of the course discusses concurrency. The second part of the course addresses the problem of memory management. The third major part of the course concerns file systems.\nLecture Notes\nAssignments\n\n",
    "url": "http://web.stanford.edu/%7Eouster/cgi-bin/cs140-spring14/lectures.php"
  },
  {
    "name": "Lecture Notes",
    "url": "http://web.stanford.edu/%7Eouster/cgi-bin/cs140-spring14/lectures.php"
  },
  {
    "name": "Assignments",
    "url": "http://web.stanford.edu/%7Eouster/cgi-bin/cs140-spring14/projects.php"
  },
  {
    "name": "6.004 Computation Structures MIT   \n\nIntroduces architecture of digital systems, emphasizing structural principles common to a wide range of technologies. Multilevel implementation strategies; definition of new primitives (e.g., gates, instructions, procedures, processes) and their mechanization using lower-level elements. Analysis of potential concurrency; precedence constraints and performance measures; pipelined and multidimensional systems. Instruction set design issues; architectural support for contemporary software structures. 4 Engineering Design Points. 6.004 offers an introduction to the engineering of digital systems. Starting with MOS transistors, the course develops of series of building blocks logic gates, combinational and sequential circuits, finite-state machines, computers and finally complete systems. Both hardware and software mechanisms are explored through a series of design examples.\nYoutube Playlist\nLecture Notes\nLabs-Assignments\n\n",
    "url": "https://6004.mit.edu/"
  },
  {
    "name": "Youtube Playlist",
    "url": "https://www.youtube.com/watch?v=9DWlqtsNGV0&index=1&list=PLmP5iIyVnKPQ-cO_EENdUgEdlRf0u5LYa"
  },
  {
    "name": "Lecture Notes",
    "url": "http://computationstructures.org/notes/tradeoffs/notes.html"
  },
  {
    "name": "Labs-Assignments",
    "url": "http://computationstructures.org/exercises/cmos/lab.html"
  },
  {
    "name": "CS 162 Operating Systems and Systems Programming UC Berkeley    \n\nThe purpose of this course is to teach the design of operating systems and operating systems concepts that appear in other advanced systems. Topics we will cover include concepts of operating systems, systems programming, networked and distributed systems, and storage systems, including multiple-program systems (processes, interprocess communication, and synchronization), memory allocation (segmentation, paging), resource allocation and scheduling, file systems, basic networking (sockets, layering, APIs, reliability), transactions, security, and privacy.\n\nOperating Systems course by the Chair of EECS, UC Berkeley David Culler\nLecture Videos Spring 2015 lectures\nLecture Notes Spring 2015 lectures\n\n\n\n",
    "url": "http://cs162.eecs.berkeley.edu/"
  },
  {
    "name": "Operating Systems course by the Chair of EECS, UC Berkeley David Culler",
    "url": "http://www.cs.berkeley.edu/%7Eculler/"
  },
  {
    "name": "Lecture Videos Spring 2015 lectures",
    "url": "https://archive.org/details/ucberkeley-webcast-PL-XXv-cvA_iBDyz-ba4yDskqMDY6A1w_c"
  },
  {
    "name": "Lecture Notes Spring 2015 lectures",
    "url": "https://inst.eecs.berkeley.edu/%7Ecs162/sp15/"
  },
  {
    "name": "CS 168 Introduction to the Internet: Architecture and Protocols UC Berkeley  \n\nThis course is an introduction to the Internet architecture. We will focus on the concepts and fundamental design principles that have contributed to the Internet's scalability and robustness and survey the various protocols and algorithms used within this architecture. Topics include layering, addressing, intradomain routing, interdomain routing, reliable delivery, congestion control, and the core protocols (e.g., TCP, UDP, IP, DNS, and HTTP) and network technologies (e.g., Ethernet, wireless).\nLecture Notes & Assignments\nDiscussion Notes\n\n",
    "url": "https://inst.eecs.berkeley.edu/%7Ecs168/fa14/"
  },
  {
    "name": "Lecture Notes & Assignments",
    "url": "https://inst.eecs.berkeley.edu/%7Ecs168/fa14/class.html"
  },
  {
    "name": "Discussion Notes",
    "url": "https://inst.eecs.berkeley.edu/%7Ecs168/fa14/"
  },
  {
    "name": "CS 179 GPU Programming Caltech   \n\nThis course will cover programming techniques for the GPU. The course will introduce NVIDIA's parallel computing language, CUDA. Beyond covering the CUDA programming model and syntax, the course will also discuss GPU architecture, high performance computing on GPUs, parallel algorithms, CUDA libraries, and applications of GPU computing.\nAssignments\nLecture Notes\n\n",
    "url": "http://courses.cms.caltech.edu/cs179/"
  },
  {
    "name": "Assignments",
    "url": "http://courses.cms.caltech.edu/cs179/"
  },
  {
    "name": "Lecture Notes",
    "url": "http://courses.cms.caltech.edu/cs179/"
  },
  {
    "name": "CS 186 Introduction to Database Systems UC Berkeley    \n\nIn the project assignments in CS186, you will write a basic database management system called SimpleDB. For this project, you will focus on implementing the core modules required to access stored data on disk; in future projects, you will add support for various query processing operators, as well as transactions, locking, and concurrent queries.\nLecture Videos\nLecture Notes\nProjects\n\n",
    "url": "https://sites.google.com/site/cs186spring2015/"
  },
  {
    "name": "Lecture Videos",
    "url": "https://archive.org/details/ucberkeley-webcast-PL-XXv-cvA_iBVK2QzAV-R7NMA1ZkaiR2y"
  },
  {
    "name": "Lecture Notes",
    "url": "https://sites.google.com/site/cs186fall2013/section-notes"
  },
  {
    "name": "Projects",
    "url": "https://sites.google.com/site/cs186fall2013/homeworks"
  },
  {
    "name": "CS 241 Systems Programming (Spring 2016) Univ of Illinois, Urbana-Champaign  \n\nSystem programming refers to writing code that tasks advantage of operating system support for programmers. This course is designed to introduce you to system programming. By the end of this course, you should be proficient at writing programs that take full advantage of operating system support. To be concrete, we need to fix an operating system and we need to choose a programming language for writing programs. We chose the C language running on a Linux/UNIX operating system (which implements the POSIX standard interface between the programmer and the OS).\nAssignments\nLabs\nGithub Page\nCrowd Sourced Book\n\n",
    "url": "https://courses.engr.illinois.edu/cs241/sp2016/index.html"
  },
  {
    "name": "Assignments",
    "url": "https://courses.engr.illinois.edu/cs241/sp2016/mps.html"
  },
  {
    "name": "Labs",
    "url": "https://courses.engr.illinois.edu/cs241/sp2016/labs.html"
  },
  {
    "name": "Github Page",
    "url": "http://angrave.github.io/sys/#"
  },
  {
    "name": "Crowd Sourced Book",
    "url": "https://github.com/angrave/SystemProgramming/wiki"
  },
  {
    "name": "CS 425 Distributed Systems Univ of Illinois, Urbana-Champaign  \n\nBrilliant set of lectures and reading material covering fundamental concepts in distributed systems such as Vector clocks, Consensus and Paxos. This is the 2016 version by Prof Indranil Gupta.\nLectures\nAssignments\n\n",
    "url": "https://courses.engr.illinois.edu/cs425/fa2016/index.html"
  },
  {
    "name": "Lectures",
    "url": "https://courses.engr.illinois.edu/cs425/fa2016/lectures.html"
  },
  {
    "name": "Assignments",
    "url": "https://courses.engr.illinois.edu/cs425/fa2016/assignments.html"
  },
  {
    "name": "CS 452 Real-Time Programming University of Waterloo   \n\nWrite a real-time OS microkernel in C, and application code to operate a model train set in response to real-time sensor information. The communication with the train set runs at 2400 baud so it takes about 61 milliseconds to ask all of the sensors for data about the train's possible location.  This makes it particularly challenging because a train can move about 3 centimeters in that time. One of the most challenging and time-consuming courses at the University of Waterloo.\nAssignments\nLecture notes\n\n",
    "url": "http://www.cgl.uwaterloo.ca/%7Ewmcowan/teaching/cs452/s12/"
  },
  {
    "name": "Assignments",
    "url": "http://www.cgl.uwaterloo.ca/%7Ewmcowan/teaching/cs452/s12/assignments/index.html"
  },
  {
    "name": "Lecture notes",
    "url": "http://www.cgl.uwaterloo.ca/%7Ewmcowan/teaching/cs452/s12/notes/index.html"
  },
  {
    "name": "CS 2043 Unix Tools & Scripting Cornell University  \n\nUNIX-like systems are increasingly being used on personal computers, mobile phones, web servers, and many other systems. They represent a wonderful family of programming environments useful both to computer scientists and to people in many other fields, such as computational biology and computational linguistics, in which data is naturally represented by strings. This course provides an intensive training to develop skills in Unix command line tools and scripting that enable the accomplishment and automation of large and challenging computing tasks. The syllabus takes students from shell basics and piping, to regular-expression processing tools, to shell scripting and Python.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS2043/2014sp/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS2043/2014sp/"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS2043/2014sp/"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS2043/2014sp/"
  },
  {
    "name": "CS 3410 Computer System Organization and Programming Cornell University  \n\nCS3410 provides an introduction to computer organization, systems programming and the hardware/software interface. Topics include instruction sets, computer arithmetic, datapath design, data formats, addressing modes, memory hierarchies including caches and virtual memory, I/O devices, bus-based I/O systems, and multicore architectures. Students learn assembly language programming and design a pipelined RISC processor.\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/cs3410/2016fa/"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS3410/2014sp/schedule.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS3410/2014sp/schedule.html"
  },
  {
    "name": "CS 4410 Operating Systems Cornell University \n\nCS 4410 covers systems programming and introductory operating system design and implementation. We will cover the basics of operating systems, namely structure, concurrency, scheduling, synchronization, memory management, filesystems, security and networking. The course is open to any undergraduate who has mastered the material in CS3410/ECE3140.\nSyllabus\nLectures\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS4410/2014fa/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS4410/2014fa/slides/01-intro.pptx"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS4410/2014fa/lectures.php"
  },
  {
    "name": "CS 4414 Operating Systems University of Virginia  \n\nA course (that) covers topics including: Analysis process communication and synchronization; resource management; virtual memory management algorithms; file systems; and networking and distributed systems. The primary goal of this course is to improve your ability to build scalable, robust and secure computing systems. It focuses on doing that by understanding what underlies the core abstractions of modern computer systems.\nSyllabus\nLectures\n\n",
    "url": "http://rust-class.org/index.html"
  },
  {
    "name": "Syllabus",
    "url": "http://rust-class.org/pages/syllabus.html"
  },
  {
    "name": "Lectures",
    "url": "http://rust-class.org/pages/classes.html"
  },
  {
    "name": "CS 5412 Cloud Computing Cornell University  \n\nTaught by one of the stalwarts of this field, Prof Ken Birman, this course has a fantastic set of slides that one can go through. The Prof's book is also a gem and recommended as a must read in Google's tutorial on Distributed System Design\nSlides\n\n",
    "url": "http://www.cs.cornell.edu/Courses/CS5412/2014sp/"
  },
  {
    "name": "Taught by one of the stalwarts of this field, Prof Ken Birman, this course has a fantastic set of slides that one can go through. The Prof's book is also a gem and recommended as a must read in Google's tutorial on Distributed System Design",
    "url": "http://www.amazon.com/Guide-Reliable-Distributed-Systems-High-Assurance/dp/1447124154"
  },
  {
    "name": "Slides",
    "url": "http://www.cs.cornell.edu/Courses/CS5412/2014sp/Syllabus.htm"
  },
  {
    "name": "CSCE 3613 Operating Systems University of Arkansas (Fayetteville)  ",
    "url": "http://comp.uark.edu/%7Ewingning/csce3613/csce3613.html",
    "description": "An introduction to operating systems including topics in system structures, process management, storage management, files, distributed systems, and case studies."
  },
  {
    "name": "Syllabus",
    "url": "http://comp.uark.edu/%7Ewingning/csce3613/CSCE3613.pdf"
  },
  {
    "name": "Assignments",
    "url": "http://comp.uark.edu/%7Ewingning/csce3613/Homework3613.html"
  },
  {
    "name": "Lecture Notes",
    "url": "http://comp.uark.edu/%7Ewingning/csce3613/CourseNote3613.html"
  },
  {
    "name": "Readings",
    "url": "http://comp.uark.edu/%7Ewingning/csce3613/Link3613.html"
  },
  {
    "name": "CSCI-UA.0202: Operating Systems (Undergrad) Operating Systems NYU   \n\nNYU's operating system course. It's a fundamental course focusing basic ideas of operating systems, including memory management, process shceduling, file system, ect. It also includes some recomended reading materials. What's more, there are a series of hands-on lab materials, helping you easily understand OS.\nAssignments\nLectures\nOld Exams\n\n",
    "url": "http://www.cs.nyu.edu/%7Emwalfish/classes/15sp/index.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.nyu.edu/%7Emwalfish/classes/15sp/labs.html"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.nyu.edu/%7Emwalfish/classes/15sp/syllabus.html"
  },
  {
    "name": "Old Exams",
    "url": "http://www.cs.nyu.edu/%7Emwalfish/classes/15sp/exams.html"
  },
  {
    "name": "CSCI 360 Computer Architecture 3 CUNY Hunter College  \n\nA course that covers cache design, buses, memory hierarchies, processor-peripheral interfaces, and multiprocessors, including GPUs.\n\n",
    "url": "http://compsci.hunter.cuny.edu/%7Esweiss/course_materials/csci360/csci360_f14.php"
  },
  {
    "name": "CSCI 493.66 UNIX System Programming (formerly UNIX Tools) CUNY Hunter College  \n\nA course that is mostly about writing programs against the UNIX API, covering all of the basic parts of the kernel interface and libraries, including files, processes, terminal control, signals, and threading.\n\n",
    "url": "http://compsci.hunter.cuny.edu/%7Esweiss/course_materials/csci493.66/csci493.66_spr12.php"
  },
  {
    "name": "CSCI 493.75 Parallel Computing CUNY Hunter College  \n\nThe course is an introduction to parallel algorithms and parallel programming in C and C++, using the Message Passing Interface (MPI) and the OpenMP application programming interface. It also includes a brief introduction to parallel architectures and interconnection networks. It is both theoretical and practical, including material on design methodology, performance analysis, and mathematical concepts, as well as details on programming using MPI and OpenMP.\n\n",
    "url": "http://compsci.hunter.cuny.edu/%7Esweiss/course_materials/csci493.65/csci493.65_spr14.php"
  },
  {
    "name": "Hack the Kernel Introduction to Operating Systems SUNY University at Buffalo, NY   \n\nThis course is an introduction to operating system design and implementation. We study operating systems because they are examples of mature and elegant solutions to a difficult design problem: how to safely and efficiently share system resources and provide abstractions useful to applications.\nFor the processor, memory, and disks, we discuss how the operating system allocates each resource and explore the design and implementation of related abstractions. We also establish techniques for testing and improving system performance and introduce the idea of hardware virtualization. Programming assignments provide hands-on experience with implementing core operating system components in a realistic development environment. Course by Dr.Geoffrey Challen\nSyllabus\nSlides\nVideo lectures\nAssignments\nOld Exams\n\n",
    "url": "https://www.ops-class.org/"
  },
  {
    "name": "For the processor, memory, and disks, we discuss how the operating system allocates each resource and explore the design and implementation of related abstractions. We also establish techniques for testing and improving system performance and introduce the idea of hardware virtualization. Programming assignments provide hands-on experience with implementing core operating system components in a realistic development environment. Course by Dr.Geoffrey Challen",
    "url": "https://blue.cse.buffalo.edu/people/gwa/"
  },
  {
    "name": "Syllabus",
    "url": "https://www.ops-class.org/courses/buffalo/CSE421_Spring2016/"
  },
  {
    "name": "Slides",
    "url": "https://www.ops-class.org/slides/"
  },
  {
    "name": "Video lectures",
    "url": "https://www.youtube.com/playlist?list=PLE6LEE8y2Jp-kbEcVR2W3vfx0Pdca0BD3"
  },
  {
    "name": "Assignments",
    "url": "https://www.ops-class.org/asst/0/"
  },
  {
    "name": "Old Exams",
    "url": "https://www.ops-class.org/exams/"
  },
  {
    "name": "ECE 459 Programming for Performance University of Waterloo  \n\nLearn techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs, and to design and build critical software infrastructure. Learn performance optimization through parallelization, multithreading, async I/O, vectorization and GPU programming, and distributed computing.\nLecture slides\n\n",
    "url": "http://patricklam.ca/p4p/"
  },
  {
    "name": "Lecture slides",
    "url": "https://github.com/patricklam/p4p-2015/tree/master/lectures"
  },
  {
    "name": "PODC Principles of Distributed Computing ETH-Zurich   \n\nExplore essential algorithmic ideas and lower bound techniques, basically the \"pearls\" of distributed computing in an easy-to-read set of lecture notes, combined with complete exercises and solutions.\nBook\nAssignments and Solutions\n\n",
    "url": "http://dcg.ethz.ch/lectures/podc_allstars/"
  },
  {
    "name": "Book",
    "url": "http://dcg.ethz.ch/lectures/podc_allstars/lecture/podc.pdf"
  },
  {
    "name": "Assignments and Solutions",
    "url": "http://dcg.ethz.ch/lectures/podc_allstars/"
  },
  {
    "name": "SPAC Parallelism and Concurrency Univ of Washington \n\nTechnically not a course nevertheless an awesome collection of materials used by Prof Dan Grossman to teach parallelism and concurrency concepts to sophomores at UWash\n\n",
    "url": "http://homes.cs.washington.edu/%7Edjg/teachingMaterials/spac/"
  },
  {
    "name": "6.824 Distributed Systems MIT  \n\nMIT's graduate-level DS course with a focus on fault tolerance, replication, and consistency, all taught via awesome lab assignments in Golang!\nAssignments",
    "url": "http://css.csail.mit.edu/6.824/2014/index.html",
    "description": "Just do git clone git://g.csail.mit.edu/6.824-golabs-2014 6.824"
  },
  {
    "name": "Assignments",
    "url": "http://css.csail.mit.edu/6.824/2014/labs/",
    "description": "Just do git clone git://g.csail.mit.edu/6.824-golabs-2014 6.824"
  },
  {
    "name": "Readings",
    "url": "http://css.csail.mit.edu/6.824/2014/schedule.html"
  },
  {
    "name": "6.828 Operating Systems MIT  \n\nMIT's operating systems course focusing on the fundamentals of OS design including booting, memory management, environments, file systems, multitasking, and more. In a series of lab assignments, you will build JOS, an OS exokernel written in C.\nAssignments\nLectures\nVideos Note: These are student recorded cam videos of the 2011 course. The videos  explain a lot of concepts required for the labs and assignments.\n\n",
    "url": "http://pdos.csail.mit.edu/6.828/2014/"
  },
  {
    "name": "Assignments",
    "url": "http://pdos.csail.mit.edu/6.828/2014/labguide.html"
  },
  {
    "name": "Lectures",
    "url": "http://pdos.csail.mit.edu/6.828/2014/schedule.html"
  },
  {
    "name": "Videos Note: These are student recorded cam videos of the 2011 course. The videos  explain a lot of concepts required for the labs and assignments.",
    "url": "http://pdos.csail.mit.edu/6.828/2011/schedule.html"
  },
  {
    "name": "CSEP 552 Distributed Systems University of Washington   \n\nCSEP552 is a graduate course on distributed systems. Distributed systems have become central to many aspects of how computers are used, from web applications to e-commerce to content distribution. This course will cover abstractions and implementation techniques for the construction of distributed systems, including client server computing, the web, cloud computing, peer-to-peer systems, and distributed storage systems. Topics will include remote procedure call, maintaining consistency of distributed state, fault tolerance, high availability, and other topics. As we believe the best way to learn the material is to build it, there will be a series of hands-on programming projects.\nLectures of a previous session are available to watch.\n\n",
    "url": "http://courses.cs.washington.edu/courses/csep552/16wi/"
  },
  {
    "name": "Lectures of a previous session are available to watch.",
    "url": "http://courses.cs.washington.edu/courses/csep552/13sp/video/"
  },
  {
    "name": "15-213 Introduction to Computer Systems (ICS) Carnegie-Mellon University    \n\nThe ICS course provides a programmer's view of how computer systems execute programs, store information, and communicate. It enables students to become more effective programmers, especially in dealing with issues of performance, portability and robustness. It also serves as a foundation for courses on compilers, networks, operating systems, and computer architecture, where a deeper understanding of systems-level issues is required. Topics covered include: machine-level code and its generation by optimizing compilers, performance evaluation and optimization, computer arithmetic, memory organization and management, networking technology and protocols, and supporting concurrent computation.\nThis is the must-have course for everyone in CMU who wants to learn some computer science no matter what major are you in. Because it's CMU (The course number is as same as the zip code of CMU)!\nLecture Notes\nVideos\nAssignments\n\n",
    "url": "http://www.cs.cmu.edu/%7E213/"
  },
  {
    "name": "Lecture Notes",
    "url": "http://www.cs.cmu.edu/%7E213/schedule.html"
  },
  {
    "name": "Videos",
    "url": "https://scs.hosted.panopto.com/Panopto/Pages/Sessions/List.aspx#folderID=%22b96d90ae-9871-4fae-91e2-b1627b43e25e%22"
  },
  {
    "name": "Assignments",
    "url": "http://csapp.cs.cmu.edu/public/labs.html"
  },
  {
    "name": "15-319/619 Cloud Computing (ICS) Carnegie-Mellon University   \n\nThis project-based on-line course focuses on skill building across various aspects of cloud computing. We cover conceptual topics and provide hands-on experience through projects utilizing public cloud infrastructures (Amazon Web Services (AWS), Microsoft Azure and Google Cloud Platform (GCP)). The adoption of cloud computing services continues to grow across a variety of organizations and in many domains. Simply, cloud computing is the delivery of computing as a service over a network, whereby distributed resources and services are rented, rather than owned, by an end user as a utility.\nFor the projects, students will work with Amazon Web Services, Microsoft Azure and Google Cloud Platform, use them to rent and provision compute resources and then program and deploy applications that run on these resources. Students will develop and evaluate virtual machine (VM) and container scaling, elasticity and load balancing solutions. In addition, students will work with cloud storage systems and learn to develop different applications using batch, iterative and stream processing frameworks. 15-619 students will have to complete an extra project which entails designing and implementing a complete web-service solution for querying big data. For the extra project, the student teams are evaluated based on the cost and performance of their web service.\nLecture Notes\nVideos\n\n",
    "url": "http://www.cs.cmu.edu/%7Emsakr/15619-s17/recitations.html"
  },
  {
    "name": "Lecture Notes",
    "url": "http://www.cs.cmu.edu/%7Emsakr/15619-s17/recitations.html"
  },
  {
    "name": "Videos",
    "url": "http://www.cs.cmu.edu/%7Emsakr/15619-s17/recitations.html"
  },
  {
    "name": "15-418 Parallel Computer Architecture and Programming Carnegie-Mellon University    \n\nThe goal of this course is to provide a deep understanding of the fundamental principles and engineering trade-offs involved in designing modern parallel computing systems as well as to teach parallel programming techniques necessary to effectively utilize these machines. Because writing good parallel programs requires an understanding of key machine performance characteristics, this course will cover both parallel hardware and software design.\nAssignments\nLecture Notes\nLecture Videos\nReadings\n\n",
    "url": "http://15418.courses.cs.cmu.edu/spring2015/"
  },
  {
    "name": "Assignments",
    "url": "http://15418.courses.cs.cmu.edu/spring2015/exercises"
  },
  {
    "name": "Lecture Notes",
    "url": "http://15418.courses.cs.cmu.edu/spring2015/reading"
  },
  {
    "name": "Lecture Videos",
    "url": "https://scs.hosted.panopto.com/Panopto/Pages/Sessions/List.aspx#folderID=%22a5862643-2416-49ef-b46b-13465d1b6df0%22"
  },
  {
    "name": "Readings",
    "url": "http://15418.courses.cs.cmu.edu/spring2015/reading"
  },
  {
    "name": "15-440 Distributed Systems Carnegie-Mellon University   \n\nIntroduction to distributed systems with a focus on teaching concepts via projects implemented in the Go programming language.\nAssignments\n\n",
    "url": "http://www.cs.cmu.edu/%7Edga/15-440/F12/index.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cmu.edu/%7Edga/15-440/F12/assignments.html"
  },
  {
    "name": "15-721 Database Systems Carnegie-Mellon University   \n\nThis course is a comprehensive study of the internals of modern database management systems. It will cover the core concepts and fundamentals of the components that are used in both high-performance transaction processing systems (OLTP) and large-scale analytical systems (OLAP). The class will stress both efficiency and correctness of the implementation of these ideas. All class projects will be in the context of a real in-memory, multi-core database system. The course is appropriate for graduate students in software systems and for advanced undergraduates with strong systems programming skills.\nAssignments\nLecture Videos\nReadings\n\n",
    "url": "http://15721.courses.cs.cmu.edu/spring2016/"
  },
  {
    "name": "Assignments",
    "url": "http://15721.courses.cs.cmu.edu/spring2016/syllabus.html"
  },
  {
    "name": "Lecture Videos",
    "url": "https://www.youtube.com/playlist?list=PLSE8ODhjZXjbisIGOepfnlbfxeH7TW-8O"
  },
  {
    "name": "Readings",
    "url": "http://15721.courses.cs.cmu.edu/spring2016/schedule.html"
  },
  {
    "name": "15-445/645 Database Systems Carnegie-Mellon University   \n\nThis course covers fundamental topics of DBMS, compared to CMU 15-721.\nAssignments\nLecture Videos\nReadings\n\n",
    "url": "http://15445.courses.cs.cmu.edu/fall2017/"
  },
  {
    "name": "Assignments",
    "url": "http://15445.courses.cs.cmu.edu/fall2017/assignments.html"
  },
  {
    "name": "Lecture Videos",
    "url": "https://www.youtube.com/playlist?list=PLSE8ODhjZXjYutVzTeAds8xUt1rcmyT7x"
  },
  {
    "name": "Readings",
    "url": "http://15445.courses.cs.cmu.edu/fall2017/schedule.html"
  },
  {
    "name": "15-749 Engineering Distributed Systems Carnegie-Mellon University \n\nA project focused course on Distributed Systems with an awesome list of readings\nReadings\n\n",
    "url": "http://www.andrew.cmu.edu/course/15-749/"
  },
  {
    "name": "Readings",
    "url": "http://www.andrew.cmu.edu/course/15-749/READINGS/"
  },
  {
    "name": "18-447 Introduction to Computer Architecture CMU   \n\nVery comprehensive material on Computer Architecture",
    "url": "http://www.ece.cmu.edu/%7Eece447/s15/doku.php?id=start",
    "description": "definitely more than just \"introduction\". Online material is very user-friendly, even the recitation videos available online. This is the Spring'15 version by Prof. Onur Mutlu "
  },
  {
    "name": "Very comprehensive material on Computer Architecture",
    "url": "http://users.ece.cmu.edu/%7Eomutlu/",
    "description": "definitely more than just \"introduction\". Online material is very user-friendly, even the recitation videos available online. This is the Spring'15 version by Prof. Onur Mutlu "
  },
  {
    "name": "Lectures and Recitation",
    "url": "http://www.ece.cmu.edu/%7Eece447/s15/doku.php?id=schedule"
  },
  {
    "name": "Homeworks 7 HWs with answer set as well",
    "url": "http://www.ece.cmu.edu/%7Eece447/s15/doku.php?id=homeworks"
  },
  {
    "name": "Readings",
    "url": "http://www.ece.cmu.edu/%7Eece447/s15/doku.php?id=readings"
  },
  {
    "name": "CS 75 Principles of Compiler Design Swathmore College   \n\nModelled after the influential paper on incremental approach to compiler design, this course teaches how to build a compiler in OCaml\nCourse on Github\nNotes\n\n",
    "url": "https://www.cs.swarthmore.edu/%7Ejpolitz/cs75/s16/index.html"
  },
  {
    "name": "Modelled after the influential paper on incremental approach to compiler design, this course teaches how to build a compiler in OCaml",
    "url": "http://scheme2006.cs.uchicago.edu/11-ghuloum.pdf"
  },
  {
    "name": "Course on Github",
    "url": "https://github.com/compilers-course-materials"
  },
  {
    "name": "Notes",
    "url": "https://github.com/compilers-course-materials/cs75-s16-lectures"
  },
  {
    "name": "CS 91 Introduction to Programming Languages Swathmore College  \n\nUses the Pyret programming language & PAPL book to understand the fundamentals of programming languages.\nLabs\n\n",
    "url": "https://www.cs.swarthmore.edu/%7Ejpolitz/cs91/s15/index.html"
  },
  {
    "name": "Uses the Pyret programming language & PAPL book to understand the fundamentals of programming languages.",
    "url": "https://www.pyret.org/"
  },
  {
    "name": "Labs",
    "url": "https://www.cs.swarthmore.edu/%7Ejpolitz/cs91/s15/s_labs.html"
  },
  {
    "name": "CIS 194 Introduction to Haskell Penn Engineering  \n\nExplore the joys of functional programming, using Haskell as a vehicle. The aim of the course will be to allow you to use Haskell to easily and conveniently write practical programs.\nPrevious semester also available, with more exercises\n\n",
    "url": "http://www.seas.upenn.edu/%7Ecis194/"
  },
  {
    "name": "Previous semester also available, with more exercises",
    "url": "http://www.seas.upenn.edu/%7Ecis194/spring13/index.html"
  },
  {
    "name": "CIS 198 Rust Programming UPenn  \n\nThis course covers what makes Rust so unique and applies it to practical systems programming problems. Topics covered include traits and generics; memory safety (move semantics, borrowing, and lifetimes); Rustâ€™s rich macro system; closures; and concurrency.\nAssignments\n\n",
    "url": "http://cis198-2016s.github.io/"
  },
  {
    "name": "Assignments",
    "url": "https://github.com/cis198-2016s/homework"
  },
  {
    "name": "Clojure Functional Programming with Clojure University of Helsinki \n\nThe course is an introduction to functional programming with a dynamically typed language Clojure. We start with an introduction to Clojure; its syntax and development environment. Clojure has a good selection of data structures and we cover most of them. We also go through the basics of recursion and higher-order functions. The course material is in English.\nGithub Page\n\n",
    "url": "http://mooc.cs.helsinki.fi/clojure"
  },
  {
    "name": "Github Page",
    "url": "http://iloveponies.github.io/120-hour-epic-sax-marathon/index.html"
  },
  {
    "name": "CMSC 430 Introduction to Compilers Univ of Maryland  \n\nThe goal of CMSC 430 is to arm students with the ability to design, implement, and extend a programming language. Throughout the course, students will design and implement several related languages, and will explore parsing, syntax querying, dataflow analysis, compilation to bytecode, type systems, and language interoperation.\nLecture Notes\nAssignments\n\n",
    "url": "http://www.cs.umd.edu/class/spring2015/cmsc430/"
  },
  {
    "name": "Lecture Notes",
    "url": "http://www.cs.umd.edu/class/spring2015/cmsc430/Schedule.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.umd.edu/class/spring2015/cmsc430/Projects.html"
  },
  {
    "name": "COS 326 Functional Programming Princeton University  \n\nCovers functional programming concepts like closures, tail-call recursion & parallelism using the OCaml programming language\nLectures\nAssignments\n\n",
    "url": "http://www.cs.princeton.edu/%7Edpw/courses/cos326-12/info.php"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.princeton.edu/%7Edpw/courses/cos326-12/lectures.php"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.princeton.edu/%7Edpw/courses/cos326-12/assignments.php"
  },
  {
    "name": "CS 143 Compiler construction Stanford University \n\nCS143 is a Stanford's course in the practical and theoretical aspects of compiler construction.\nHome\nSyllabus\nLectures\nAssignments\nCS143",
    "url": "https://web.stanford.edu/class/cs143/",
    "description": "2011"
  },
  {
    "name": "Home",
    "url": "https://web.stanford.edu/class/cs143/"
  },
  {
    "name": "Syllabus",
    "url": "https://web.stanford.edu/class/cs143/syllabus.html"
  },
  {
    "name": "Lectures",
    "url": "https://web.stanford.edu/class/cs143/"
  },
  {
    "name": "Assignments",
    "url": "https://web.stanford.edu/class/cs143/"
  },
  {
    "name": "CS143",
    "url": "http://www.keithschwarz.com/cs143/WWW/sum2011/",
    "description": "2011"
  },
  {
    "name": "CS 164 Hack your language! UC Berkeley   \n\nIntroduction to programming languages by designing and implementing domain-specific languages.\nLecture Videos\nCode for Assignments\n\n",
    "url": "https://sites.google.com/a/bodik.org/cs164/home"
  },
  {
    "name": "Lecture Videos",
    "url": "https://archive.org/details/ucberkeley-webcast-PL3A16CFC42CA6EF4F"
  },
  {
    "name": "Code for Assignments",
    "url": "https://bitbucket.org/cs164_overlord/"
  },
  {
    "name": "CS 173 Programming Languages Brown University  \n\nCourse by Prof. Krishnamurthi (author of HtDP) and numerous other awesome books on programming languages. Uses a custom designed Pyret programming language to teach the concepts. There was an online class hosted in 2012, which includes all lecture videos for you to enjoy.\nVideos\nAssignments\n\n",
    "url": "http://cs.brown.edu/courses/cs173/2014/"
  },
  {
    "name": "Course by Prof. Krishnamurthi (author of HtDP) and numerous other awesome books on programming languages. Uses a custom designed Pyret programming language to teach the concepts. There was an online class hosted in 2012, which includes all lecture videos for you to enjoy.",
    "url": "http://htdp.org/2003-09-26/Book/"
  },
  {
    "name": "Videos",
    "url": "http://cs.brown.edu/courses/cs173/2012/Videos/"
  },
  {
    "name": "Assignments",
    "url": "http://cs.brown.edu/courses/cs173/2014/assignments.html"
  },
  {
    "name": "CS 223 Purely Functional Data Structures In Elm University of Chicago  \n\nThis course teaches functional reactive programming and purely functional data structures based on Chris Okazaki's book and using the Elm programming language.\nLectures\nAssignments\n\n",
    "url": "https://www.classes.cs.uchicago.edu/archive/2016/winter/22300-1/"
  },
  {
    "name": "Lectures",
    "url": "https://www.classes.cs.uchicago.edu/archive/2015/winter/22300-1/Schedule.html"
  },
  {
    "name": "Assignments",
    "url": "https://www.classes.cs.uchicago.edu/archive/2015/winter/22300-1/Schedule.html"
  },
  {
    "name": "CS 240h Functional Systems in Haskell Stanford University  \n\nBuilding software systems in Haskell\nLecture Slides\n3 Assignments: Lab1, Lab2, Lab3\n\n",
    "url": "http://www.scs.stanford.edu/14sp-cs240h/"
  },
  {
    "name": "Lecture Slides",
    "url": "http://www.scs.stanford.edu/14sp-cs240h/slides/"
  },
  {
    "name": "3 Assignments: Lab1, Lab2, Lab3",
    "url": "http://www.scs.stanford.edu/14sp-cs240h/labs/lab1.html"
  },
  {
    "name": "CS 421 Programming Languages and Compilers Univ of Illinois, Urbana-Champaign   \nCourse that uses OCaml to teach functional programming and programming language design.\n\nLectures\nVideos\nAssignments\nExams\n\n",
    "url": "https://courses.engr.illinois.edu/cs421/fa2014/"
  },
  {
    "name": "Lectures",
    "url": "https://courses.engr.illinois.edu/cs421/fa2014/lectures/index.html"
  },
  {
    "name": "Videos",
    "url": "http://recordings.engineering.illinois.edu/ess/portal/section/631edaeb-2a33-4537-b7c8-0c1cba783a4f"
  },
  {
    "name": "Assignments",
    "url": "https://courses.engr.illinois.edu/cs421/fa2014/mps/index.html"
  },
  {
    "name": "Exams",
    "url": "https://courses.engr.illinois.edu/cs421/fa2014/exams/index.html"
  },
  {
    "name": "CS 3110 Data Structures and Functional Programming Cornell University  \n\nAnother course that uses OCaml to teach alternative programming paradigms, especially functional and concurrent programming.\nLecture Slides\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/Courses/cs3110/2014fa/course_info.php"
  },
  {
    "name": "Lecture Slides",
    "url": "http://www.cs.cornell.edu/Courses/cs3110/2014fa/lecture_notes.php"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/Courses/cs3110/2014fa/"
  },
  {
    "name": "CS 4120 Introduction to Compilers Cornell University  \n\nAn introduction to the specification and implementation of modern compilers. Topics covered include lexical scanning, parsing, type checking, code generation and translation, an introduction to optimization, and compile-time and run-time support for modern programming languages.  As part of the course, students build a working compiler for an object-oriented language.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS4120/2013fa/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS4120/2013fa/overview.html"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS4120/2013fa/schedule.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS4120/2013fa/homework.html"
  },
  {
    "name": "CS 4400 Programming Languages Northeastern University   \n\nThis is a course on the study, design, and implementation of programming languages.\nThe course works at two simultaneous levels: first, we will use a programming language that can demonstrate a wide variety of programming paradigms. Second, using this language, we will learn about the mechanics behind programming languages by implementing our own language(s). The two level approach usually means that we will often see how to use a certain feature, and continue by implementing it.\nSyllabus\nLecture Notes/Resources\n\n",
    "url": "https://pl.barzilay.org/"
  },
  {
    "name": "Syllabus",
    "url": "https://pl.barzilay.org/syllabus.html"
  },
  {
    "name": "Lecture Notes/Resources",
    "url": "https://pl.barzilay.org/resources.html"
  },
  {
    "name": "CS 4610 Programming Languages and Compilers University of Virginia  \n\nCourse that uses OCaml to teach functional programming and programming language design. Each assignment is a part of an interpreter and compiler for an object-oriented language similar to Java, and you are required to use a different language for each assignment (i.e., choose 4 from Python, JS, OCaml, Haskell, Ruby).\nLecture Notes\nAssignments\n\n",
    "url": "http://www.cs.virginia.edu/%7Eweimer/4610/"
  },
  {
    "name": "Lecture Notes",
    "url": "http://www.cs.virginia.edu/%7Eweimer/4610/lectures.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.virginia.edu/%7Eweimer/4610/pa.html"
  },
  {
    "name": "CS 5114 Network Programming Languages Cornell University \n\nThis course provides an introduction to the languages used to program computer networks. It will examine recent proposals based on logic, functional, and distributed languages, as well as tools for establishing correctness using automatic solvers, model checkers, and proof assistants.\nSyllabus\nLectures\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS5114/2013sp/index.php"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS5114/2013sp/syllabus.php"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS5114/2013sp/syllabus.php"
  },
  {
    "name": "CS 5142 Scripting Languages Cornell University \n\nPerl, PHP, JavaScript, VisualBasic -- they are often-requested skills for employment, but most of us do not have the time to find out what they are all about. In this course, you learn how to use scripting languages for rapid prototyping, web programming, data processing, and application extension. Besides covering traditional programming languages concepts as they apply to scripting (e.g., dynamic typing and scoping), this course looks at new concepts rarely found in traditional languages (e.g., string interpolation, hashes, and polylingual code). Through a series of small projects, you use different languages to achieve programming tasks that highlight the strengths and weaknesses of scripting. As a side effect, you practice teaching yourself new languages.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS5142/2013fa/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS5142/2013fa/"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS5142/2013fa/#schedule"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS5142/2013fa/#schedule"
  },
  {
    "name": "CS 5470 Compilers University of Utah   \n\nIf you're a fan of Prof Matt's writing on his fantastic blog you ought to give this a shot. The course covers the design and implementation of compilers, and it explores related topics such as interpreters, virtual machines and runtime systems. Aside from the Prof's witty take on cheating the page has tons of interesting links on programming languages, parsing and compilers.\nLecture Notes\nProjects\n\n",
    "url": "http://matt.might.net/teaching/compilers/spring-2015/"
  },
  {
    "name": "If you're a fan of Prof Matt's writing on his fantastic blog you ought to give this a shot. The course covers the design and implementation of compilers, and it explores related topics such as interpreters, virtual machines and runtime systems. Aside from the Prof's witty take on cheating the page has tons of interesting links on programming languages, parsing and compilers.",
    "url": "http://matt.might.net/articles/"
  },
  {
    "name": "Lecture Notes",
    "url": "https://www.dropbox.com/sh/zanwtoflw4pcfu8/5pdT6axS3y"
  },
  {
    "name": "Projects",
    "url": "http://matt.might.net/teaching/compilers/spring-2015/#projects"
  },
  {
    "name": "CS 6118 Types and Semantics Cornell University \n\nTypes and Semantics is about designing and understand programming languages, whether they be domain specific or general purpose. The goal of this class is to provide a variety of tools for designing custom (programming) languages for whatever task is at hand. Part of that will be a variety of insights on how languages work along with experiences from working with academics and industry on creating new languages such as Ceylon and Kotlin. The class focuses on types and semantics and the interplay between them. This means category theory and constructive type theory (e.g. Coq and richer variations) are ancillary topics of the class. The class also covers unconventional semantic domains such as classical linear type theory in order to both break students from convential thinking and to provide powerful targets capable of formalizing thinks like networking protocols, resource-sensitive computation, and concurrency constructs. The class project is to design and formalize a (programming) language for a purpose of the student's choosing, and assignments are designed to ensure students have had a chance to practice applying the techniques learned in class before culminating these skills in the class project.\nSyllabus\nLectures\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS6118/2012fa/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS6118/2012fa/"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS6118/2012fa/"
  },
  {
    "name": "CSC 253 CPython internals: A ten-hour codewalk through the Python interpreter source code University of Rochester \n\nNine lectures walking through the internals of CPython, the canonical Python interpreter implemented in C. They were from the Dynamic Languages and Software Development course taught in Fall 2014 at the University of Rochester.\n\n",
    "url": "http://pgbovine.net/cpython-internals.htm"
  },
  {
    "name": "CSE 341 Programming Languages University of Washington   \n\nCovers non-imperative paradigms and languages such as Ruby, Racket, and ML and the fundamentals of programming languages.\nLectures and Videos\nAssignments and Tests\n\n",
    "url": "http://courses.cs.washington.edu/courses/cse341/16sp/"
  },
  {
    "name": "Lectures and Videos",
    "url": "https://courses.cs.washington.edu/courses/cse341/16sp/#lectures"
  },
  {
    "name": "Assignments and Tests",
    "url": "https://courses.cs.washington.edu/courses/cse341/16sp/#homeworks"
  },
  {
    "name": "CSE P 501 Compiler Construction University of Washington  \n\nTeaches understanding of how a modern compiler is structured and the major algorithms that are used to translate code from high-level to machine language. The best way to do this is to actually build a working compiler, so there will be a significant project to implement one that translates programs written in a core subset of Java into executable x86 assembly language. The compilers themselves will use scanner and parser generator tools and the default implementation language is Java.\nLectures\nAssignments, Tests, and Solutions\n\n",
    "url": "http://courses.cs.washington.edu/courses/csep501/09au/lectures/video.html"
  },
  {
    "name": "Lectures",
    "url": "http://courses.cs.washington.edu/courses/csep501/09au/lectures/video.html"
  },
  {
    "name": "Assignments, Tests, and Solutions",
    "url": "http://courses.cs.washington.edu/courses/csep501/09au/homework/index.html"
  },
  {
    "name": "DMFP Discrete Mathematics and Functional Programming Wheaton College  \n\nA course that teaches discrete maths concepts with functional programming\nLecture Videos\nAssignments\n\n",
    "url": "http://cs.wheaton.edu/%7Etvandrun/dmfp/"
  },
  {
    "name": "Lecture Videos",
    "url": "http://cs.wheaton.edu/%7Etvandrun/dmfp/"
  },
  {
    "name": "Assignments",
    "url": "http://cs.wheaton.edu/%7Etvandrun/dmfp/source.html"
  },
  {
    "name": "PCPP Practical Concurrent and Parallel Programming IT University of Copenhagen \n\nIn this MSc course you learn how to write correct and efficient concurrent and parallel software, primarily using Java, on standard shared-memory multicore hardware.\nThe course covers basic mechanisms such as threads, locks and shared memory as well as more advanced mechanisms such as parallel streams for bulk data, transactional memory, message passing, and lock-free data structures with compare-and-swap.\nIt covers concepts such as atomicity, safety, liveness and deadlock.\nIt covers how to measure and understand performance and scalability of parallel programs.\nIt covers tools and methods to find bugs in concurrent programs.\n\n",
    "url": "http://www.itu.dk/people/sestoft/itu/PCPP/E2015/"
  },
  {
    "name": "6.945 Adventures in Advanced Symbolic Programming MIT \n\nTaught by Gerald Sussman of SICP fame, this class deals with concepts and techniques for the design an implementation of large software systems that can be adapted to uses not anticipated by the designer. Applications include compilers, computer-algebra systems, deductive systems, and some artificial intelligence applications.\nAssignments: Extensive programming assignments, using MIT/GNU Scheme. Students should have significant programming experience in Scheme, Common Lisp, Haskell, CAML or other \"functional\" language.\nReadings\n\n",
    "url": "https://groups.csail.mit.edu/mac/users/gjs/6.945/index.html"
  },
  {
    "name": "Assignments: Extensive programming assignments, using MIT/GNU Scheme. Students should have significant programming experience in Scheme, Common Lisp, Haskell, CAML or other \"functional\" language.",
    "url": "https://groups.csail.mit.edu/mac/users/gjs/6.945/assignments.html"
  },
  {
    "name": "Readings",
    "url": "https://groups.csail.mit.edu/mac/users/gjs/6.945/readings/"
  },
  {
    "name": "CS 696 Functional Design and Programming San Diego State University \n\nCovers functional programming basis using Clojure.\nTopics include testing, functional programming, immutable collections and concurrency.\nAlso includes assignments covering Clojurescript, [Reagent](Reagent Github) etc.\n\n",
    "url": "http://www.eli.sdsu.edu/courses/fall15/cs696/index.html"
  },
  {
    "name": "L28 Advanced Functional Programming University of Cambridge  \n\nThis module aims to teach students how to use the features of modern typed functional programming languages (e.g. OCaml, Haskell) to design and implement libraries and DSLs. It aims to demonstrate how such techniques can improve both correctness and efficiency. Students wishing to take the module should have some experience of a typed functional programming language and an understanding of type inference.\nThis particular session was taught by a prominent OCaml programmer, open Source contributor & author of real world OCaml",
    "url": "https://www.cl.cam.ac.uk/teaching/1516/L28/",
    "description": "Dr Anil Madhavapeddy."
  },
  {
    "name": "CS 61B Data Structures UC Berkeley    \n\nIn this course, you will study advanced programming techniques including data structures, encapsulation, abstract data types, interfaces, and algorithms for sorting and searching, and you will get a taste of â€œsoftware engineeringâ€â€”the design and implementation of large programs.\nFull Lecture Materials Lecture of Spring 2016. This website contains full matrials including video links, labs, homeworks, projects. Very good for self-learner. Also a good start for Java. And it includes some other usefull resources for Java Documentation, Data Structure Resources, Git/GitHub and Java Development Resources. Resources\nLabs The link to labs and projects is included in the website.\nLecture Videos\n\n",
    "url": "http://datastructur.es/sp16/"
  },
  {
    "name": "Full Lecture Materials Lecture of Spring 2016. This website contains full matrials including video links, labs, homeworks, projects. Very good for self-learner. Also a good start for Java. And it includes some other usefull resources for Java Documentation, Data Structure Resources, Git/GitHub and Java Development Resources. Resources",
    "url": "http://datastructur.es/sp16/"
  },
  {
    "name": "Labs The link to labs and projects is included in the website.",
    "url": "http://www.cs.berkeley.edu/%7Ejrs/61b/lab/index.html"
  },
  {
    "name": "Lecture Videos",
    "url": "https://archive.org/details/ucberkeley-webcast-PL-XXv-cvA_iC2Khb1B5NnbE7SHPQ1-W17"
  },
  {
    "name": "CS 97SI Introduction to Competitive Programming Stanford University   \n\nFantastic repository of theory and practice problems across various topics for students who are interested to participate in ACM-ICPC.\nLectures and Assignments\n\n",
    "url": "http://web.stanford.edu/class/cs97si/"
  },
  {
    "name": "Lectures and Assignments",
    "url": "http://stanford.edu/%7Eliszt90/acm/notebook.html"
  },
  {
    "name": "CS 224 Advanced Algorithms Harvard University   \n\nCS 224 is an advanced course in algorithm design, and topics we will cover include the word RAM model, data structures, amortization, online algorithms, linear programming, semidefinite programming, approximation algorithms, hashing, randomized algorithms, fast exponential time algorithms, graph algorithms, and computational geometry.\nLecture Videos (Youtube)\nAssignments\n\n",
    "url": "http://people.seas.harvard.edu/%7Eminilek/cs224/fall14/index.html"
  },
  {
    "name": "Lecture Videos (Youtube)",
    "url": "http://people.seas.harvard.edu/%7Eminilek/cs224/fall14/lec.html"
  },
  {
    "name": "Assignments",
    "url": "http://people.seas.harvard.edu/%7Eminilek/cs224/fall14/hmwk.html"
  },
  {
    "name": "CS 261 A Second Course in Algorithms Stanford University   \n\nAlgorithms for network optimization: max-flow, min-cost flow, matching, assignment, and min-cut problems. Introduction to linear programming. Use of LP duality for design and analysis of algorithms. Approximation algorithms for NP-complete problems such as Steiner Trees, Traveling Salesman, and scheduling problems. Randomized algorithms. Introduction to online algorithms.\nLecture Notes, Videos & Assignments (Youtube)\n\n",
    "url": "http://theory.stanford.edu/%7Etim/w16/w16.html"
  },
  {
    "name": "Lecture Notes, Videos & Assignments (Youtube)",
    "url": "http://theory.stanford.edu/%7Etim/w16/w16.html"
  },
  {
    "name": "CS 473/573 Fundamental Algorithms Univ of Illinois, Urbana-Champaign  \n\nAlgorithms class covering recursion, randomization, amortization, graph algorithms, network flows and hardness. The lecture notes by Prof. Erikson are comprehensive enough to be a book by themselves. Highly recommended!\nLecture Notes\nLabs and Exams\n\n",
    "url": "http://web.engr.illinois.edu/%7Ejeffe/teaching/algorithms/"
  },
  {
    "name": "Lecture Notes",
    "url": "http://web.engr.illinois.edu/%7Ejeffe/teaching/algorithms/all-algorithms.pdf"
  },
  {
    "name": "Labs and Exams",
    "url": "http://web.engr.illinois.edu/%7Ejeffe/teaching/algorithms/all-hwex.pdf"
  },
  {
    "name": "CS 2150 Program & Data Representation University of Virginia  \n\nThis data structures course introduces C++, linked-lists, stacks, queues, trees, numerical representation, hash tables, priority queues, heaps, huffman coding, graphs, and x86 assembly.\nLectures\nAssignments\n\n",
    "url": "https://github.com/aaronbloomfield/pdr"
  },
  {
    "name": "Lectures",
    "url": "http://aaronbloomfield.github.io/pdr/slides/"
  },
  {
    "name": "Assignments",
    "url": "http://aaronbloomfield.github.io/pdr/labs/"
  },
  {
    "name": "CS 4820 Introduction to Analysis of Algorithms Cornell University   \n\nThis course develops techniques used in the design and analysis of algorithms, with an emphasis on problems arising in computing applications. Example applications are drawn from systems and networks, artificial intelligence, computer vision, data mining, and computational biology. This course covers four major algorithm design techniques (greedy algorithms, divide and conquer, dynamic programming, and network flow), computability theory focusing on undecidability, computational complexity focusing on NP-completeness, and algorithmic techniques for intractable problems, including identification of structured special cases, approximation algorithms, and local search heuristics.\nLectures\nAssignments\nSyllabus\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS4820/2014sp/"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS4820/2014sp/lectures/"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS4820/2014sp/homework/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS4820/2014sp/syllabus/"
  },
  {
    "name": "CSCI 104 Data Structures and Object Oriented Design   University of Southern California (USC)\n\nLectures\nLabs\nAssignments\nAdditional Resources\n\n",
    "url": "http://www-scf.usc.edu/%7Ecsci104/20142/lectures/"
  },
  {
    "name": "Lectures",
    "url": "http://www-scf.usc.edu/%7Ecsci104/20142/lectures"
  },
  {
    "name": "Labs",
    "url": "http://www-scf.usc.edu/%7Ecsci104/20142/labs"
  },
  {
    "name": "Assignments",
    "url": "http://www-scf.usc.edu/%7Ecsci104/20142/assignments/"
  },
  {
    "name": "Additional Resources",
    "url": "http://www-scf.usc.edu/%7Ecsci104/20142/resources.html"
  },
  {
    "name": "CSCI 135 Software Design and Analysis I  \nCUNY Hunter College\n\nIt is currently an intensive introduction to program development and problem solving. Its emphasis is on the process of designing, implementing, and evaluating small-scale programs. It is not supposed to be a C++ programming course, although much of the course is spent on the details of C++. C++ is an extremely large and complex programming language with many features that interact in unexpected ways. One does not need to know even half of the language to use it well.\nLectures and Assignments\n\n",
    "url": "http://compsci.hunter.cuny.edu/%7Esweiss/courses/csci135.php"
  },
  {
    "name": "Lectures and Assignments",
    "url": "http://compsci.hunter.cuny.edu/%7Esweiss/course_materials/csci135/csci135_36_fall12.php"
  },
  {
    "name": "CSCI 235 Software Design and Analysis II CUNY Hunter College  \n\nIntroduces algorithms for a few common problems such as sorting. Practically speaking, it furthers the students' programming skills with topics such as recursion, pointers, and exception handling, and provides a chance to improve software engineering skills and to give the students practical experience for more productive programming.\nLectures and Assignments\n\n",
    "url": "http://compsci.hunter.cuny.edu/%7Esweiss/courses/csci235.php"
  },
  {
    "name": "Lectures and Assignments",
    "url": "http://compsci.hunter.cuny.edu/%7Esweiss/course_materials/csci235/csci235_f14.php"
  },
  {
    "name": "CSCI 335 Software Design and Analysis III  \nCUNY Hunter College\n\nThis includes the introduction of hashes, heaps, various forms of trees, and graphs. It also revisits recursion and the sorting problem from a higher perspective than was presented in the prequels. On top of this, it is intended to introduce methods of algorithmic analysis.\nLectures and Assignments\n\n",
    "url": "http://compsci.hunter.cuny.edu/%7Esweiss/courses/csci335.php"
  },
  {
    "name": "Lectures and Assignments",
    "url": "http://compsci.hunter.cuny.edu/%7Esweiss/course_materials/csci335/csci335_s14.php"
  },
  {
    "name": "CSE 331 Software Design and Implementation University of Washington  \n\nExplores concepts and techniques for design and construction of reliable and maintainable software systems in modern high-level languages; program structure and design; program-correctness approaches, including testing.\nLectures, Assignments, and Exams\n\n",
    "url": "http://courses.cs.washington.edu/courses/cse331/15sp/"
  },
  {
    "name": "Lectures, Assignments, and Exams",
    "url": "http://courses.cs.washington.edu/courses/cse331/15sp/#all"
  },
  {
    "name": "CSE 373 Analysis of Algorithms Stony Brook University    \n\nProf Steven Skiena's no stranger to any student when it comes to algorithms. His seminal book has been touted by many to be best for getting that job in Google. In addition, he's also well-known for tutoring students in competitive programming competitions. If you're looking to brush up your knowledge on Algorithms, you can't go wrong with this course.\nLecture Videos\n\n",
    "url": "http://www3.cs.stonybrook.edu/%7Eskiena/373/"
  },
  {
    "name": "Prof Steven Skiena's no stranger to any student when it comes to algorithms. His seminal book has been touted by many to be best for getting that job in Google. In addition, he's also well-known for tutoring students in competitive programming competitions. If you're looking to brush up your knowledge on Algorithms, you can't go wrong with this course.",
    "url": "http://www.algorist.com/"
  },
  {
    "name": "Lecture Videos",
    "url": "http://www.cs.sunysb.edu/%7Ealgorith/video-lectures/"
  },
  {
    "name": "ECS 122A Algorithm Design and Analysis UC Davis   \n\nTaught by Dan Gusfield in 2010, this course is an undergraduate introduction to algorithm design and analysis. It features traditional topics, such as Big Oh notation, as well as an importance on implementing specific algorithms. Also featured are sorting (in linear time), graph algorithms, depth-first search, string matching, dynamic programming, NP-completeness, approximation, and randomization.\nSyllabus\nLecture Videos\nAssignments\n\n",
    "url": "http://web.cs.ucdavis.edu/%7Egusfield/cs122f10/"
  },
  {
    "name": "Taught by Dan Gusfield in 2010, this course is an undergraduate introduction to algorithm design and analysis. It features traditional topics, such as Big Oh notation, as well as an importance on implementing specific algorithms. Also featured are sorting (in linear time), graph algorithms, depth-first search, string matching, dynamic programming, NP-completeness, approximation, and randomization.",
    "url": "http://web.cs.ucdavis.edu/%7Egusfield/"
  },
  {
    "name": "Syllabus",
    "url": "http://web.cs.ucdavis.edu/%7Egusfield/cs122f10/syll122.pdf"
  },
  {
    "name": "Lecture Videos",
    "url": "http://web.cs.ucdavis.edu/%7Egusfield/cs122f10/videolist.html"
  },
  {
    "name": "Assignments",
    "url": "http://web.cs.ucdavis.edu/%7Egusfield/cs122f10/"
  },
  {
    "name": "ECS 222A Graduate Level Algorithm Design and Analysis UC Davis   \n\nThis is the graduate level complement to the ECS 122A undergraduate algorithms course by Dan Gusfield in 2011. It assumes an undergrad course has already been taken in algorithms, and, while going over some undergraduate algorithms topics, focuses more on increasingly complex and advanced algorithms.\nLecture Videos\nSyllabus\nAssignments\n\n",
    "url": "http://web.cs.ucdavis.edu/%7Egusfield/cs222w11/"
  },
  {
    "name": "This is the graduate level complement to the ECS 122A undergraduate algorithms course by Dan Gusfield in 2011. It assumes an undergrad course has already been taken in algorithms, and, while going over some undergraduate algorithms topics, focuses more on increasingly complex and advanced algorithms.",
    "url": "http://web.cs.ucdavis.edu/%7Egusfield/"
  },
  {
    "name": "Lecture Videos",
    "url": "http://web.cs.ucdavis.edu/%7Egusfield/cs222f07/videolist.html"
  },
  {
    "name": "Syllabus",
    "url": "http://web.cs.ucdavis.edu/%7Egusfield/cs222w11/syll11.pdf"
  },
  {
    "name": "Assignments",
    "url": "http://web.cs.ucdavis.edu/%7Egusfield/cs222w11/"
  },
  {
    "name": "6.INT Hacking a Google Interview MIT \n\nThis course taught in the MIT Independent Activities Period in 2009 goes over common solution to common interview questions for software engineer interviews at highly selective companies like Apple, Google, and Facebook. They cover time complexity, hash tables, binary search trees, and other common algorithm topics you should have already covered in a different course, but goes more in depth on things you wouldn't otherwise learn in class- like bitwise logic and problem solving tricks.\nHandouts\nTopics Covered\n\n",
    "url": "http://courses.csail.mit.edu/iap/interview/index.php"
  },
  {
    "name": "Handouts",
    "url": "http://courses.csail.mit.edu/iap/interview/materials.php"
  },
  {
    "name": "Topics Covered",
    "url": "http://courses.csail.mit.edu/iap/interview/calendar.php"
  },
  {
    "name": "6.006 Introduction to Algorithms MIT  \n\nThis course provides an introduction to mathematical modeling of computational problems. It covers the common algorithms, algorithmic paradigms, and data structures used to solve these problems. The course emphasizes the relationship between algorithms and programming, and introduces basic performance measures and analysis techniques for these problems. This course provides an introduction to mathematical modeling of computational problems. It covers the common algorithms, algorithmic paradigms, and data structures used to solve these problems. The course emphasizes the relationship between algorithms and programming, and introduces basic performance measures and analysis techniques for these problems.\nLecture Videos\nAssignments\nReadings\nResources\nOld Exams\n\n",
    "url": "https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/index.htm"
  },
  {
    "name": "Lecture Videos",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/lecture-videos/"
  },
  {
    "name": "Assignments",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/assignments/"
  },
  {
    "name": "Readings",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/readings/"
  },
  {
    "name": "Resources",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/download-course-materials/"
  },
  {
    "name": "Old Exams",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/exams/"
  },
  {
    "name": "6.046J/18.410J Design and Analysis of Algorithms MIT   \n\nThis is an intermediate algorithms course with an emphasis on teaching techniques for the design and analysis of efficient algorithms, emphasizing methods of application. Topics include divide-and-conquer, randomization, dynamic programming, greedy algorithms, incremental improvement, complexity, and cryptography. This course assumes that students know how to analyze simple algorithms and data structures from having taken 6.006. It introduces students to the design of computer algorithms, as well as analysis of sophisticated algorithms.\nLecture Videos\nLecture Notes\nAssignments\nResources\nOld Exams\n\n",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-046j-design-and-analysis-of-algorithms-spring-2015/index.htm"
  },
  {
    "name": "This is an intermediate algorithms course with an emphasis on teaching techniques for the design and analysis of efficient algorithms, emphasizing methods of application. Topics include divide-and-conquer, randomization, dynamic programming, greedy algorithms, incremental improvement, complexity, and cryptography. This course assumes that students know how to analyze simple algorithms and data structures from having taken 6.006. It introduces students to the design of computer algorithms, as well as analysis of sophisticated algorithms.",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/"
  },
  {
    "name": "Lecture Videos",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-046j-design-and-analysis-of-algorithms-spring-2015/lecture-videos/"
  },
  {
    "name": "Lecture Notes",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-046j-design-and-analysis-of-algorithms-spring-2015/lecture-notes/"
  },
  {
    "name": "Assignments",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-046j-design-and-analysis-of-algorithms-spring-2015/assignments/"
  },
  {
    "name": "Resources",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-046j-design-and-analysis-of-algorithms-spring-2015/download-course-materials/"
  },
  {
    "name": "Old Exams",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-046j-design-and-analysis-of-algorithms-spring-2015/exams/"
  },
  {
    "name": "6.851 Advanced Data Structures MIT   \n\nThis is an advanced DS course, you must be done with the Advanced Algorithms course before attempting this one.\nLectures Contains videos from sp2012 version, but there isn't much difference.\nAssignments contains the calendar as well.\n\n",
    "url": "http://courses.csail.mit.edu/6.851/spring14/index.html"
  },
  {
    "name": "This is an advanced DS course, you must be done with the Advanced Algorithms course before attempting this one.",
    "url": "http://courses.csail.mit.edu/6.854/current/"
  },
  {
    "name": "Lectures Contains videos from sp2012 version, but there isn't much difference.",
    "url": "http://courses.csail.mit.edu/6.851/spring14/lectures/"
  },
  {
    "name": "Assignments contains the calendar as well.",
    "url": "http://courses.csail.mit.edu/6.851/spring14/hmwk.html"
  },
  {
    "name": "6.854/18.415J Advanced Algorithms MIT   \n\nAdvanced course in algorithms by Dr. David Karger covering topics such as amortization, randomization, fingerprinting, word-level parallelism, bit scaling, dynamic programming, network flow, linear programming, fixed-parameter algorithms, and approximation algorithms.\nRegister on NB to access the problem set and lectures.\n\n",
    "url": "http://courses.csail.mit.edu/6.854/current/"
  },
  {
    "name": "6.854J/18.415J Advanced Algorithms MIT  \n\nThis course is a first-year graduate course in algorithms. Emphasis is placed on fundamental algorithms and advanced methods of algorithmic design, analysis, and implementation. Techniques to be covered include amortization, randomization, fingerprinting, word-level parallelism, bit scaling, dynamic programming, network flow, linear programming, fixed-parameter algorithms, and approximation algorithms. Domains include string algorithms, network optimization, parallel algorithms, computational geometry, online algorithms, external memory, cache, and streaming algorithms, and data structures. The need for efficient algorithms arises in nearly every area of computer science. But the type of problem to be solved, the notion of what algorithms are \"efficient,'' and even the model of computation can vary widely from area to area. In this second class in algorithms, we will survey many of the techniques that apply broadly in the design of efficient algorithms, and study their application in a wide range of application domains and computational models. The goal is for the class to be broad rather than deep. Our plan is to touch upon the following areas. This is a tentative list of topics that might be covered in the class; we will select material adaptively based on the background, interests, and rate of progress of the students.\nLecture Videos",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-854j-advanced-algorithms-fall-2005/index.htm",
    "description": "Spring 2016"
  },
  {
    "name": "Lecture Videos",
    "url": "https://www.youtube.com/playlist?list=PL6ogFv-ieghdoGKGg2Bik3Gl1glBTEu8c",
    "description": "Spring 2016"
  },
  {
    "name": "Lecture Notes",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-854j-advanced-algorithms-fall-2005/lecture-notes/"
  },
  {
    "name": "Assignments",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-854j-advanced-algorithms-fall-2005/assignments/"
  },
  {
    "name": "Readings",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-854j-advanced-algorithms-fall-2005/readings/"
  },
  {
    "name": "Resources",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-854j-advanced-algorithms-fall-2005/download-course-materials/"
  },
  {
    "name": "15-451/651 Algorithms Carnegie Mellon University \n\nThe required algorithms class that go in depth into all basic algorithms and the proofs behind them. This is one of the heavier algorithms curriculums on this page. Taught by Avrim Blum and Manuel Blum who has a Turing Award due to his contributions to algorithms. Course link includes a very comprehensive set of reference notes by Avrim Blum.\n\n",
    "url": "http://www.cs.cmu.edu/afs/cs/academic/class/15451-f10/www/"
  },
  {
    "name": "The required algorithms class that go in depth into all basic algorithms and the proofs behind them. This is one of the heavier algorithms curriculums on this page. Taught by Avrim Blum and Manuel Blum who has a Turing Award due to his contributions to algorithms. Course link includes a very comprehensive set of reference notes by Avrim Blum.",
    "url": "http://en.wikipedia.org/wiki/Manuel_Blum"
  },
  {
    "name": "16s-4102 Algorithms University of Virginia  \n\nLecture Videos & Homeworks (Youtube)\n\n",
    "url": "http://www.cs.virginia.edu/%7Eshelat/16s-4102/"
  },
  {
    "name": "Lecture Videos & Homeworks (Youtube)",
    "url": "http://www.cs.virginia.edu/%7Eshelat/16s-4102/"
  },
  {
    "name": "CIS 500 Software Foundations University of Pennsylvania  \n\nAn introduction to formal verification of software using the Coq proof assistant. Topics include basic concepts of logic, computer-assisted theorem proving, functional programming, operational semantics, Hoare logic, and static type systems.\nLectures and Assignments\nTextbook\n\n",
    "url": "http://www.seas.upenn.edu/%7Ecis500/cis500-f14/index.html"
  },
  {
    "name": "Lectures and Assignments",
    "url": "http://www.seas.upenn.edu/%7Ecis500/cis500-f14/index.html#schedule"
  },
  {
    "name": "Textbook",
    "url": "http://www.cis.upenn.edu/%7Ebcpierce/sf/current/index.html"
  },
  {
    "name": "CS 103 Mathematical Foundations of Computing Stanford University  \n\nCS103 is a first course in discrete math, computability theory, and complexity theory. In this course, we'll probe the limits of computer power, explore why some problems are harder to solve than others, and see how to reason with mathematical certainty.\nLinks to all lectures notes and assignments are directly on the course page\n\n",
    "url": "http://web.stanford.edu/class/cs103/"
  },
  {
    "name": "CS 173 Discrete Structures Univ of Illinois Urbana-Champaign   \n\nThis course is an introduction to the theoretical side of computer science. In it, you will learn how to construct proofs, read and write literate formal mathematics, get a quick introduction to key theory topics and become familiar with a range of standard mathematics concepts commonly used in computer science.\nTextbook Written by the professor. Includes Instructor's Guide.\nAssignments\nExams\n\n",
    "url": "https://courses.engr.illinois.edu/cs173/fa2014/A-lecture/index.html"
  },
  {
    "name": "Textbook Written by the professor. Includes Instructor's Guide.",
    "url": "http://web.engr.illinois.edu/%7Emfleck/building-blocks/"
  },
  {
    "name": "Assignments",
    "url": "https://courses.engr.illinois.edu/cs173/fa2014/A-lecture/Homework/index.html"
  },
  {
    "name": "Exams",
    "url": "https://courses.engr.illinois.edu/cs173/fa2014/A-lecture/Exams/index.html"
  },
  {
    "name": "CS 276 Foundations of Cryptography UC Berkeley \n\nThis course discusses the complexity-theory foundations of modern cryptography, and looks at recent results in the field such as Fully Homomorphic Encryption, Indistinguishability Obfuscation, MPC and so on.\n\n",
    "url": "http://www.cs.berkeley.edu/%7Esanjamg/classes/cs276-fall14/"
  },
  {
    "name": "CS 278 Complexity Theory UC Berkeley \n\nA graduate level course on complexity theory that introduces P vs NP, the power of randomness, average-case complexity, hardness of approximation, and so on.\n\n",
    "url": "http://www.cs.berkeley.edu/%7Eluca/cs278-08/"
  },
  {
    "name": "CS 374 Algorithms & Models of Computation (Fall 2014) University of Illinois Urbana-Champaign   \n\nCS 498 section 374 (unofficially \"CS 374\") covers fundamental tools and techniques from theoretical computer science, including design and analysis of algorithms, formal languages and automata, computability, and complexity. Specific topics include regular and context-free languages, finite-state automata, recursive algorithms (including divide and conquer, backtracking, dynamic programming, and greedy algorithms), fundamental graph algorithms (including depth- and breadth-first search, topological sorting, minimum spanning trees, and shortest paths), undecidability, and NP-completeness. The course also has a strong focus on clear technical communication.\nAssignments/Exams\nLecture Notes/Labs\nLecture videos\n\n",
    "url": "https://courses.engr.illinois.edu/cs498374/fa2014/"
  },
  {
    "name": "Assignments/Exams",
    "url": "https://courses.engr.illinois.edu/cs498374/fa2014/work.html"
  },
  {
    "name": "Lecture Notes/Labs",
    "url": "https://courses.engr.illinois.edu/cs498374/fa2014/lectures.html"
  },
  {
    "name": "Lecture videos",
    "url": "http://recordings.engineering.illinois.edu/ess/portal/section/115f3def-7371-4e98-b72f-6efe53771b2a"
  },
  {
    "name": "CS 3110 Data Structures and Functional Programming Cornell University  \n\nCS 3110 (formerly CS 312) is the third programming course in the Computer Science curriculum, following CS 1110/1112 and CS 2110. The goal of the course is to help students become excellent programmers and software designers who can design and implement software that is elegant, efficient, and correct, and whose code can be maintained and reused.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS3110/2014fa/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS3110/2014fa/course_info.php"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS3110/2014fa/lecture_notes.php"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS3110/2014fa/index.php"
  },
  {
    "name": "CS 3220 Introduction to Scientific Computing Cornell University  \n\nIn this one-semester survey course, we introduce numerical methods for solving linear and nonlinear equations, interpolating data, computing integrals, and solving differential equations, and we describe how to use these tools wisely (we hope!) when solving scientific problems.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/%7Ebindel/class/cs3220-s12/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/%7Ebindel/class/cs3220-s12/syllabus.html"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/%7Ebindel/class/cs3220-s12/lectures.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/%7Ebindel/class/cs3220-s12/assignments.html"
  },
  {
    "name": "CS 4300 Information Retrieval Cornell University  \n\nStudies the methods used to search for and discover information in large-scale systems. The emphasis is on information retrieval applied to textual materials, but there is some discussion of other formats.The course includes techniques for searching, browsing, and filtering information and the use of classification systems and thesauruses. The techniques are illustrated with examples from web searching and digital libraries.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS4300/2013fa/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS4300/2013fa/lectures/introduction.pdf"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS4300/2013fa/lectures.htm"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS4300/2013fa/lectures.htm"
  },
  {
    "name": "CS 4810 Introduction to Theory of Computing Cornell University   \n\nThis undergraduate course provides a broad introduction to the mathematical foundations of computer science. We will examine basic computational models, especially Turing machines. The goal is to understand what problems can or cannot be solved in these models.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/%7Edsteurer/toc13/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/%7Edsteurer/toc13/syllabus/"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/%7Edsteurer/toc13/lectures/"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/%7Edsteurer/toc13/homework/"
  },
  {
    "name": "CS 6810 Theory of Computing Cornell University   \n\nThis graduate course gives a broad introduction to complexity theory, including classical results and recent developments. Complexity theory aims to understand the power of efficient computation (when computational resources like time and space are limited). Many compelling conceptual questions arise in this context. Most of these questions are (surprisingly?) difficult and far from being resolved. Nevertheless, a lot of progress has been made toward understanding them (and also why they are difficult). We will learn about these advances in this course. A theme will be combinatorial constructions with random-like properties, e.g., expander graphs and error-correcting codes. Some examples:\n\nIs finding a solution inherently more difficult than verifying it?\nDo more computational resources mean more computing power?\nIs it easier to find approximate solutions than exact ones?\nAre randomized algorithms more powerful than deterministic ones?\nIs it easier to solve problems in the average case than in the worst case?\nAre quantum computers more powerful than classical ones?\n\n\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/%7Edsteurer/complexity12/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/%7Edsteurer/complexity12/"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/%7Edsteurer/complexity12/#lectures"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/%7Edsteurer/complexity12/#homework"
  },
  {
    "name": "CSCE 3193 Programming Paradigms University of Arkansas (Fayetteville)\t \n\nProgramming in different paradigms with emphasis on object oriented programming, network programming and functional programming. Survey of programming languages, event driven programming, concurrency, software validation.\nSyllabus\nNotes\nAssignments\nPractice Exams\n\n",
    "url": "http://www.csce.uark.edu/%7Esgauch/3193/S11/index.html"
  },
  {
    "name": "Syllabus",
    "url": "http://www.csce.uark.edu/%7Esgauch/3193/S11/syllabus.html"
  },
  {
    "name": "Notes",
    "url": "http://www.csce.uark.edu/%7Esgauch/3193/S11/notes/index.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.csce.uark.edu/%7Esgauch/3193/S11/hw/index.html"
  },
  {
    "name": "Practice Exams",
    "url": "http://www.csce.uark.edu/%7Esgauch/3193/S11/exams/index.html"
  },
  {
    "name": "6.045 Great Ideas in Theoretical Computer Science MIT   \n\nThis course provides a challenging introduction to some of the central ideas of theoretical computer science. Beginning in antiquity, the course will progress through finite automata, circuits and decision trees, Turing machines and computability, efficient algorithms and reducibility, the P versus NP problem, NP-completeness, the power of randomness, cryptography and one-way functions, computational learning theory, and quantum computing. It examines the classes of problems that can and cannot be solved by various kinds of machines. It tries to explain the key differences between computational models that affect their power.\nSyllabus\nLecture Notes\nLecture Videos\n\n",
    "url": "https://stellar.mit.edu/S/course/6/sp15/6.045/index.html"
  },
  {
    "name": "Syllabus",
    "url": "https://stellar.mit.edu/S/course/6/sp15/6.045/courseMaterial/topics/topic1/syllabus/syllabus2015/syllabus2015.pdf"
  },
  {
    "name": "Lecture Notes",
    "url": "https://stellar.mit.edu/S/course/6/sp15/6.045/materials.html"
  },
  {
    "name": "Lecture Videos",
    "url": "http://stellar.mit.edu/S/course/6/sp15/6.045/special/videos/index.html"
  },
  {
    "name": "CS 10 The Beauty and Joy of Computing UC Berkeley   \n\nCS10 is UCB's introductory computer science class, taught using the beginners' drag-and-drop language. Students learn about history, social implications, great principles, and future of computing. They also learn the joy of programming a computer using a friendly, graphical language, and will complete a substantial team programming project related to their interests.\nSnap*!* (based on Scratch by MIT).\nCurriculum\n\n",
    "url": "https://inst.eecs.berkeley.edu/%7Ecs10/fa14/"
  },
  {
    "name": "Snap*!* (based on Scratch by MIT).",
    "url": "http://snap.berkeley.edu"
  },
  {
    "name": "Curriculum",
    "url": "http://bjc.berkeley.edu"
  },
  {
    "name": "CS 50 Introduction to Computer Science Harvard University   \n\nCS50x is Harvard College's introduction to the intellectual enterprises of computer science and the art of programming for majors and non-majors alike, with or without prior programming experience. An entry-level course taught by David J. Malan.\nLectures\nProblem Sets\nThe course can also be taken from edX.\n\n",
    "url": "https://cs50.harvard.edu/"
  },
  {
    "name": "Lectures",
    "url": "https://cs50.harvard.edu/lectures"
  },
  {
    "name": "Problem Sets",
    "url": "https://cs50.harvard.edu/psets"
  },
  {
    "name": "The course can also be taken from edX.",
    "url": "https://www.edx.org/course/introduction-computer-science-harvardx-cs50x"
  },
  {
    "name": "CS 61A Structure and Interpretation of Computer Programs [Python] UC Berkeley    \n\nIn CS 61A, we are interested in teaching you about programming, not about how to use one particular \tprogramming language. We consider a series of techniques for controlling program complexity, such as functional programming, data abstraction, and object-oriented programming. Mastery of a particular programming language is a very useful side effect of studying these general techniques. However, our hope is that once you have learned the essence of programming, you will find that picking up a new programming language is but a few days' work.\nLecture Resources by Type\nLecture Resources by Topic\nAdditional Resources\nPractice Problems\nExtra Lectures\n\n",
    "url": "http://cs61a.org/"
  },
  {
    "name": "Lecture Resources by Type",
    "url": "http://cs61a.org/by_type.html"
  },
  {
    "name": "Lecture Resources by Topic",
    "url": "http://cs61a.org/by_topic.html"
  },
  {
    "name": "Additional Resources",
    "url": "http://cs61a.org/articles/resources.html"
  },
  {
    "name": "Practice Problems",
    "url": "http://cs61a.org/problems/"
  },
  {
    "name": "Extra Lectures",
    "url": "http://cs61a.org/extra.html"
  },
  {
    "name": "CS 61AS Structure & Interpretation of Computer Programs [Racket] UC Berkeley   \n\nA self-paced version of the CS61 Course but in Racket / Scheme. 61AS is a great introductory course that will ease you into all the amazing concepts that future CS courses will cover, so remember to keep an open mind, have fun, and always respect the data abstraction\nLecture Videos\nAssignments and Notes\n\n",
    "url": "http://berkeley-cs61as.github.io/"
  },
  {
    "name": "Lecture Videos",
    "url": "https://www.youtube.com/course?category=University%2FEngineering%2FComputer%2520Science%2FProgramming%2520Languages&list=EC6D76F0C99A731667"
  },
  {
    "name": "Assignments and Notes",
    "url": "http://berkeley-cs61as.github.io/textbook.html"
  },
  {
    "name": "CS 101 Computer Science 101 Stanford University   \n\nCS101 teaches the essential ideas of Computer Science for a zero-prior-experience audience. Participants play and experiment with short bits of \"computer code\" to bring to life to the power and limitations of computers.\nLectures videos will available for free after registration.\n\n",
    "url": "http://online.stanford.edu/course/computer-science-101-self-paced"
  },
  {
    "name": "CS 106A Programming Methodology Stanford University   \n\nThis course is the largest of the introductory programming courses and is one of the largest courses at Stanford. Topics focus on the introduction to the engineering of computer applications emphasizing modern software engineering principles: object-oriented design, decomposition, encapsulation, abstraction, and testing. Programming Methodology teaches the widely-used Java programming language along with good software engineering principles.\nLecture Videos\nAssignments\nAll materials in a zip file\n\n",
    "url": "https://see.stanford.edu/Course/CS106A"
  },
  {
    "name": "Lecture Videos",
    "url": "http://see.stanford.edu/see/lecturelist.aspx?coll=824a47e1-135f-4508-a5aa-866adcae1111"
  },
  {
    "name": "Assignments",
    "url": "http://see.stanford.edu/see/materials/icspmcs106a/assignments.aspx"
  },
  {
    "name": "All materials in a zip file",
    "url": "http://see.stanford.edu/materials/icspmcs106a/ProgrammingMethodologyAllMaterials.zip"
  },
  {
    "name": "CS 106B Programming Abstractions Stanford University   \n\nThis course is the natural successor to Programming Methodology and covers such advanced programming topics as recursion, algorithmic analysis, and data abstraction using the C++ programming language, which is similar to both C and Java.\nLectures\nAssignments\nAll materials in a zip file\n\n",
    "url": "https://see.stanford.edu/Course/CS106B"
  },
  {
    "name": "Lectures",
    "url": "http://see.stanford.edu/see/lecturelist.aspx?coll=11f4f422-5670-4b4c-889c-008262e09e4e"
  },
  {
    "name": "Assignments",
    "url": "http://see.stanford.edu/see/materials/icspacs106b/assignments.aspx"
  },
  {
    "name": "All materials in a zip file",
    "url": "http://see.stanford.edu/materials/icspacs106b/ProgrammingAbstractionsAllMaterials.zip"
  },
  {
    "name": "CS 107 Programming Paradigms Stanford University   \n\nTopics: Advanced memory management features of C and C++; the differences between imperative and object-oriented paradigms. The functional paradigm (using LISP) and concurrent programming (using C and C++)\nLectures\nAssignments\n\n",
    "url": "https://see.stanford.edu/Course/CS107"
  },
  {
    "name": "Lectures",
    "url": "http://see.stanford.edu/see/lecturelist.aspx?coll=2d712634-2bf1-4b55-9a3a-ca9d470755ee"
  },
  {
    "name": "Assignments",
    "url": "http://see.stanford.edu/see/materials/icsppcs107/assignments.aspx"
  },
  {
    "name": "CS 109 Programming Practice Using Scala KAIST  \n\nThis course introduces basic concepts of programming and computer science, such as dynamic and static typing, dynamic memory allocation, objects and methods, binary representation of numbers, using an editor and compiler from the command line, running programs with arguments from the command line, using libraries, and the use of basic data structures such as arrays, lists, sets, and maps. We will use Scala for this course.\n[Lectures] (http://otfried.org/courses/cs109/index.html)\n[Assignments] (http://otfried.org/courses/cs109/index.html)\n\n",
    "url": "http://otfried.org/courses/cs109/index.html"
  },
  {
    "name": "[Lectures] (http://otfried.org/courses/cs109/index.html)",
    "url": "http://otfried.org/courses/cs109/index.html"
  },
  {
    "name": "[Assignments] (http://otfried.org/courses/cs109/index.html)",
    "url": "http://otfried.org/courses/cs109/index.html"
  },
  {
    "name": "CS 1109 Fundamental Programming Concepts Cornell University  \n\nThis course provides an introduction to programming and problem solving using a high-level programming language. It is designed to increase your knowledge level to comfortably continue to courses CS111x. Our focus will be on generic programming concepts: variables, expressions, control structures, loops, arrays, functions, pseudocode and algorithms. You will learn how to analyze problems and convert your ideas into solutions interpretable by computers. We will use MATLAB; because it provides a productive environment, and it is widely used by all engineering communities.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS1109/2013su/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS1109/2013su/syllabus.html"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS1109/2013su/calendar.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS1109/2013su/calendar.html"
  },
  {
    "name": "CS 1110 Introduction to Computing Using Python Cornell University  \n\nProgramming and problem solving using Python. Emphasizes principles of software development, style, and testing. Topics include procedures and functions, iteration, recursion, arrays and vectors, strings, an operational model of procedure and function calls, algorithms, exceptions, object-oriented programming, and GUIs (graphical user interfaces). Weekly labs provide guided practice on the computer, with staff present to help. Assignments use graphics and GUIs to help develop fluency and understanding.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS1110/2014fa/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS1110/2014fa/about/grading.php"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS1110/2014fa/lectures/index.php"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS1110/2014fa/assignments/index.php"
  },
  {
    "name": "CS 1112 Introduction to Computing Using Matlab Cornell University  \n\nProgramming and problem solving using MATLAB. Emphasizes the systematic development of algorithms and programs. Topics include iteration, functions, arrays and vectors, strings, recursion, algorithms, object-oriented programming, and MATLAB graphics. Assignments are designed to build an appreciation for complexity, dimension, fuzzy data, inexact arithmetic, randomness, simulation, and the role of approximation. NO programming experience is necessary; some knowledge of Calculus is required.\nSyllabus\nLectures\nAssignments\nProjects\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS1112/2014fa/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS1112/2014fa/syllabus.html"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS1112/2014fa/syllabus.html#schedule"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS1112/2014fa/Exercises/exercises.html"
  },
  {
    "name": "Projects",
    "url": "http://www.cs.cornell.edu/courses/CS1112/2014fa/Projects/projects.html"
  },
  {
    "name": "CS 1115 Introduction to Computational Science and Engineering Using Matlab Graphical User Interfaces Cornell University  \n\nProgramming and problem solving using MATLAB. Emphasizes the systematic development of algorithms and programs. Topics include iteration, functions, arrays and vectors, strings, recursion, algorithms, object-oriented programming, and MATLAB graphics. Assignments are designed to build an appreciation for complexity, dimension, fuzzy data, inexact arithmetic, randomness, simulation, and the role of approximation. NO programming experience is necessary; some knowledge of Calculus is required.\nSyllabus\nLectures\nProjects\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS1115/2013fa/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS1115/2013fa/syllabus.htm"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS1115/2013fa/lecture_slides.htm"
  },
  {
    "name": "Projects",
    "url": "http://www.cs.cornell.edu/courses/CS1115/2013fa/projects_and_exams.htm"
  },
  {
    "name": "CS 1130 Transition to OO Programming Cornell University  \n\nIntroduction to object-oriented concepts using Java. Assumes programming knowledge in a language like MATLAB, C, C++, or Fortran. Students who have learned Java but were not exposed heavily to OO programming are welcome.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS1130/2014sp/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS1130/2014sp/about/overview.php"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS1130/2014sp/web-lectures/index.php"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS1130/2014sp/assignments/index.php"
  },
  {
    "name": "CS 1133 Transition to Python Cornell University  \n\nIntroduction to the Python programming language. Covers the basic programming constructs of Python, including assignment, conditionals, iteration, functions, object-oriented design, arrays, and vectorized computation. Assumes programming knowledge in a language like Java, Matlab, C, C++, or Fortran.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS1133/2013fa/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS1133/2013fa/about/overview.php"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS1133/2013fa/lectures/index.php"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS1133/2013fa/assignments/index.php"
  },
  {
    "name": "CS 1410-2 and CS2420-20 Computer Science I and II for Hackers University of Utah   \n\nAn intro course in the spirit of SICP designed by Professor Matthew Flatt (one of the lead designers of Racket and author of HtDP). Mostly Racket and C, and a bit of Java, with explanations on how high level functional programming concepts relate to the design of OOP programs. Do this one before SICP if SICP is a bit too much...\nLectures and Assignments 1\nLectures and Assignments 2\nTextbook\nRacket Language\n\n",
    "url": "http://www.eng.utah.edu/%7Ecs1410-20/"
  },
  {
    "name": "An intro course in the spirit of SICP designed by Professor Matthew Flatt (one of the lead designers of Racket and author of HtDP). Mostly Racket and C, and a bit of Java, with explanations on how high level functional programming concepts relate to the design of OOP programs. Do this one before SICP if SICP is a bit too much...",
    "url": "http://www.cs.utah.edu/%7Emflatt/"
  },
  {
    "name": "Lectures and Assignments 1",
    "url": "http://www.eng.utah.edu/%7Ecs1410-20/schedule.html"
  },
  {
    "name": "Lectures and Assignments 2",
    "url": "http://www.eng.utah.edu/%7Ecs2420-20/schedule.html"
  },
  {
    "name": "Textbook",
    "url": "http://htdp.org/2003-09-26/Book/curriculum.html"
  },
  {
    "name": "Racket Language",
    "url": "http://racket-lang.org/"
  },
  {
    "name": "CS 2110 Object-Oriented Programming and Data Structures Cornell University  \n\nCS 2110 is an intermediate-level programming course and an introduction to computer science. Topics include program design and development, debugging and testing, object-oriented programming, proofs of correctness, complexity analysis, recursion, commonly used data structures, graph algorithms, and abstract data types. Java is the principal programming language. The course syllabus can easily be extracted by looking at the link to lectures.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS2110/2014fa/index.html"
  },
  {
    "name": "CS 2110 is an intermediate-level programming course and an introduction to computer science. Topics include program design and development, debugging and testing, object-oriented programming, proofs of correctness, complexity analysis, recursion, commonly used data structures, graph algorithms, and abstract data types. Java is the principal programming language. The course syllabus can easily be extracted by looking at the link to lectures.",
    "url": "http://www.cs.cornell.edu/courses/CS2110/2014fa/lecturenotes.html"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS2110/2014fa/lecturenotes.html"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS2110/2014fa/lecturenotes.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS2110/2014fa/assignments.html"
  },
  {
    "name": "CS 4302 Web Information Systems Cornell University  \n\nThis course will introduce you to technologies for building data-centric information systems on the World Wide Web, show the practical applications of such systems, and discuss their design and their social and policy context by examining cross-cutting issues such as citizen science, data journalism and open government. Course work involves lectures and readings as well as weekly homework assignments, and a semester-long project in which the students demonstrate their expertise in building data-centric Web information systems.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://courses2.cit.cornell.edu/info4302_2012fa/"
  },
  {
    "name": "Syllabus",
    "url": "http://courses2.cit.cornell.edu/info4302_2012fa/course_information.php"
  },
  {
    "name": "Lectures",
    "url": "http://courses2.cit.cornell.edu/info4302_2012fa/lectures.php"
  },
  {
    "name": "Assignments",
    "url": "http://courses2.cit.cornell.edu/info4302_2012fa/homeworks.php"
  },
  {
    "name": "CSCE 2004 Programming Foundations I University of Arkansas (Fayetteville)  \n\nIntroductory course for students majoring in computer science or computer engineering. Software development process: problem specification, program design, implementation, testing and documentation. Programming topics: data representation, conditional and iterative statements, functions, arrays, strings, file I/O, and classes. Using C++ in a UNIX environment.\nSyllabus\nNotes\nAssignments\nPractice Exams\n\n",
    "url": "http://www.csce.uark.edu/%7Esgauch/2004/S14/index.html"
  },
  {
    "name": "Syllabus",
    "url": "http://www.csce.uark.edu/%7Esgauch/2004/S14/syllabus.html"
  },
  {
    "name": "Notes",
    "url": "http://www.csce.uark.edu/%7Esgauch/2004/S14/notes/index.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.csce.uark.edu/%7Esgauch/2004/S14/hw/index.html"
  },
  {
    "name": "Practice Exams",
    "url": "http://www.csce.uark.edu/%7Esgauch/2004/S14/index.html"
  },
  {
    "name": "CSCI E-1 Understanding Computers and the Internet Harvard University Extension College\n \n\nThis course is all about understanding: understanding what's going on inside your computer when you flip on the switch, why tech support has you constantly rebooting your computer, how everything you do on the Internet can be watched by others, and how your computer can become infected with a worm just by being turned on. Designed for students who use computers and the Internet every day but don't fully understand how it all works, this course fills in the gaps. Through lectures on hardware, software, the Internet, multimedia, security, privacy, website development, programming, and more, this course \"takes the hood off\" of computers and the Internet so that students understand how it all works and why. Through discussions of current events, students are exposed also to the latest technologies.\nLecture Videos\nSyllabus\nNotes / Recaps\nAssignments\n\n",
    "url": "http://cse1.net/lectures"
  },
  {
    "name": "Lecture Videos",
    "url": "http://cse1.net/lectures"
  },
  {
    "name": "Syllabus",
    "url": "http://cse1.net/syllabus"
  },
  {
    "name": "Notes / Recaps",
    "url": "http://cse1.net/recaps"
  },
  {
    "name": "Assignments",
    "url": "http://cse1.net/psets"
  },
  {
    "name": "CS-for-all CS for All  Harvey Mudd College   \n\nThis book (and course) takes a unique approach to â€œIntro CS.â€ In a nutshell, our objective is to provide an introduction to computer science as an intellectually rich and vibrant field rather than focusing exclusively on computer programming. While programming is certainly an important and pervasive element of our approach, we emphasize concepts and problem-solving over syntax and programming language features.\nLectures and Other resources\n\n",
    "url": "http://www.cs.hmc.edu/csforall/"
  },
  {
    "name": "Lectures and Other resources",
    "url": "https://www.cs.hmc.edu/twiki/bin/view/ModularCS1"
  },
  {
    "name": "6.001 Structure and Interpretation of Computer Programs MIT   \n\nTeaches big-picture computing concepts using the Scheme programming language. Students will implement programs in a variety of different programming paradigms (functional, object-oriented, logical). Heavy emphasis on function composition, code-as-data, control abstraction with continuations, and syntactic abstraction through macros. An excellent course if you are looking to build a mental framework on which to hang your programming knowledge.\nLectures\nTextbook (epub, pdf)\nIDE\n\n",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-001-structure-and-interpretation-of-computer-programs-spring-2005/index.htm"
  },
  {
    "name": "Lectures",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-001-structure-and-interpretation-of-computer-programs-spring-2005/video-lectures"
  },
  {
    "name": "Textbook (epub, pdf)",
    "url": "http://mitpress.mit.edu/sicp/full-text/book/book.html"
  },
  {
    "name": "IDE",
    "url": "http://www.neilvandyke.org/racket-sicp/"
  },
  {
    "name": "6.005 Software Construction, Fall 2016 MIT  \n\nThis course introduces fundamental principles and techniques of software development. Students learn how to write software that is safe from bugs, easy to understand, and ready for change. Topics include specifications and invariants; testing, test-case generation, and coverage; state machines; abstract data types and representation independence; design patterns for object-oriented programming; concurrent programming, including message passing and shared concurrency, and defending against races and deadlock; and functional programming with immutable data and higher-order functions.\nLectures Notes/Assignments\n\n",
    "url": "http://web.mit.edu/6.005/www/fa16/"
  },
  {
    "name": "Lectures Notes/Assignments",
    "url": "http://web.mit.edu/6.005/www/fa16/"
  },
  {
    "name": "DEEPNLP Deep Learning for Natural Language Processing University of Oxford  \n\nThis is an applied course focussing on recent advances in analysing and generating speech and text using recurrent neural networks. We introduce the mathematical definitions of the relevant machine learning models and derive their associated optimisation algorithms. The course covers a range of applications of neural networks in NLP including analysing latent dimensions in text, transcribing speech to text, translating between languages, and answering questions. This course is organised by Phil Blunsom and delivered in partnership with the DeepMind Natural Language Research Group.\nLectures\nAssignments are available on the organisation page titled as \"practicals\"\n\n",
    "url": "https://github.com/oxford-cs-deepnlp-2017/"
  },
  {
    "name": "Lectures",
    "url": "https://github.com/oxford-cs-deepnlp-2017/lectures"
  },
  {
    "name": "CS20si Tensorflow for Deep Learning Research Stanford University  \n\nThis course will cover the fundamentals and contemporary usage of the Tensorflow library for deep learning research. We aim to help students understand the graphical computational model of Tensorflow, explore the functions it has to offer, and learn how to build and structure models best suited for a deep learning project. Through the course, students will use Tensorflow to build models of different complexity, from simple linear/logistic regression to convolutional neural network and recurrent neural networks with LSTM to solve tasks such as word embeddings, translation, optical character recognition. Students will also learn best practices to structure a model and manage research experiments.\nAssignments available on Github.\n\n",
    "url": "http://web.stanford.edu/class/cs20si/index.html"
  },
  {
    "name": "Assignments available on Github.",
    "url": "https://github.com/chiphuyen/tf-stanford-tutorials"
  },
  {
    "name": "COMS 4771 Machine Learning Columbia University  \n\nCourse taught by Tony Jebara introduces topics in Machine Learning for both generative and discriminative estimation. Material will include least squares methods, Gaussian distributions, linear classification, linear regression, maximum likelihood, exponential family distributions, Bayesian networks, Bayesian inference, mixture models, the EM algorithm, graphical models, hidden Markov models, support vector machines, and kernel methods.\nLectures and Assignments\n\n",
    "url": "http://www.cs.columbia.edu/%7Ejebara/4771/index.html"
  },
  {
    "name": "Course taught by Tony Jebara introduces topics in Machine Learning for both generative and discriminative estimation. Material will include least squares methods, Gaussian distributions, linear classification, linear regression, maximum likelihood, exponential family distributions, Bayesian networks, Bayesian inference, mixture models, the EM algorithm, graphical models, hidden Markov models, support vector machines, and kernel methods.",
    "url": "http://www.cs.columbia.edu/%7Ejebara/resume.html"
  },
  {
    "name": "Lectures and Assignments",
    "url": "http://www.cs.columbia.edu/%7Ejebara/4771/handouts.html"
  },
  {
    "name": "CS 109 Data Science Harvard University   \n\nLearning from data in order to gain useful predictions and insights. This course introduces methods for five key facets of an investigation: data wrangling, cleaning, and sampling to get a suitable data set; data management to be able to access big data quickly and reliably; exploratory data analysis to generate hypotheses and intuition; prediction based on statistical methods such as regression and classification; and communication of results through visualization, stories, and interpretable summaries.\nLectures\nSlides\nLabs and Assignments\n2014 Lectures\n2013 Lectures (slightly better)\n\n",
    "url": "http://cs109.github.io/2015/"
  },
  {
    "name": "Lectures",
    "url": "http://cm.dce.harvard.edu/2015/01/14328/publicationListing.shtml"
  },
  {
    "name": "Slides",
    "url": "http://cs109.github.io/2014/pages/schedule.html"
  },
  {
    "name": "Labs and Assignments",
    "url": "http://cs109.github.io/2014/pages/homework.html"
  },
  {
    "name": "2014 Lectures",
    "url": "http://cs109.github.io/2014/"
  },
  {
    "name": "2013 Lectures (slightly better)",
    "url": "http://cm.dce.harvard.edu/2014/01/14328/publicationListing.shtml"
  },
  {
    "name": "CS 156 Learning from Data Caltech   \n\nThis is an introductory course in machine learning (ML) that covers the basic theory, algorithms, and applications. ML is a key technology in Big Data, and in many financial, medical, commercial, and scientific applications. It enables computational systems to adaptively improve their performance with experience accumulated from the observed data. ML has become one of the hottest fields of study today, taken up by undergraduate and graduate students from 15 different majors at Caltech. This course balances theory and practice, and covers the mathematical as well as the heuristic aspects.\nLectures\nHomework\nTextbook\n\n",
    "url": "https://work.caltech.edu/telecourse.html"
  },
  {
    "name": "Lectures",
    "url": "https://work.caltech.edu/lectures.html"
  },
  {
    "name": "Homework",
    "url": "https://work.caltech.edu/homeworks.html"
  },
  {
    "name": "Textbook",
    "url": "https://work.caltech.edu/textbook.html"
  },
  {
    "name": "CS 189 Introduction To Machine Learning UC Berkeley  \n\nIntroductory ML course covering a wide range of topics: ranging from least squares to convolutional neural networks\nNotes\nHomework\n\n",
    "url": "http://www.eecs189.org/"
  },
  {
    "name": "Notes",
    "url": "http://www.eecs189.org/"
  },
  {
    "name": "Homework",
    "url": "http://www.eecs189.org/"
  },
  {
    "name": "CS 224d Deep Learning for Natural Language Processing Stanford University   \n\nNatural language processing (NLP) is one of the most important technologies of the information age. Understanding complex language utterances is also a crucial part of artificial intelligence. Applications of NLP are everywhere because people communicate most everything in language: web search, advertisement, emails, customer service, language translation, radiology reports, etc. There are a large variety of underlying tasks and machine learning models powering NLP applications. Recently, deep learning approaches have obtained very high performance across many different NLP tasks. These models can often be trained with a single end-to-end model and do not require traditional, task-specific feature engineering. In this spring quarter course students will learn to implement, train, debug, visualize and invent their own neural network models. The course provides a deep excursion into cutting-edge research in deep learning applied to NLP.\nSyllabus\nLectures and Assignments\n\n",
    "url": "http://cs224d.stanford.edu/"
  },
  {
    "name": "Syllabus",
    "url": "http://cs224d.stanford.edu/syllabus.html"
  },
  {
    "name": "Lectures and Assignments",
    "url": "http://cs224d.stanford.edu/syllabus.html"
  },
  {
    "name": "CS 229r Algorithms for Big Data Harvard University   \n\nBig data is data so large that it does not fit in the main memory of a single machine, and the need to process big data by efficient algorithms arises in Internet search, network traffic monitoring, machine learning, scientific computing, signal processing, and several other areas. This course will cover mathematically rigorous models for developing such algorithms, as well as some provable limitations of algorithms operating in those models.\nLectures (Youtube)\nAssignments\n\n",
    "url": "http://people.seas.harvard.edu/%7Eminilek/cs229r/fall15/index.html"
  },
  {
    "name": "Lectures (Youtube)",
    "url": "http://people.seas.harvard.edu/%7Eminilek/cs229r/fall15/lec.html"
  },
  {
    "name": "Assignments",
    "url": "http://people.seas.harvard.edu/%7Eminilek/cs229r/fall15/hmwk.html"
  },
  {
    "name": "CS 231n Convolutional Neural Networks for Visual Recognition Stanford University   \n\nComputer Vision has become ubiquitous in our society, with applications in search, image understanding, apps, mapping, medicine, drones, and self-driving cars. This course is a deep dive into details of the deep learning architectures with a focus on learning end-to-end models for these tasks, particularly image classification. During the 10-week course, students will learn to implement, train and debug their own neural networks and gain a detailed understanding of cutting-edge research in computer vision.\nLecture Notes\nLecture Videos\nGithub Page\n\n",
    "url": "http://cs231n.stanford.edu/"
  },
  {
    "name": "Lecture Notes",
    "url": "http://cs231n.stanford.edu/syllabus.html"
  },
  {
    "name": "Lecture Videos",
    "url": "https://www.youtube.com/watch?v=NfnWJUyUJYU&list=PLkt2uSq6rBVctENoVBg1TpCC7OQi31AlC"
  },
  {
    "name": "Github Page",
    "url": "http://cs231n.github.io/"
  },
  {
    "name": "CS 287 Advanced Robotics UC Berkeley  \n\nThe course introduces the math and algorithms underneath state-of-the-art robotic systems. The majority of these techniques are heavily based on probabilistic reasoning and optimization---two areas with wide applicability in modern Artificial Intelligence. An intended side-effect of the course is to generally strengthen your expertise in these two areas.\nLectures Notes\nAssignments\n\n",
    "url": "http://www.cs.berkeley.edu/%7Epabbeel/cs287-fa13/"
  },
  {
    "name": "Lectures Notes",
    "url": "http://www.cs.berkeley.edu/%7Epabbeel/cs287-fa13/#syllabus"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.berkeley.edu/%7Epabbeel/cs287-fa13/#assignments"
  },
  {
    "name": "CS 395T Statistical and Discrete Methods for Scientific Computing University of Texas   \n\nPractical course in applying modern statistical techniques to real data, particularly bioinformatic data and large data sets. The emphasis is on efficient computation and concise coding, mostly in MATLAB and C++.\nTopics covered include probability theory and Bayesian inference; univariate distributions; Central Limit Theorem; generation of random deviates; tail (p-value) tests; multiple hypothesis correction; empirical distributions; model fitting; error estimation; contingency tables; multivariate normal distributions; phylogenetic clustering; Gaussian mixture models; EM methods; maximum likelihood estimation; Markov Chain Monte Carlo; principal component analysis; dynamic programming; hidden Markov models; performance measures for classifiers; support vector machines; Wiener filtering; wavelets; multidimensional interpolation; information theory.\nLectures and Assignments\n\n",
    "url": "http://www.nr.com/CS395T/"
  },
  {
    "name": "Lectures and Assignments",
    "url": "http://granite.ices.utexas.edu/coursewiki/index.php/Main_Page"
  },
  {
    "name": "CS 4780 Machine Learning Cornell University \n\nThis course will introduce you to technologies for building data-centric information systems on the World Wide Web, show the practical applications of such systems, and discuss their design and their social and policy context by examining cross-cutting issues such as citizen science, data journalism and open government. Course work involves lectures and readings as well as weekly homework assignments, and a semester-long project in which the students demonstrate their expertise in building data-centric Web information systems.\nSyllabus\nLectures\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS4780/2014fa/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS4780/2014fa/"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS4780/2014fa/"
  },
  {
    "name": "CS 4786 Machine Learning for Data Science Cornell University   \n\nAn introductory course in machine learning, with a focus on data modeling and related methods and learning algorithms for data sciences. Tentative topic list:\n\nDimensionality reduction, such as principal component analysis (PCA) and the singular value decomposition (SVD), canonical correlation analysis (CCA), independent component analysis (ICA), compressed sensing, random projection, the information bottleneck. (We expect to cover some, but probably not all, of these topics).\nClustering, such as k-means, Gaussian mixture models, the expectation-maximization (EM) algorithm, link-based clustering. (We do not expect to cover hierarchical or spectral clustering.).\nProbabilistic-modeling topics such as graphical models, latent-variable models, inference (e.g., belief propagation), parameter learning.\nRegression will be covered if time permits.\n\n\nAssignments\nLectures\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS4786/2015sp/index.htm"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS4786/2015sp/assignments.htm"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS4786/2015sp/lectures.htm"
  },
  {
    "name": "CVX 101 Convex Optimization Stanford University   \n\nThe course concentrates on recognizing and solving convex optimization problems that arise in applications.  Topics addressed include the following.  Convex sets, functions, and optimization problems.  Basics of convex analysis.  Least-squares, linear and quadratic programs, semidefinite programming, minimax, extremal volume, and other problems.  Optimality conditions, duality theory, theorems of alternative, and applications.  Interior-point methods.  Applications to signal processing, statistics and machine learning, control and mechanical engineering, digital and analog circuit design, and finance.\nTextbook\nLectures and Assignments\n\n",
    "url": "https://class.stanford.edu/courses/Engineering/CVX101/Winter2014/info"
  },
  {
    "name": "Textbook",
    "url": "http://web.stanford.edu/%7Eboyd/cvxbook/"
  },
  {
    "name": "Lectures and Assignments",
    "url": "https://class.stanford.edu/courses/Engineering/CVX101/Winter2014/courseware/7206c57866504e83821d00b5d3f80793/"
  },
  {
    "name": "DS-GA 1008 Deep Learning New York University   \n\nThis increasingly popular course is taught through the Data Science Center at NYU. Originally introduced by Yann Lecun, it is now led by Zaid Harchaoui, although Prof. Lecun is rumored to still stop by from time to time. It covers the theory, technique, and tricks that are used to achieve very high accuracy for machine learning tasks in computer vision and natural language processing. The assignments are in Lua and hosted on Kaggle.\nCourse Page\nRecorded Lectures\n\n",
    "url": "http://cilvr.cs.nyu.edu/doku.php?id=deeplearning2015:schedule"
  },
  {
    "name": "This increasingly popular course is taught through the Data Science Center at NYU. Originally introduced by Yann Lecun, it is now led by Zaid Harchaoui, although Prof. Lecun is rumored to still stop by from time to time. It covers the theory, technique, and tricks that are used to achieve very high accuracy for machine learning tasks in computer vision and natural language processing. The assignments are in Lua and hosted on Kaggle.",
    "url": "http://yann.lecun.com/"
  },
  {
    "name": "Course Page",
    "url": "http://cilvr.cs.nyu.edu/doku.php?id=deeplearning2015:schedule"
  },
  {
    "name": "Recorded Lectures",
    "url": "http://techtalks.tv/deep-learning-nyu-spring-2015/"
  },
  {
    "name": "EECS E6893 & EECS E6895 Big Data Analytics & Advanced Big Data Analytics Columbia University   \n\nStudents will gain knowledge on analyzing Big Data. It serves as an introductory course for graduate students who are expecting to face Big Data storage, processing, analysis, visualization, and application issues on both workplaces and research environments.\nTaught by Dr. Ching-Yung Lin\nCourse Site\nAssignments",
    "url": "http://www.ee.columbia.edu/%7Ecylin/course/bigdata/",
    "description": "Assignments are present in the Course Slides"
  },
  {
    "name": "Taught by Dr. Ching-Yung Lin",
    "url": "http://researcher.watson.ibm.com/researcher/view.php?person=us-chingyung"
  },
  {
    "name": "Course Site",
    "url": "http://www.ee.columbia.edu/%7Ecylin/course/bigdata/"
  },
  {
    "name": "EECS E6894 Deep Learning for Computer Vision and Natural Language Processing Columbia University    \n\nThis graduate level research class focuses on deep learning techniques for vision and natural language processing problems. It gives an overview of the various deep learning models and techniques, and surveys recent advances in the related fields. This course uses Theano as the main programming tool. GPU programming experiences are preferred although not required. Frequent paper presentations and a heavy programming workload are expected.\nReadings\nAssignments\nLecture Notes\n\n",
    "url": "http://llcao.net/cu-deeplearning15/index.html"
  },
  {
    "name": "Readings",
    "url": "http://llcao.net/cu-deeplearning15/reading.html"
  },
  {
    "name": "Assignments",
    "url": "http://llcao.net/cu-deeplearning15/programming_problem.html"
  },
  {
    "name": "Lecture Notes",
    "url": "http://llcao.net/cu-deeplearning15/index.html"
  },
  {
    "name": "EE103 Introduction to Matrix Methods Stanford University   \n\nThe course covers the basics of matrices and vectors, solving linear equations, least-squares methods, and many applications. It'll cover the mathematics, but the focus will be on using matrix methods in applications such as tomography, image processing, data fitting, time series prediction, finance, and many others. EE103 is based on a book that Stephen Boyd and Lieven Vandenberghe are currently writing. Students will use a new language called Julia to do computations with matrices and vectors.\nLectures\nBook\nAssignments\nCode\n\n",
    "url": "http://stanford.edu/class/ee103/"
  },
  {
    "name": "The course covers the basics of matrices and vectors, solving linear equations, least-squares methods, and many applications. It'll cover the mathematics, but the focus will be on using matrix methods in applications such as tomography, image processing, data fitting, time series prediction, finance, and many others. EE103 is based on a book that Stephen Boyd and Lieven Vandenberghe are currently writing. Students will use a new language called Julia to do computations with matrices and vectors.",
    "url": "http://stanford.edu/%7Eboyd/"
  },
  {
    "name": "Lectures",
    "url": "http://stanford.edu/class/ee103/lectures.html"
  },
  {
    "name": "Book",
    "url": "http://stanford.edu/class/ee103/mma.html"
  },
  {
    "name": "Assignments",
    "url": "http://stanford.edu/class/ee103/homework.html"
  },
  {
    "name": "Code",
    "url": "http://stanford.edu/class/ee103/julia_files"
  },
  {
    "name": "Info 290 Analyzing Big Data with Twitter UC Berkeley school of information \n\nIn this course, UC Berkeley professors and Twitter engineers provide lectures on the most cutting-edge algorithms and software tools for data analytics as applied to Twitter's data. Topics include applied natural language processing algorithms such as sentiment analysis, large scale anomaly detection, real-time search, information diffusion and outbreak detection, trend detection in social streams, recommendation algorithms, and advanced frameworks for distributed computing.\nLecture Videos\nPrevious Years coursepage\n\n",
    "url": "http://www.ischool.berkeley.edu/courses/i290-abdt"
  },
  {
    "name": "Lecture Videos",
    "url": "http://www.ischool.berkeley.edu/newsandevents/audiovideo/webcast/21963"
  },
  {
    "name": "Previous Years coursepage",
    "url": "http://blogs.ischool.berkeley.edu/i290-abdt-s12/"
  },
  {
    "name": "Machine Learning: 2014-2015 University of Oxford   \n\nThe course focusses on neural networks and uses the Torch deep learning library (implemented in Lua) for exercises and assignments. Topics include: logistic regression, back-propagation, convolutional neural networks, max-margin learning, siamese networks, recurrent neural networks, LSTMs, hand-writing with recurrent neural networks, variational autoencoders and image generation and reinforcement learning\nLectures and Assignments\nSource code\n\n",
    "url": "https://www.cs.ox.ac.uk/people/nando.defreitas/machinelearning/"
  },
  {
    "name": "The course focusses on neural networks and uses the Torch deep learning library (implemented in Lua) for exercises and assignments. Topics include: logistic regression, back-propagation, convolutional neural networks, max-margin learning, siamese networks, recurrent neural networks, LSTMs, hand-writing with recurrent neural networks, variational autoencoders and image generation and reinforcement learning",
    "url": "https://github.com/torch/torch7/wiki/Cheatsheet"
  },
  {
    "name": "Lectures and Assignments",
    "url": "https://www.cs.ox.ac.uk/people/nando.defreitas/machinelearning/"
  },
  {
    "name": "Source code",
    "url": "https://github.com/oxford-cs-ml-2015/"
  },
  {
    "name": "StatLearning Intro to Statistical Learning Stanford University    \n\nThis is an introductory-level course in supervised learning, with a focus on regression and classification methods. The syllabus includes: linear and polynomial regression, logistic regression and linear discriminant analysis; cross-validation and the bootstrap, model selection and regularization methods (ridge and lasso); nonlinear models, splines and generalized additive models; tree-based methods, random forests and boosting; support-vector machines.\nThe lectures cover all the material in An Introduction to Statistical Learning, with Applications in R which is a more approachable version of the Elements of Statistical Learning (or ESL) book.\n\n",
    "url": "https://lagunita.stanford.edu/courses/HumanitiesandScience/StatLearning/Winter2015/about"
  },
  {
    "name": "The lectures cover all the material in An Introduction to Statistical Learning, with Applications in R which is a more approachable version of the Elements of Statistical Learning (or ESL) book.",
    "url": "http://www-bcf.usc.edu/%7Egareth/ISL/"
  },
  {
    "name": "10-601 Machine Learning Carnegie Mellon University    \n\nThis course covers the theory and practical algorithms for machine learning from a variety of perspectives. It covers topics such as Bayesian networks, decision tree learning, Support Vector Machines, statistical learning methods, unsupervised learning and reinforcement learning. The course covers theoretical concepts such as inductive bias, the PAC learning framework, Bayesian learning methods, margin-based learning, and Occam's Razor. Short programming assignments include hands-on experiments with various learning algorithms. This course is designed to give a graduate-level student a thorough grounding in the methodologies, technologies, mathematics and algorithms currently needed by people who do research in machine learning.\nTaught by one of the leading experts on Machine Learning",
    "url": "http://www.cs.cmu.edu/%7Eninamf/courses/601sp15/",
    "description": "Tom Mitchell"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cmu.edu/%7Etom/10701_sp11/lectures.shtml"
  },
  {
    "name": "Project Ideas and Datasets",
    "url": "http://www.cs.cmu.edu/%7Etom/10701_sp11/proj.shtml"
  },
  {
    "name": "10-708 Probabilistic Graphical Models Carnegie Mellon University    \n\nMany of the problems in artificial intelligence, statistics, computer systems, computer vision, natural language processing, and computational biology, among many other fields, can be viewed as the search for a coherent global conclusion from local information. The probabilistic graphical models framework provides a unified view for this wide range of problems, enabling efficient inference, decision-making and learning in problems with a very large number of attributes and huge datasets. This graduate-level course will provide you with a strong foundation for both applying graphical models to complex problems and for addressing core research topics in graphical models.\nLecture Videos\nAssignments\nLecture notes\nReadings\n\n",
    "url": "http://www.cs.cmu.edu/%7Eepxing/Class/10708-14/index.html"
  },
  {
    "name": "Lecture Videos",
    "url": "http://www.cs.cmu.edu/%7Eepxing/Class/10708-14/lecture.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cmu.edu/%7Eepxing/Class/10708-14/homework.html"
  },
  {
    "name": "Lecture notes",
    "url": "http://www.cs.cmu.edu/%7Eepxing/Class/10708-14/lecture.html"
  },
  {
    "name": "Readings",
    "url": "http://www.cs.cmu.edu/%7Eepxing/Class/10708-14/lecture.html"
  },
  {
    "name": "11-785 Deep Learning Carnegie Mellon University  \n\nThe course presents the subject through a series of seminars and labs, which will explore it from its early beginnings, and work themselves to some of the state of the art. The seminars will cover the basics of deep learning and the underlying theory, as well as the breadth of application areas to which it has been applied, as well as the latest issues on learning from very large amounts of data. We will concentrate largely, although not entirely, on the connectionist architectures that are most commonly associated with it. Lectures and Reading Notes are available on the page.\n\n",
    "url": "http://deeplearning.cs.cmu.edu/"
  },
  {
    "name": "CS246 Mining Massive Data Sets Stanford University    \n\nThe course will discuss data mining and machine learning algorithms for analyzing very large amounts of data. The emphasis will be on Map Reduce as a tool for creating parallel algorithms that can process very large amounts of data.\nLecture Videos\nAssignments\nLecture notes\nReadings\n\n",
    "url": "http://web.stanford.edu/class/cs246/"
  },
  {
    "name": "Lecture Videos",
    "url": "http://www.mmds.org/#mooc"
  },
  {
    "name": "Assignments",
    "url": "http://web.stanford.edu/class/cs246/handouts.html"
  },
  {
    "name": "Lecture notes",
    "url": "http://web.stanford.edu/class/cs246/handouts.html"
  },
  {
    "name": "Readings",
    "url": "http://www.mmds.org/#book"
  },
  {
    "name": "CS276 Information Retrieval and Web Search Stanford University  \n\nBasic and advanced techniques for text-based information systems: efficient text indexing; Boolean and vector space retrieval models; evaluation and interface issues; Web search including crawling, link-based algorithms, and Web metadata; text/Web clustering, classification; text mining.\nLecture notes\nReadings\n\n",
    "url": "http://web.stanford.edu/class/cs276/index.html"
  },
  {
    "name": "Lecture notes",
    "url": "http://web.stanford.edu/class/cs276/index.html#syllabus"
  },
  {
    "name": "Readings",
    "url": "http://web.stanford.edu/class/cs276/index.html#books"
  },
  {
    "name": "Practical_RL Reinforcement Learning in the Wild Yandex SDA    \n\nA course on reinforcement learning in the wild. Taught on-campus in HSE and Yandex SDA (russian) and maintained to be friendly to online students (both english and russian).\nSyllabus\n\n",
    "url": "https://github.com/yandexdataschool/Practical_RL"
  },
  {
    "name": "Syllabus",
    "url": "https://github.com/yandexdataschool/Practical_RL#syllabus"
  },
  {
    "name": "UvA DEEP LEARNING UvA Deep Learning Course University of Amsterdam    \n\nThis course is taught in the MSc program in Artificial Intelligence of the University of Amsterdam. In this course we study the theory of deep learning, namely of modern, multi-layered neural networks trained on big data. The course focuses particularly on computer vision and language modelling, which are perhaps two of the most recognizable and impressive applications of the deep learning theory.\nLecture Videos & Notes\nPracticals\nReadings\n\n",
    "url": "http://uvadlc.github.io/"
  },
  {
    "name": "Lecture Videos & Notes",
    "url": "http://uvadlc.github.io/#lecture"
  },
  {
    "name": "Practicals",
    "url": "http://uvadlc.github.io/#practicals"
  },
  {
    "name": "Readings",
    "url": "http://uvadlc.github.io/#other-links"
  },
  {
    "name": "CIS 4930 / CIS 5930 Offensive Computer Security Florida State University   \n\nCourse taught by W. Owen Redwood and Xiuwen Liu. It covers a wide range of computer security topics, starting from Secure C Coding and Reverse Engineering to Penetration Testing, Exploitation and Web Application Hacking, both from the defensive and the offensive point of view.\nLectures and Videos\nAssignments\n\n",
    "url": "http://www.cs.fsu.edu/%7Eredwood/OffensiveComputerSecurity/"
  },
  {
    "name": "Course taught by W. Owen Redwood and Xiuwen Liu. It covers a wide range of computer security topics, starting from Secure C Coding and Reverse Engineering to Penetration Testing, Exploitation and Web Application Hacking, both from the defensive and the offensive point of view.",
    "url": "http://ww2.cs.fsu.edu/%7Eredwood/"
  },
  {
    "name": "Lectures and Videos",
    "url": "http://www.cs.fsu.edu/%7Eredwood/OffensiveComputerSecurity/lectures.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.fsu.edu/%7Eredwood/OffensiveComputerSecurity/assignments.html"
  },
  {
    "name": "CS 155 Computer and Network Security Stanford  \n\nPrinciples of computer systems security. Attack techniques and how to defend against them. Topics include: network attacks and defenses, operating system holes, application security (web, email, databases), viruses, social engineering attacks, privacy, and digital rights management. Course projects focus on building reliable code. Recommended: Basic Unix. Primarily intended for seniors and first-year graduate students.\n\n",
    "url": "https://courseware.stanford.edu/pg/courses/349991/cs155-spring-2013"
  },
  {
    "name": "CS 161 Computer Security UC Berkeley \n\nIntroduction to computer security. Cryptography, including encryption, authentication, hash functions, cryptographic protocols, and applications. Operating system security, access control. Network security, firewalls, viruses, and worms. Software security, defensive programming, and language-based security. Case studies from real-world systems.\n\n",
    "url": "http://www-inst.eecs.berkeley.edu/%7Ecs161/sp15/"
  },
  {
    "name": "CS 259 Security Modeling and Analysis Stanford   \n\nThe course will cover a variety of contemporary network protocols and other systems with security properties. The course goal is to give students hands-on experience in using automated tools and related techniques to analyze and evaluate security mechanisms. To understand security properties and requirements, we will look at several network protocols and their properties, including secrecy, authentication, key establishment, and fairness. In parallel, the course will look at several models and tools used in security analysis and examine their advantages and limitations. In addition to fully automated finite-state model checking techniques, we will also study other approaches, such as constraint solving, process algebras, protocol logics, probabilistic model checking, game theory, and executable models based on logic programming.\n\n",
    "url": "https://courseware.stanford.edu/pg/courses/331628/cs259-winter-2013"
  },
  {
    "name": "CS 261 Internet/Network Security UC Berkeley  \n\nThis class aims to provide a thorough grounding in network security suitable for those interested in conducting research in the area, as well as students more generally interested in either security or networking. We will also look at broader issues relating to Internet security for which networking plays a role.  Topics include: denial-of-service; capabilities; network intrusion detection; worms; forensics; scanning; traffic analysis / inferring activity; architecture; protocol issues; legality and ethics; web attacks; anonymity; honeypots; botnets; spam; the underground economy; research pitfalls. The course is taught with an emphasis on seminal papers rather than bleeding-edge for a given topic.\n\n",
    "url": "http://www.icir.org/vern/cs261n-Sp14/"
  },
  {
    "name": "CS 5430 System Security Cornell University   \n\nThis course discusses security for computers and networked information systems. We focus on abstractions, principles, and defenses for implementing military as well as commercial-grade secure systems.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS5430/2013sp/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS5430/2013sp/01.intro.html"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS5430/2013sp/02.outline.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS5430/2013sp/"
  },
  {
    "name": "CSCI 4968 Modern Binary Exploitation Rensselaer Polytechnic Institute \n\nThis repository contains the materials as developed and used by RPISEC to\nteach Modern Binary Exploitation at Rensselaer Polytechnic Institute in\nSpring 2015. This was a university course developed and run solely by students to teach\nskills in vulnerability research, reverse engineering, and binary exploitation.\nLectures Notes\nLabs\nProjects\n\n",
    "url": "https://github.com/RPISEC/MBE"
  },
  {
    "name": "This repository contains the materials as developed and used by RPISEC to\nteach Modern Binary Exploitation at Rensselaer Polytechnic Institute in\nSpring 2015. This was a university course developed and run solely by students to teach\nskills in vulnerability research, reverse engineering, and binary exploitation.",
    "url": "http://rpis.ec"
  },
  {
    "name": "Lectures Notes",
    "url": "http://security.cs.rpi.edu/courses/binexp-spring2015/lectures/"
  },
  {
    "name": "Labs",
    "url": "https://github.com/RPISEC/MBE/tree/master/src"
  },
  {
    "name": "Projects",
    "url": "https://github.com/RPISEC/MBE/tree/master/src"
  },
  {
    "name": "CSCI 4976 Malware Analysis Rensselaer Polytechnic Institute \n\nThis repository contains the materials as developed and used by RPISEC to\nteach Malware Analysis at Rensselaer Polytechnic Institute in\nFall 2015. This was a university course developed and run soley by students, primarily using the\n\n",
    "url": "https://github.com/RPISEC/Malware"
  },
  {
    "name": "This repository contains the materials as developed and used by RPISEC to\nteach Malware Analysis at Rensselaer Polytechnic Institute in\nFall 2015. This was a university course developed and run soley by students, primarily using the",
    "url": "http://rpis.ec"
  },
  {
    "name": "EECS 588 Computer & Network Security University of Michigan  \n\nTaught by J. Alex Halderman who has analyzed the security of Electronic Voting Machines in the US and over seas.\nThis intensive research seminar covers foundational work and current topics in computer systems security.\nReadings\nPractical Malware Analysis\nbook by Michael Sikorski and Andrew Honig, to teach skills in reverse engineering, malicious behaviour, malware,\nand anti-analysis techniques.\nLectures Notes\nLabs\nProjects\n\n",
    "url": "https://www.eecs.umich.edu/courses/eecs588/"
  },
  {
    "name": "Taught by J. Alex Halderman who has analyzed the security of Electronic Voting Machines in the US and over seas.",
    "url": "https://jhalderm.com/"
  },
  {
    "name": "Readings\nPractical Malware Analysis\nbook by Michael Sikorski and Andrew Honig, to teach skills in reverse engineering, malicious behaviour, malware,\nand anti-analysis techniques.",
    "url": "https://www.eecs.umich.edu/courses/eecs588/readings.html"
  },
  {
    "name": "Lectures Notes",
    "url": "https://github.com/RPISEC/Malware/tree/master/Lectures"
  },
  {
    "name": "Labs",
    "url": "https://github.com/RPISEC/Malware/tree/master/Labs"
  },
  {
    "name": "Projects",
    "url": "https://github.com/RPISEC/Malware/tree/master/Projects"
  },
  {
    "name": "6.857 Computer and Network Security MIT \n\nEmphasis on applied cryptography and may include: basic notion of systems security, cryptographic hash functions, symmetric cryptography (one-time pad, stream ciphers, block ciphers), cryptanalysis, secret-sharing, authentication codes, public-key cryptography (encryption, digital signatures), public-key attacks, web browser security, biometrics, electronic cash, viruses, electronic voting, Assignments include a group final project. Topics may vary year to year.\nLecture Notes\nReferences\n\n",
    "url": "http://courses.csail.mit.edu/6.857/2015/"
  },
  {
    "name": "Emphasis on applied cryptography and may include: basic notion of systems security, cryptographic hash functions, symmetric cryptography (one-time pad, stream ciphers, block ciphers), cryptanalysis, secret-sharing, authentication codes, public-key cryptography (encryption, digital signatures), public-key attacks, web browser security, biometrics, electronic cash, viruses, electronic voting, Assignments include a group final project. Topics may vary year to year.\nLecture Notes\nReferences",
    "url": "http://courses.csail.mit.edu/6.857/2015/handouts"
  },
  {
    "name": "6.858 Computer Systems Security MIT    \n\nDesign and implementation of secure computer systems. Lectures cover threat models, attacks that compromise security, and techniques for achieving security, based on recent research papers. Topics include operating system (OS) security, capabilities, information flow control, language security, network protocols, hardware security, and security in web applications.\nTaught by James Mickens and Nickolai Zeldovich\nVideo Lectures and Labs\nQuizzes\nReadings\nFinal Projects\n\n",
    "url": "http://css.csail.mit.edu/6.858/2014/"
  },
  {
    "name": "Taught by James Mickens and Nickolai Zeldovich",
    "url": "http://research.microsoft.com/en-us/people/mickens/"
  },
  {
    "name": "Video Lectures and Labs",
    "url": "http://css.csail.mit.edu/6.858/2014/schedule.html"
  },
  {
    "name": "Quizzes",
    "url": "http://css.csail.mit.edu/6.858/2014/quiz.html"
  },
  {
    "name": "Readings",
    "url": "http://css.csail.mit.edu/6.858/2014/reference.html"
  },
  {
    "name": "Final Projects",
    "url": "http://css.csail.mit.edu/6.858/2014/projects.html"
  },
  {
    "name": "18-636 Browser Security Stanford  \n\nThe Web continues to grow in popularity as platform for retail transactions, financial services, and rapidly evolving forms of communication. It is becoming an increasingly attractive target for attackers who wish to compromise users' systems or steal data from other sites. Browser vendors must stay ahead of these attacks by providing features that support secure web applications. This course will study vulnerabilities in existing web browsers and the applications they render, as well as new technologies that enable web applications that were never before possible. The material will be largely based on current research problems, and students will be expected to criticize and improve existing defenses. Topics of study include (but are not limited to) browser encryption, JavaScript security, plug-in security, sandboxing, web mashups, and authentication.\n\n",
    "url": "https://courseware.stanford.edu/pg/courses/334553/18636-spring-2013"
  },
  {
    "name": "CS 188 Introduction to Artificial Intelligence UC Berkeley   \n\nThis course will introduce the basic ideas and techniques underlying the design of intelligent computer systems. A specific emphasis will be on the statistical and decision-theoretic modeling paradigm. By the end of this course, you will have built autonomous agents that efficiently make decisions in fully informed, partially observable and adversarial settings. Your agents will draw inferences in uncertain environments and optimize actions for arbitrary reward structures. Your machine learning algorithms will classify handwritten digits and photographs. The techniques you learn in this course apply to a wide variety of artificial intelligence problems and will serve as the foundation for further study in any application area you choose to pursue.\nLectures\nProjects\nExams\n\n",
    "url": "http://ai.berkeley.edu/home.html"
  },
  {
    "name": "Lectures",
    "url": "http://ai.berkeley.edu/lecture_videos.html"
  },
  {
    "name": "Projects",
    "url": "http://ai.berkeley.edu/project_overview.html"
  },
  {
    "name": "Exams",
    "url": "http://ai.berkeley.edu/exams.html"
  },
  {
    "name": "CS 4700 Foundations of Artificial Intelligence Cornell University  \n\nThis course will provide an introduction to computer vision, with topics including image formation, feature detection, motion estimation, image mosaics, 3D shape reconstruction, and object and face detection and recognition. Applications of these techniques include building 3D maps, creating virtual characters, organizing photo and video databases, human computer interaction, video surveillance, automatic vehicle navigation, and mobile computer vision. This is a project-based course, in which you will implement several computer vision algorithms throughout the semester.\nAssignments\nLectures\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS4700/2014fa/"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS4700/2014fa/"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS4700/2014fa/"
  },
  {
    "name": "CS 6700 Advanced Artificial Intelligence Cornell University  \n\nThe design of systems that are among top 10 performers in the world (human, computer, or hybrid human-computer).\nSyllabus\nLectures\nReadings\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS6700/2013sp/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS6700/2013sp/lectures/CS6700-Overview_v2.pptx"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS6700/2013sp/"
  },
  {
    "name": "Readings",
    "url": "http://www.cs.cornell.edu/courses/CS6700/2013sp/"
  },
  {
    "name": "6.868J The Society of Mind MIT    \n\nThis course is an introduction, by Prof. Marvin Minsky, to the theory that tries to explain how minds are made from collections of simpler processes. It treats such aspects of thinking as vision, language, learning, reasoning, memory, consciousness, ideals, emotions, and personality. It incorporates ideas from psychology, artificial intelligence, and computer science to resolve theoretical issues such as wholes vs. parts, structural vs. functional descriptions, declarative vs. procedural representations, symbolic vs. connectionist models, and logical vs. common-sense theories of learning.\nLectures\nAssignments\nReadings\n\n",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-868j-the-society-of-mind-fall-2011/index.htm"
  },
  {
    "name": "This course is an introduction, by Prof. Marvin Minsky, to the theory that tries to explain how minds are made from collections of simpler processes. It treats such aspects of thinking as vision, language, learning, reasoning, memory, consciousness, ideals, emotions, and personality. It incorporates ideas from psychology, artificial intelligence, and computer science to resolve theoretical issues such as wholes vs. parts, structural vs. functional descriptions, declarative vs. procedural representations, symbolic vs. connectionist models, and logical vs. common-sense theories of learning.",
    "url": "http://www.nytimes.com/2016/01/26/business/marvin-minsky-pioneer-in-artificial-intelligence-dies-at-88.html?_r=0"
  },
  {
    "name": "Lectures",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-868j-the-society-of-mind-fall-2011/video-lectures/"
  },
  {
    "name": "Assignments",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-868j-the-society-of-mind-fall-2011/assignments/"
  },
  {
    "name": "Readings",
    "url": "http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-868j-the-society-of-mind-fall-2011/readings/"
  },
  {
    "name": "CAP 5415 Computer Vision University of Central Florida   \n\nAn introductory level course covering the basic topics of computer vision, and introducing some fundamental approaches for computer vision research.\nLectures and Videos\nAssignments\n\n",
    "url": "http://crcv.ucf.edu/courses/CAP5415/"
  },
  {
    "name": "Lectures and Videos",
    "url": "http://crcv.ucf.edu/videos/Lecture_Videos/"
  },
  {
    "name": "Assignments",
    "url": "http://crcv.ucf.edu/courses/CAP5415/Fall2014/index.php"
  },
  {
    "name": "CIS 581 Computer Vision and Computational Photography University of Pennsylvania  \n\nAn introductory course in computer vision and computational photography focusing on four topics: image features, image morphing, shape matching, and image search.\nLectures\nAssignments\n\n",
    "url": "https://alliance.seas.upenn.edu/%7Ecis581/wiki/index.php?title=CIS_581:_Computer_Vision_%26_Computational_Photography"
  },
  {
    "name": "Lectures",
    "url": "https://alliance.seas.upenn.edu/%7Ecis581/wiki/index.php?title=Schedule"
  },
  {
    "name": "Assignments",
    "url": "https://alliance.seas.upenn.edu/%7Ecis581/wiki/index.php?title=Projects"
  },
  {
    "name": "CMU 462 Computer Graphics Carnegie Mellon University   \n\nThis course provides a comprehensive introduction to computer graphics. Focuses on fundamental concepts and techniques, and their cross-cutting relationship to multiple problem domains in graphics (rendering, animation, geometry, imaging). Topics include: sampling, aliasing, interpolation, rasterization, geometric transformations, parameterization, visibility, compositing, filtering, convolution, curves & surfaces, geometric data structures, subdivision, meshing, spatial hierarchies, ray tracing, radiometry, reflectance, light fields, geometric optics, Monte Carlo rendering, importance sampling, camera models, high-performance ray tracing, differential equations, time integration, numerical differentiation, physically-based animation, optimization, numerical linear algebra, inverse kinematics, Fourier methods, data fitting, example-based synthesis.\nLectures and Readings\nAssignments and Quizes\n\n",
    "url": "http://15462.courses.cs.cmu.edu/fall2015"
  },
  {
    "name": "Lectures and Readings",
    "url": "http://15462.courses.cs.cmu.edu/fall2015/reading"
  },
  {
    "name": "Assignments and Quizes",
    "url": "http://15462.courses.cs.cmu.edu/fall2015/exercises"
  },
  {
    "name": "CS 123 Introduction to Computer Graphics Brown University  \n\nThis course offers an in-depth exploration of fundamental concepts in 2D and 3D computer graphics. It introduces 2D raster graphics techniques, including scan conversion, simple image processing, interaction techniques and user interface design. The bulk of the course is devoted to 3D modeling, geometric transformations, and 3D viewing and rendering.\nLectures\nLabs\nDemos\n\n",
    "url": "http://cs.brown.edu/courses/csci1230/index.html"
  },
  {
    "name": "Lectures",
    "url": "http://cs.brown.edu/courses/csci1230/lectures.html"
  },
  {
    "name": "Labs",
    "url": "http://cs.brown.edu/courses/csci1230/labs.html"
  },
  {
    "name": "Demos",
    "url": "http://cs.brown.edu/courses/csci1230/demos.html"
  },
  {
    "name": "CS 378 3D Reconstruction with Computer Vision UTexas  \n\nIn this lab-based class, we'll dive into practical applications of 3D reconstruction, combining hardware and software to build our own 3D environments from scratch. We'll use open-source frameworks like OpenCV to do the heavy lifting, with the focus on understanding and applying state-of-the art approaches to geometric computer vision\nLectures\n\n",
    "url": "https://github.com/ut-cs378-vision-2014fall/course-info"
  },
  {
    "name": "Lectures",
    "url": "https://github.com/ut-cs378-vision-2014fall/course-info/tree/master/meeting-notes"
  },
  {
    "name": "CS 4620 Introduction to Computer Graphics Cornell University   \n\nThe study of creating, manipulating, and using visual images in the computer.\nAssignments\nExams\n\n",
    "url": "http://www.cs.cornell.edu/Courses/CS4620/2014fa/index.shtml#"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/Courses/CS4620/2014fa/index.shtml#asgn"
  },
  {
    "name": "Exams",
    "url": "http://www.cs.cornell.edu/Courses/CS4620/2014fa/index.shtml#exams"
  },
  {
    "name": "CS 4670 Introduction to Computer Vision Cornell University   \n\nThis course will provide an introduction to computer vision, with topics including image formation, feature detection, motion estimation, image mosaics, 3D shape reconstruction, and object and face detection and recognition. Applications of these techniques include building 3D maps, creating virtual characters, organizing photo and video databases, human computer interaction, video surveillance, automatic vehicle navigation, and mobile computer vision. This is a project-based course, in which you will implement several computer vision algorithms throughout the semester.\nAssignments\nLectures\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS4670/2015sp/"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS4670/2015sp/projects/projects.html"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS4670/2015sp/lectures/lectures.html"
  },
  {
    "name": "CS 6670 Computer Vision Cornell University  \n\nIntroduction to computer vision. Topics include edge detection, image segmentation, stereopsis, motion and optical flow, image mosaics, 3D shape reconstruction, and object recognition. Students are required to implement several of the algorithms covered in the course and complete a final project.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "https://canvas.instructure.com/courses/904706"
  },
  {
    "name": "Syllabus",
    "url": "https://canvas.instructure.com/courses/904706/assignments/syllabus"
  },
  {
    "name": "Lectures",
    "url": "https://canvas.instructure.com/courses/904706"
  },
  {
    "name": "Assignments",
    "url": "https://canvas.instructure.com/courses/904706/assignments"
  },
  {
    "name": "CSCI-GA.2270-001 Graduate Computer Graphics New York University   \n\nStep-by-step study computer graphics, with reading and homework at each lecture (Fall2015)\nLectures\n\n",
    "url": "https://mrl.nyu.edu/%7Eperlin/courses/fall2015/"
  },
  {
    "name": "Lectures",
    "url": "https://mrl.nyu.edu/%7Eperlin/courses/fall2015/"
  },
  {
    "name": "AM 207 Monte Carlo Methods and Stochastic Optimization Harvard University   \n\nThis course introduces important principles of Monte Carlo techniques and demonstrates the power of these techniques with simple (but very useful) applications. All of this in Python!\nLecture Videos\nAssignments\nLecture Notes\n\n",
    "url": "http://am207.github.io/2016/index.html"
  },
  {
    "name": "Lecture Videos",
    "url": "http://cm.dce.harvard.edu/2015/02/24104/publicationListing.shtml"
  },
  {
    "name": "Assignments",
    "url": "http://am207.github.io/2016/homework.html"
  },
  {
    "name": "Lecture Notes",
    "url": "http://am207.github.io/2016/lectures.html"
  },
  {
    "name": "CS 75  Introduction to Game Development Tufts University  \n\nThe course taught by Ming Y. Chow teaches game development initially in PyGame through Python, before moving on to addressing all facets of game development. Topics addressed include game physics, sprites, animation, game development methodology, sound, testing, MMORPGs and online games, and addressing mobile development in Android, HTML5, and iOS. Most to all of the development is focused on PyGame for learning principles\nText Lectures\nAssignments\nLabs\n\n",
    "url": "http://ocw.tufts.edu/Course/75"
  },
  {
    "name": "The course taught by Ming Y. Chow teaches game development initially in PyGame through Python, before moving on to addressing all facets of game development. Topics addressed include game physics, sprites, animation, game development methodology, sound, testing, MMORPGs and online games, and addressing mobile development in Android, HTML5, and iOS. Most to all of the development is focused on PyGame for learning principles",
    "url": "http://mchow01.github.io"
  },
  {
    "name": "Text Lectures",
    "url": "http://ocw.tufts.edu/Course/75/Learningunits"
  },
  {
    "name": "Assignments",
    "url": "http://ocw.tufts.edu/Course/75/Assignments"
  },
  {
    "name": "Labs",
    "url": "http://ocw.tufts.edu/Course/75/Labs"
  },
  {
    "name": "CS 50 Intro to Game Developement Harvard University  \n\nThis course picks up where Harvard Collegeâ€™s CS50 leaves off, focusing on the development of 2D and 3D interactive games. Students explore the design of such childhood games as Super Mario Bros., Legend of Zelda, and Portal in a quest to understand how video games themselves are implemented. Via lectures and hands-on projects, the course explores principles of 2D and 3D graphics, animation, sound, and collision detection using frameworks like Unity and LÃ–VE 2D, as well as languages like Lua and C#. By classâ€™s end, students will have programmed several of their own games and gained a thorough understanding of the basics of game design and development.\nAssignments\nLecture Videos\n\n",
    "url": "https://cs50.github.io/games/"
  },
  {
    "name": "This course picks up where Harvard Collegeâ€™s CS50 leaves off, focusing on the development of 2D and 3D interactive games. Students explore the design of such childhood games as Super Mario Bros., Legend of Zelda, and Portal in a quest to understand how video games themselves are implemented. Via lectures and hands-on projects, the course explores principles of 2D and 3D graphics, animation, sound, and collision detection using frameworks like Unity and LÃ–VE 2D, as well as languages like Lua and C#. By classâ€™s end, students will have programmed several of their own games and gained a thorough understanding of the basics of game design and development.",
    "url": "https://cs50.harvard.edu/"
  },
  {
    "name": "Assignments",
    "url": "https://cs50.github.io/games/assignments"
  },
  {
    "name": "Lecture Videos",
    "url": "https://cs50.github.io/games/lectures"
  },
  {
    "name": "CS 100 Open Source Software Construction UC Riverside  \n\nThis is a course on how to be a hacker. Your first four homework assignments walk you through the process of building your own unix shell. You'll be developing it as an open source project, and you will collaborate with each other at various points.\nGithub Page\nAssignments\n\n",
    "url": "https://github.com/mikeizbicki/ucr-cs100"
  },
  {
    "name": "Github Page",
    "url": "https://github.com/mikeizbicki/ucr-cs100"
  },
  {
    "name": "Assignments",
    "url": "https://github.com/mikeizbicki/ucr-cs100/tree/2015winter/assignments"
  },
  {
    "name": "CS 108 Object Oriented System Design Stanford  \n\nSoftware design and construction in the context of large OOP libraries. Taught in Java. Topics: OOP design, design patterns, testing, graphical user interface (GUI) OOP libraries, software engineering strategies, approaches to programming in teams.\n\n",
    "url": "http://web.stanford.edu/class/archive/cs/cs108/cs108.1092/"
  },
  {
    "name": "CS 168 Computer Networks UC Berkeley  \n\nThis is an undergraduate level course covering the fundamental concepts of networking as embodied in the Internet. The course will cover a wide range of topics; see the lecture schedule for more details. While the class has a textbook, we will not follow its order of presentation but will instead use the text as a reference when covering each individual topic. The course will also have several projects that involve programming (in Python).\nYou should know programming, data structures, and software engineering. In terms of mathematics, your algebra should be very solid, you need to know basic probability, and you should be comfortable with thinking abstractly. The TAs will spend very little time reviewing material that is not specific to networking. We assume that you either know the material covered in those courses, or are willing to learn the material as necessary. We won't cover any of this material in lecture.\n\n",
    "url": "https://inst.eecs.berkeley.edu/%7Ecs168/fa15/"
  },
  {
    "name": "CS 193a Android App Development, Spring 2016 Stanford University  \n\nCourse Description: This course provides an introduction to developing applications for the Android mobile platform.\nPrerequisite: CS 106B or equivalent. Java experience highly recommended. OOP highly recommmended.\nDevices: Access to an Android phone and/or tablet recommended but not required.\nVideos: Videos list can be found here\nOther materials: Some codes, handsout, homework ..... and lecture notes are not downloadable on the site due to login requirement. Please head to my Github repo here to download them.\n\n",
    "url": "http://web.stanford.edu/class/cs193a/lectures.shtml"
  },
  {
    "name": "Videos: Videos list can be found here",
    "url": "http://web.stanford.edu/class/cs193a/videos.shtml"
  },
  {
    "name": "Other materials: Some codes, handsout, homework ..... and lecture notes are not downloadable on the site due to login requirement. Please head to my Github repo here to download them.",
    "url": "https://github.com/VoLuong/Materials-CS193A-Android-App-Development-Standford"
  },
  {
    "name": "CS 193p Developing Applications for iOS Stanford University  \n\nUpdated for iOS 7. Tools and APIs required to build applications for the iPhone and iPad platform using the iOS SDK. User interface designs for mobile devices and unique user interactions using multi-touch technologies. Object-oriented design using model-view-controller paradigm, memory management, Objective-C programming language. Other topics include: object-oriented database API, animation, multi-threading and performance considerations.\nPrerequisites: C language and object-oriented programming experience\nRecommended: Programming Abstractions\nUpdated courses for iOS8",
    "url": "https://itunes.apple.com/us/course/developing-ios-7-apps-for/id733644550",
    "description": "Swift"
  },
  {
    "name": "Recommended: Programming Abstractions",
    "url": "https://itunes.apple.com/us/course/programming-abstractions/id495054099"
  },
  {
    "name": "Updated courses for iOS8",
    "url": "https://itunes.apple.com/us/course/developing-ios-8-apps-swift/id961180099",
    "description": "Swift"
  },
  {
    "name": "Updated courses for iOS9",
    "url": "https://itunes.apple.com/us/course/developing-ios-9-apps-swift/id1104579961",
    "description": "Swift"
  },
  {
    "name": "CS 223A Introduction to Robotics Stanford University   \n\nThe purpose of this course is to introduce you to basics of modeling, design, planning, and control of robot systems. In essence, the material treated in this course is a brief survey of relevant results from geometry, kinematics, statics, dynamics, and control.\n\n",
    "url": "https://see.stanford.edu/Course/CS223A"
  },
  {
    "name": "CS 262a Advanced Topics in Computer Systems UC Berkeley  \n\nCS262a is the first semester of a year-long sequence on computer systems research, including operating systems, database systems, and Internet infrastructure systems.  The goal of the course is to cover a broad array of research topics in computer systems, and to engage you in top-flight systems research.  The first semester is devoted to basic thematic issues and underlying techniques in computer systems, while the second semester goes deeper into topics related to scalable, parallel and distributed systems.  The class is based on a discussion of important research papers and a research project.\nParts: Some Classics, Persistent Storage, Concurrency, Higher-Level Models, Virtual Machines, Cloud Computing, Parallel and Distributed Computing, Potpourri.\nPrerequisites: The historical prerequisite was to pass an entrance exam in class, which covered undergraduate operating systems material (similar to UCB's CS162). There is no longer an exam. However, if you have not already taken a decent undergrad OS class, you should talk with me before taking this class. The exam had the benefit of \"paging in\" the undergrad material, which may have been its primary value (since the pass rate was high).\nReadings & Lectures\n\n",
    "url": "http://www.cs.berkeley.edu/%7Ebrewer/cs262/"
  },
  {
    "name": "Prerequisites: The historical prerequisite was to pass an entrance exam in class, which covered undergraduate operating systems material (similar to UCB's CS162). There is no longer an exam. However, if you have not already taken a decent undergrad OS class, you should talk with me before taking this class. The exam had the benefit of \"paging in\" the undergrad material, which may have been its primary value (since the pass rate was high).",
    "url": "https://cs162.eecs.berkeley.edu/"
  },
  {
    "name": "Readings & Lectures",
    "url": "http://www.cs.berkeley.edu/%7Ebrewer/cs262/"
  },
  {
    "name": "CS 294 Cutting-edge Web Technologies Berkeley   \n\nWant to learn what makes future web technologies tick? Join us for the class where we will dive into the internals of many of the newest web technologies, analyze and dissect them. We will conduct survey lectures to provide the background and overview of the area as well as invite guest lecturers from various leading projects to present their technologies.\n\n",
    "url": "http://inst.eecs.berkeley.edu/%7Ecs294-101/sp15/"
  },
  {
    "name": "CS 411 Software Architecture Design Bilkent University \n\nThis course teaches the basic concepts, methods and techniques for designing software architectures. The topics include: rationale for software architecture design, modeling software architecture design, architectural styles/patterns, architectural requirements analysis, comparison and evaluation of architecture design methods, synthesis-based software architecture design, software product-line architectures, domain modeling, domain engineering and application engineering, software architecture implementation, evaluating software architecture designs.\n\n",
    "url": "http://video.bilkent.edu.tr/course_videos.php?courseid=10"
  },
  {
    "name": "CS 3152 Introduction to Computer Game Development Cornell University  \n\nA project-based course in which programmers and designers collaborate to make a computer game. This course investigates the theory and practice of developing computer games from a blend of technical, aesthetic, and cultural perspectives. Technical aspects of game architecture include software engineering, artificial intelligence, game physics, computer graphics, and networking. Aesthetic and cultural include art and modeling, sound and music, game balance, and player experience.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS3152/2014sp/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS3152/2014sp/about/faq.php"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS3152/2014sp/lectures/index.php"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS3152/2014sp/assignments/index.php"
  },
  {
    "name": "CS 4152 Advanced Topics in Computer Game Development Cornell University  \n\nProject-based follow-up course to CS/INFO 3152. Students work in a multidisciplinary team to develop a game that incorporates innovative game technology. Advanced topics include 3D game development, mobile platforms, multiplayer gaming, and nontraditional input devices. There is a special emphasis on developing games that can be submitted to festivals and competitions, or that can be commercialized.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS4152/2014sp/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS4152/2014sp/about/faq.php"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS4152/2014sp/sessions/index.php"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS4152/2014sp/assignments/index.php"
  },
  {
    "name": "CS 4154 Analytics-driven Game Design Cornell University  \n\nA project-based course in which programmers and designers collaborate to design, implement, and release a video game online through popular game portals. In this course, students will use the internet to gather data anonymously from players. Students will analyze this data in order to improve their game over multiple iterations. Technical aspects of this course include programming, database architecture, and statistical analysis.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS4154/2014fa/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS4154/2014fa/about/faq.php"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS4154/2014fa/lectures/index.php"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS4154/2014fa/assignments/index.php"
  },
  {
    "name": "CS 4812 Quantum Information Processing Cornell University  \n\nHardware that exploits quantum phenomena can dramatically alter the nature of computation. Though constructing a working quantum computer is a formidable technological challenge, there has been much recent experimental progress. In addition, the theory of quantum computation is of interest in itself, offering strikingly different perspectives on the nature of computation and information, as well as providing novel insights into the conceptual puzzles posed by the quantum theory. The course is intended both for physicists, unfamiliar with computational complexity theory or cryptography, and also for computer scientists and mathematicians, unfamiliar with quantum mechanics. The prerequisites are familiarity (and comfort) with finite dimensional vector spaces over the complex numbers, some standard group theory, and ability to count in binary.\nSyllabus\nLectures\n\n",
    "url": "https://courses.cit.cornell.edu/physics4481-7681_2014sp/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/%7Eginsparg/physics/P4481-P7681-CS4812/Fa12.html"
  },
  {
    "name": "Lectures",
    "url": "https://courses.cit.cornell.edu/physics4481-7681_2014sp/"
  },
  {
    "name": "CS 4860 Applied Logic Cornell University  \n\nIn addition to basic first-order logic, when taught by Computer Science this course involves elements of Formal Methods and Automated Reasoning. Formal Methods is concerned with proving properties of algorithms, specifying programming tasks and synthesizing programs from proofs. We will use formal methods tools such as interactive proof assistants (see www.nuprl.org). We will also spend two weeks on constructive type theory, the language used by the Coq and Nuprl proof assistants.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS4860/2012fa/"
  },
  {
    "name": "In addition to basic first-order logic, when taught by Computer Science this course involves elements of Formal Methods and Automated Reasoning. Formal Methods is concerned with proving properties of algorithms, specifying programming tasks and synthesizing programs from proofs. We will use formal methods tools such as interactive proof assistants (see www.nuprl.org). We will also spend two weeks on constructive type theory, the language used by the Coq and Nuprl proof assistants.",
    "url": "http://www.nuprl.org"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS4860/2012fa/schedule.php"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS4860/2012fa/schedule.php"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS4860/2012fa/schedule.php"
  },
  {
    "name": "CS 5150 Software Engineering Cornell University   \n\nIntroduction to the practical problems of specifying, designing, building, testing, and delivering reliable software systems\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS5150/2014fa/overview.html"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS5150/2014fa/materials.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS5150/2014fa/assignments.html"
  },
  {
    "name": "CS 5220 Applications of Parallel Computers Cornell University   \n\nHow do we solve the large-scale problems of science quickly on modern computers? How do we measure the performance of new or existing simulation codes, and what things can we do to make them run faster? How can we best take advantage of features like multicore processors, vector units, and graphics co-processors? These are the types of questions we will address in CS 5220, Applications of Parallel Computers. Topics include:\n\nSingle-processor architecture, caches, and serial performance tuning\nBasics of parallel machine organization\nDistributed memory programming with MPI\nShared memory programming with OpenMP\nParallel patterns: data partitioning, synchronization, and load balancing\nExamples of parallel numerical algorithms\nApplications from science and engineering\n\n\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/%7Ebindel/class/cs5220-f11/"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/%7Ebindel/class/cs5220-f11/lectures.html"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/%7Ebindel/class/cs5220-f11/assignments.html"
  },
  {
    "name": "CS 5540 Computational Techniques for Analyzing Clinical Data Cornell University  \n\nCS5540 is a masters-level course that covers a wide range of clinical problems and their associated computational challenges. The practice of medicine is filled with digitally accessible information about patients, ranging from EKG readings to MRI images to electronic health records. This poses a huge opportunity for computer tools that make sense out of this data. Computation tools can be used to answer seemingly straightforward questions about a single patient's test results (â€œDoes this patient have a normal heart rhythm?â€), or to address vital questions about large populations (â€œIs there any clinical condition that affects the risks of Alzheimerâ€). In CS5540 we will look at many of the most important sources of clinical data and discuss the basic computational techniques used for their analysis, ranging in sophistication from current clinical practice to state-of-the-art research projects.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "https://sites.google.com/site/cs5540sp2013/"
  },
  {
    "name": "Syllabus",
    "url": "https://sites.google.com/site/cs5540sp2013/home/course-description"
  },
  {
    "name": "Lectures",
    "url": "https://sites.google.com/site/cs5540sp2013/lectures"
  },
  {
    "name": "Assignments",
    "url": "https://sites.google.com/site/cs5540sp2013/assignments"
  },
  {
    "name": "CS 5724 Evolutionary Computation Cornell University  \n\nThis course will cover advanced topics in evolutionary algorithms and their application to open-ended computational design. The field of evolutionary computation tries to address large-scale optimization and planning problems through stochastic population-based methods. It draws inspiration from evolutionary processes in nature and in engineering, and also serves as abstract models for these phenomena. Evolutionary processes are generally weak methods that require little information about the problem domain and hence can be applied across a wide variety of applications. They are especially useful for open-ended problem domains for which little formal knowledge exists and the number of parameters is undefined, such as for the general engineering design process. This course will provide insight to a variety of evolutionary computation paradigms, such as genetic algorithms, genetic programming, and evolutionary strategies, as well as governing dynamics of co-evolution, arms races and mediocre stable states. New methods involving symbiosis models and pattern recognition will also be presented. The material will be intertwined with discussions of representations and results for design problems in a variety of problem domains including software, electronics, and mechanics.\nSyllabus\nLectures\nAssignments\n\n",
    "url": "http://courses2.cit.cornell.edu/cs5724/"
  },
  {
    "name": "Syllabus",
    "url": "http://courses2.cit.cornell.edu/cs5724/"
  },
  {
    "name": "Lectures",
    "url": "http://courses2.cit.cornell.edu/cs5724/schedule.htm"
  },
  {
    "name": "Assignments",
    "url": "http://courses2.cit.cornell.edu/cs5724/"
  },
  {
    "name": "CS 6452 Evolutionary Computation Cornell University \n\nCS6452 focuses on datacenter networks and services. The emerging demand for web services and cloud computing have created need for large scale data centers. The hardware and software infrastructure for datacenters critically determines the functionality, performance, cost and failure tolerance of applications running on that datacenter. This course will examine design alternatives for both the hardware (networking) infrastructure, and the software infrastructure for datacenters.\nSyllabus\nLectures\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS6452/2012sp/index.php"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS6452/2012sp/lectures.php"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS6452/2012sp/lectures.php"
  },
  {
    "name": "CS 6630 Realistic Image Synthesis Cornell University   \n\nCS6630 is an introduction to physics-based rendering at the graduate level. Starting from the fundamentals of light transport we will look at formulations of the Rendering Equation, and a series of Monte Carlo methods, from sequential sampling to multiple importance sampling to Markov Chains, for solving the equation to make pictures. We'll look at light reflection from surfaces and scattering in volumes, illumination from luminaries and environments, and diffusion models for translucent materials. We will build working implementations of many of the algorithms we study, and learn how to make sure they are actually working correctly. It's fun to watch integrals and probability distributions transform into photographs of a slightly too perfect synthetic world.\nSyllabus\nLectures\nAssignments\nReadings\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS6630/2012sp/about.stm"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS6630/2012sp/about.stm"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS6630/2012sp/schedule.stm"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS6630/2012sp/schedule.stm"
  },
  {
    "name": "Readings",
    "url": "http://www.cs.cornell.edu/courses/CS6630/2012sp/schedule.stm"
  },
  {
    "name": "CS 6640 Computational Photography Cornell University  \n\nA course on the emerging applications of computation in photography. Likely topics include digital photography, unconventional cameras and optics, light field cameras, image processing for photography, techniques for combining multiple images, advanced image editing algorithms, and projector-camera systems.cornell.edu/courses/CS6630/2012sp/about.stm)\nLectures\nAssignments\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS6640/2012fa/index.shtml#"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS6640/2012fa/index.shtml#schedule"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS6640/2012fa/index.shtml#hw"
  },
  {
    "name": "CS 6650 Computational Motion Cornell University \n\nCovers computational aspects of motion, broadly construed. Topics include the computer representation, modeling, analysis, and simulation of motion, and its relationship to various areas, including computational geometry, mesh generation, physical simulation, computer animation, robotics, biology, computer vision, acoustics, and spatio-temporal databases. Students implement several of the algorithms covered in the course and complete a final project.  This offering will also explore the special role of motion processing in physically based sound rendering.\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS6650/2013fa/"
  },
  {
    "name": "CS 6840 Algorithmic Game Theory Cornell University   \n\nAlgorithmic Game Theory combines algorithmic thinking with game-theoretic, or, more generally, economic concepts. The course will study a range of topics at this interface\nSyllabus\nLectures\nAssignments\nReadings\n\n",
    "url": "http://www.cs.cornell.edu/courses/CS6840/2014sp/"
  },
  {
    "name": "Syllabus",
    "url": "http://www.cs.cornell.edu/courses/CS6840/2014sp/"
  },
  {
    "name": "Lectures",
    "url": "http://www.cs.cornell.edu/courses/CS6840/2014sp/"
  },
  {
    "name": "Assignments",
    "url": "http://www.cs.cornell.edu/courses/CS6840/2014sp/"
  },
  {
    "name": "Readings",
    "url": "http://www.cs.cornell.edu/courses/CS6840/2014sp/"
  },
  {
    "name": "CSE 154 Web Programming University of Washington  \n\nThis course is an introduction to programming for the World Wide Web. Covers use of HTML, CSS, PHP, JavaScript, AJAX, and SQL.\nLectures\nAssignments\n\n",
    "url": "http://courses.cs.washington.edu/courses/cse154/14au/"
  },
  {
    "name": "Lectures",
    "url": "http://courses.cs.washington.edu/courses/cse154/14au/lectures.shtml#today"
  },
  {
    "name": "Assignments",
    "url": "http://courses.cs.washington.edu/courses/cse154/14au/homework.shtml"
  },
  {
    "name": "ESM 296-4F GIS & Spatial Analysis UC Santa Barbara  \n\nTaught by James Frew, Ben Best, and Lisa Wedding\nFocuses on specific computational languages (e.g., Python, R, shell) and tools (e.g., GDAL/OGR, InVEST, MGET, ModelBuilder) applied to the spatial analysis of environmental problems\nGitHub  (includes lecture materials and labs)\n\n",
    "url": "http://ucsb-bren.github.io/esm296-4f/"
  },
  {
    "name": "Taught by James Frew, Ben Best, and Lisa Wedding",
    "url": "http://www.bren.ucsb.edu/people/Faculty/james_frew.htm"
  },
  {
    "name": "GitHub  (includes lecture materials and labs)",
    "url": "http://ucsb-bren.github.io/esm296-4f/"
  },
  {
    "name": "ICS 314 Software Engineering University of Hawaii    \n\nTaught by Philip Johnson\nIntroduction to software engineering using the \"Athletic Software Engineering\" pedagogy\nReadings\nExperiences\nAssessments\n\n",
    "url": "http://philipmjohnson.github.io/ics314f13/"
  },
  {
    "name": "Taught by Philip Johnson",
    "url": "http://philipmjohnson.org/"
  },
  {
    "name": "Introduction to software engineering using the \"Athletic Software Engineering\" pedagogy",
    "url": "http://philipmjohnson.org/essays/ase-initial-results.html"
  },
  {
    "name": "Readings",
    "url": "http://philipmjohnson.github.io/ics314f13/readings/"
  },
  {
    "name": "Experiences",
    "url": "http://philipmjohnson.github.io/ics314f13/experiences/"
  },
  {
    "name": "Assessments",
    "url": "http://philipmjohnson.github.io/ics314f13/assessments/"
  },
  {
    "name": "IGME 582 Humanitarian Free & Open Source Software Development Rochester Institute of Technology  \n\nThis course provides students with exposure to the design, creation and production of Open Source Software projects. Students will be introduced to the historic intersections of technology and intellectual property rights and will become familiar with Open Source development processes, tools and practices.\n\n",
    "url": "http://hfoss-fossrit.rhcloud.com"
  },
  {
    "name": "I485 / H400 Biologically Inspired Computation Indiana University  \n\nCourse taught by Luis Rocha about the multi-disciplinary field algorithms inspired by naturally occurring phenomenon. This course provides introduces the following areas: L-systems, Cellular Automata, Emergence, Genetic Algorithms, Swarm Intelligence and Artificial Immune Systems. It's aim is to cover the fundamentals and enable readers to build up a proficiency in applying various algorithms to real-world problems.\nLectures\nAssignments\n\n",
    "url": "http://www.informatics.indiana.edu/rocha/i-bic/"
  },
  {
    "name": "Course taught by Luis Rocha about the multi-disciplinary field algorithms inspired by naturally occurring phenomenon. This course provides introduces the following areas: L-systems, Cellular Automata, Emergence, Genetic Algorithms, Swarm Intelligence and Artificial Immune Systems. It's aim is to cover the fundamentals and enable readers to build up a proficiency in applying various algorithms to real-world problems.",
    "url": "http://www.informatics.indiana.edu/rocha/lr_form.html"
  },
  {
    "name": "Lectures",
    "url": "http://www.informatics.indiana.edu/rocha/i-bic/#materials"
  },
  {
    "name": "Assignments",
    "url": "http://www.informatics.indiana.edu/rocha/i-bic/#labs"
  },
  {
    "name": "Open Sourced Elective: Database and Rails Intro to Ruby on Rails University of Texas  \n\nAn introductory course in Ruby on Rails open sourced by University of Texas' CS Adjunct Professor, Richard Schneeman.\nLectures\nAssignments\nVideos\n\n",
    "url": "http://www.schneems.com/ut-rails/"
  },
  {
    "name": "Lectures",
    "url": "http://www.schneems.com/ut-rails/"
  },
  {
    "name": "Assignments",
    "url": "http://www.schneems.com/ut-rails/"
  },
  {
    "name": "Videos",
    "url": "https://www.youtube.com/playlist?list=PL7A85FD7803A8CB1F"
  },
  {
    "name": "SCICOMP An Introduction to Efficient Scientific Computation UniversitÃ¤t Bremen \n\nThis is a graduate course in scientific computing created and taught by Oliver Serang in 2014, which covers topics in computer science and statistics with applications from biology. The course is designed top-down, starting with a problem and then deriving a variety of solutions from scratch.\nTopics include memoization, recurrence closed forms, string matching (sorting, hash tables, radix tries, and suffix tries), dynamic programming (e.g. Smith-Waterman and Needleman-Wunsch), Bayesian statistics (e.g. the envelope paradox), graphical models (HMMs, Viterbi, junction tree, belief propagation), FFT, and the probabilistic convolution tree.\nLecture videos on Youtube and for direct download\n\n",
    "url": "http://mlecture.uni-bremen.de/ml/index.php?option=com_content&view=article&id=233"
  },
  {
    "name": "This is a graduate course in scientific computing created and taught by Oliver Serang in 2014, which covers topics in computer science and statistics with applications from biology. The course is designed top-down, starting with a problem and then deriving a variety of solutions from scratch.",
    "url": "http://colorfulengineering.org/"
  },
  {
    "name": "Lecture videos on Youtube and for direct download",
    "url": "https://www.youtube.com/user/fillwithlight/videos"
  },
  {
    "name": "14-740 Fundamentals of Computer Networks CMU    \n\nThis is an introductory course on Networking for graduate students. It follows a top-down approach to teaching Computer Networks, so it starts with the Application layer which most of the students are familiar with and as the course unravels we learn more about transport, network and link layers of the protocol stack.\nAs far as prerequisites are concerned",
    "url": "http://www.ini740.com/S17/index.html",
    "description": "basic computer, programming and probability theory background is required."
  }
]
