[
  {
    "name": "AiHello AutoPilot",
    "url": "https://www.aihello.com/",
    "description": "Amazon PPC Ads Automation Software."
  },
  {
    "name": "Amzmailer",
    "url": "https://amzmailer.com/",
    "description": "Feedback software and email autoresponder to send Amazon customers automated emails."
  },
  {
    "name": "aShop",
    "url": "https://ashop.co",
    "description": "Effortless microsites for Amazon Sellers. Marketing tool that delivers branded store experience to bring more business and maximize profits."
  },
  {
    "name": "ASINspector",
    "url": "https://asinspector.com/",
    "description": "Sales trend data, unique product ideas, mobile scanner, best-seller rankings."
  },
  {
    "name": "BQool",
    "url": "https://www.bqool.com/",
    "description": "Scheduled repricing, compete against buy box price, comprehensive dashboard & reports, repricing history log."
  },
  {
    "name": "CashCowPro",
    "url": "https://www.cashcowpro.com/",
    "description": "Sales data, keyword tracking, feedback collection, inventory monitoring, price split testing."
  },
  {
    "name": "Eva",
    "url": "https://eva.guru/",
    "description": "Connects the most important aspects of your Amazon business into a single intuitive dashboard - price management, replenishments, reimbursements, analytics."
  },
  {
    "name": "FeedbackExpress",
    "url": "https://www.feedbackexpress.com/",
    "description": "Makes it easy to improve your Amazon seller rating through effective, automated feedback requests."
  },
  {
    "name": "Feedbackwhiz",
    "url": "https://www.feedbackwhiz.com/",
    "description": "Software for merchants to boost their Amazon business, repair feedback, improve product reviews, and automate high-volume emails."
  },
  {
    "name": "Feedbackz",
    "url": "https://www.feedbackz.com/",
    "description": "Built for marketing savvy Amazon sellers seeking more beautiful and more powerfully targeted automatic follow-up email funnels."
  },
  {
    "name": "Forecastly",
    "url": "https://www.forecast.ly/",
    "description": "Predict future product demand, make fast and accurate buying decisions."
  },
  {
    "name": "ForecastRx",
    "url": "https://www.forecastrx.com/",
    "description": "Inventory forecasting solution. Projects future demand so you can purchase the right product, in the right quantity, at the right time."
  },
  {
    "name": "Helium10",
    "url": "https://www.helium10.com/",
    "description": "Software suite contains over a dozen tools that help find high ranking keywords, identify trends, monitor competitors, and fully optimize product listings to increase sales."
  },
  {
    "name": "HelloProfit",
    "url": "https://helloprofit.com/",
    "description": "Lets you view all your sales & profit data from different merchant accounts from one dashboard."
  },
  {
    "name": "Jungle Scout",
    "url": "https://www.junglescout.com/",
    "description": "Track and compare key product metrics, database allows you to filter products across multiple categories by demand, price, estimated sales, rating, seasonality, dimensions and more, find out which products sell and which niches have high opportunity."
  },
  {
    "name": "Keyword Tool",
    "url": "https://keywordtool.io/amazon",
    "description": "Finds great keywords using Amazon autocomplete."
  },
  {
    "name": "MerchantWords",
    "url": "https://www.merchantwords.com/",
    "description": "Finds highly specific keyword phrases that help buyers find what you are selling."
  },
  {
    "name": "Prestozon",
    "url": "https://prestozon.com/",
    "description": "Automation and analytics for Amazon HSA & sponsored products ads."
  },
  {
    "name": "Prisync",
    "url": "https://prisync.com/",
    "description": "Price monitoring & tracking SaaS with dynamic pricing and automatching engine."
  },
  {
    "name": "SellerApp",
    "url": "https://www.sellerapp.com/",
    "description": "Product research, product ideas, listing quality, product alerts, product source, keyword research, ppc analyzer, and more."
  },
  {
    "name": "SellerLabs",
    "url": "https://www.sellerlabs.com/tools/",
    "description": "Several tools to manage ads, discover profitable keywords and products, get more product reviews and better seller feedback, simplify inventory and financial management for the amazon marketplace."
  },
  {
    "name": "SellerLegend",
    "url": "https://sellerlegend.com/",
    "description": "Near real-time orders download, intelligent KPI dashboards, inventory management, notifications, refunds, historical cost of goods, operating expenses, all America & Europe marketplaces, financial transactions, Europe vat."
  },
  {
    "name": "Sellics",
    "url": "https://sellics.com",
    "description": "Combines everything you need to manage and grow your Amazon business in one integrated software. Features that work together to help you become more successful on Amazon."
  },
  {
    "name": "Skubana",
    "url": "https://www.skubana.com/",
    "description": "Powers orders, inventory and business intelligence for the world's top high-volume brands and retailers."
  },
  {
    "name": "Sonar",
    "url": "http://sonar-tool.com/",
    "description": "Free Amazon keyword research tool from Sellics."
  },
  {
    "name": "Splitly",
    "url": "https://splitly.com/",
    "description": "Algorithmic split testing, automated pricing optimization, keyword rank tracking."
  },
  {
    "name": "TradeGecko",
    "url": "https://www.tradegecko.com/",
    "description": "Cloud based inventory and order management software for modern online businesses."
  },
  {
    "name": "WordTree",
    "url": "https://www.wordtree.io/",
    "description": "Keyword tools to grow your search traffic, research your competitors, and monitor your niche."
  },
  {
    "name": "xSellco",
    "url": "https://www.xsellco.com/",
    "description": "Centralize customer queries, target positive feedback by requesting reviews from happy customers, automatically reprice."
  },
  {
    "name": "AM/PM Podcast",
    "url": "https://www.ampmpodcast.com/",
    "description": "Hosted by Manny Coats (Helium 10). Amazon selling tips for sellers at any step of the Amazon seller journey. From best-in-class interviews with six and seven figure Amazon sellers to instructional how-to education."
  },
  {
    "name": "Amazing FBA",
    "url": "https://amazingfba.com/blog-podcast/",
    "description": "Hosted by Michael Veazey. Podcast about selling on Amazon, especially white label products with a focus on UK markets."
  },
  {
    "name": "EcomCrew Podcast",
    "url": "https://www.ecomcrew.com/ecomcrew-podcast/",
    "description": "Real world e-commerce experience without any online marketing fluff!"
  },
  {
    "name": "Follow The Data",
    "url": "https://viral-launch.com/follow-the-data-amazon-fba-seller-podcast.html",
    "description": "Hosted by Cameron Yoder (Viral Launch). The goal of this podcast is to help you successfully dive deeper into your own Amazon seller journey, using data as the anchor through that journey."
  },
  {
    "name": "Keyword: The Amazon Insider Podcast",
    "url": "http://keywordpodcast.com/",
    "description": "Hosted by Kate Valentine. Delivers authoritative content exclusively from former and current Amazon employees."
  },
  {
    "name": "The Ecommerce Momentum",
    "url": "https://ecommercemomentum.com/",
    "description": "Hosted by Stephen Peterson. Interviews with the top Amazon, eBay and e-commerce sellers in the world."
  },
  {
    "name": "The My Wife Quit Her Job Podcast",
    "url": "https://mywifequitherjob.com/category/podcast/",
    "description": "Hosted by Steve Chou. An interview based show where Steve brings in small business entrepreneurs who are killing it online. All of the entrepreneurs on the show bootstrapped their businesses and started their own ventures to improve their lifestyle in some way."
  },
  {
    "name": "JumpSend",
    "url": "https://www.jumpsend.com/blog/",
    "description": "Authored by Greg Mercer and Adam Zlotnik. Tips for sellers on how to increase reviews and listing optimization."
  },
  {
    "name": "JungleScout",
    "url": "https://www.junglescout.com/blog/",
    "description": "The most recent Amazon seller resources in the universe. Stay up to date and ahead of the competition with the latest Amazon strategies."
  },
  {
    "name": "SellerEngine",
    "url": "https://sellerengine.com/blog/",
    "description": "A blog with regular updates with an awesome Amazon Account Holder Digest series."
  },
  {
    "name": "SellerLabs",
    "url": "https://www.sellerlabs.com/blog/",
    "description": "A blog from SellerLabs with awesome ICYMI: Amazon Seller News series."
  },
  {
    "name": "Sellics",
    "url": "https://sellics.com/blog",
    "description": "Sellics provides strategic advice for sellers."
  },
  {
    "name": "Tamebay",
    "url": "https://tamebay.com/",
    "description": "Tamebay is the leading provider of intelligence & news for all businesses and business people who ply their trade on online marketplaces, whether they are experienced powersellers looking to boost sales, or beginners seeking advice and best practice."
  },
  {
    "name": "WebRetailer",
    "url": "https://www.webretailer.com/",
    "description": "WebRetailer is a treasure trove of information for sellers and one of the leading resources on the web."
  },
  {
    "name": "FBA Catalog",
    "url": "https://fbacatalog.com",
    "description": "Software catalog for Amazon Sellers. Find tools that fit your business in no time!"
  },
  {
    "name": "FBA Monthly",
    "url": "https://fbamonthly.com",
    "description": "FBA Monthly newsletter is an across-the-board summary of the month's most important news articles and blog posts regarding Amazon businesses."
  },
  {
    "name": "r/FulfillmentByAmazon",
    "url": "https://www.reddit.com/r/FulfillmentByAmazon/",
    "description": "Subreddit for FBA sellers."
  }
]
