[
  {
    "name": "Front-end Front. Frontendfront",
    "url": "http://frontendfront.us9.list-manage.com/subscribe?u=b033c4814d034fca4f850fe82&id=ceaf5763d0"
  },
  {
    "name": "Front End Newsletter. The free, weekly newsletter of the best Front End related news, articles, projects, and more. JavaScript, React, Angular, Ember, Polymer, Meteor, RxJS, Elm, and more. Archive.",
    "url": "http://frontendnewsletter.com/"
  },
  {
    "name": "Dev Tips. A developer tip, in the form of a gif, in your inbox each week.",
    "url": "https://umaar.com/dev-tips/"
  },
  {
    "name": "Friday Front-end. 15 great Front-end articles, tutorials, and announcements every Friday. Sections for CSS/SCSS, JavaScript, and other awesome stuff. Archive",
    "url": "https://zendev.com/friday-frontend.html"
  },
  {
    "name": "Weekend Reading. A weekly email about Web development, design and the startup life.",
    "url": "https://tinyletter.com/assaf"
  },
  {
    "name": "Web Development Reading List. This Newsletter shares the latest articles in web development.",
    "url": "https://wdrl.info"
  },
  {
    "name": "Fullweb Weekly. A weekly newsletter for fullstack web developers. It sends you the top 5 link every week about web frontend and backend, devops and user experience.",
    "url": "http://fullweb.io/"
  },
  {
    "name": "Pony Foo Weekly. A weekly newsletter discussing interesting and trending topics around the web platform.",
    "url": "https://ponyfoo.com/weekly"
  },
  {
    "name": "Versioning. Stay entertained and up to date about all things web dev and design with a daily email.",
    "url": "https://versioning.substack.com"
  },
  {
    "name": "JavaScript Weekly. A free, once–weekly e-mail round-up of JavaScript news and articles. Archive.",
    "url": "https://javascriptweekly.com/"
  },
  {
    "name": "The Smashing Email Newsletter. Email newsletter twice a month with useful tips, tricks and resources for designers and developers.",
    "url": "https://www.smashingmagazine.com/the-smashing-newsletter/"
  },
  {
    "name": "A Drip of JavaScript. One quick JavaScript tip, delivered to your inbox every other week.",
    "url": "http://adripofjavascript.com/index.html"
  },
  {
    "name": "Web Tools Weekly. Web Tools Weekly is a front-end development and web design newsletter with a focus on tools.",
    "url": "https://webtoolsweekly.com/"
  },
  {
    "name": "ES.next News. 5 ECMAScript.next links every week curated by Dr. Axel Raushmayer and Johannes Weber.",
    "url": "http://esnextnews.com/"
  },
  {
    "name": "Awesome JavaScript Newsletter. A collection of awesome browser-side JavaScript libraries, resources and shiny things.",
    "url": "https://js.libhunt.com/newsletter"
  },
  {
    "name": "TypeScript Weekly. The best TypeScript links every week, right in your box.",
    "url": "https://www.typescript-weekly.com/"
  },
  {
    "name": "JSter. No nonsense list of curated JavaScript links to your mailbox once every two weeks. Subscribe.",
    "url": "http://jster.net/blog"
  },
  {
    "name": "ReactJS Newsletter. The free, weekly newsletter of the best React.js news and articles.",
    "url": "http://reactjsnewsletter.com/"
  },
  {
    "name": "React Native Newsletter. Free occasional summary of React Native news, articles, issues & pull requests, libraries and apps.",
    "url": "http://reactnative.cc/"
  },
  {
    "name": "Fullstack React. Newsletter about the React ecosystem with an emphasis on useful libraries, tutorials and code. Archive.",
    "url": "http://newsletter.fullstackreact.com/"
  },
  {
    "name": "React Digest. A hand-picked weekly selection of the best React JS resources.",
    "url": "https://www.getrevue.co/profile/the-react-digest"
  },
  {
    "name": "React Digest 2. 5 links; Flux, Redux, MobX, React and React Native we are watching everything so sign up and get your portion of javascript awesomeness every week.",
    "url": "https://reactdigest.net/"
  },
  {
    "name": "The React Newsletter. A weekly newsletter about React and ecosystem.",
    "url": "http://theproblemsolver.nl/TheReactNewsletter/Subscribe"
  },
  {
    "name": "React Status. A weekly roundup of the latest React and React Native links and tutorials.",
    "url": "https://react.statuscode.com/"
  },
  {
    "name": "Awesome React Newsletter. A weekly overview of the most popular React news, articles and libraries.",
    "url": "https://react.libhunt.com/newsletter"
  },
  {
    "name": "ActReact. Learn React from the best content in the community, weekly in your inbox.",
    "url": "https://www.actreact.io"
  },
  {
    "name": "AngularJS Weekly Newsletter. The free, weekly newsletter of the best AngularJS content on the web.",
    "url": "http://www.ng-newsletter.com/"
  },
  {
    "name": "EmberJS Weekly. The latest Ember.js news, tips & code delivered directly to your inbox.",
    "url": "http://www.emberweekly.com/"
  },
  {
    "name": "Vue.js Newsletter. Weekly dose of handpicked Vue.js news.",
    "url": "https://news.vuejs.org"
  },
  {
    "name": "Vue.js Developers Newsletter. A weekly curated publication of the best articles, latest news and coolest Vue projects.",
    "url": "https://vuejsdevelopers.com/newsletter/"
  },
  {
    "name": "Data Visualization & D3.js Weekly Newsletter. Get D3.js and Data Visualization news, articles, jobs and more delivered to your inbox every Tuesday.",
    "url": "https://www.dashingd3js.com/data-visualization-and-d3-newsletter"
  },
  {
    "name": "Best in Visual Storytelling. Monday roundup of the best in data journalism from the past week. Paid version also includes data visualization job postings.",
    "url": "http://tinyletter.us16.list-manage1.com/subscribe?u=5c12dabe1e59a9fbde1174b8c&id=e27a48af53"
  },
  {
    "name": "CSS Weekly. Weekly e-mail roundup of css articles, tutorials, experiments and tools curated by Zoran Jambor.",
    "url": "https://css-weekly.com/"
  },
  {
    "name": "CSS-Tricks. signup is at the bottom of the page right under the Get the newsletter header!.",
    "url": "https://css-tricks.com"
  },
  {
    "name": "CSS Layout News. A weekly collection of tutorials, news and information on all things CSS Layout.",
    "url": "http://csslayout.news/"
  },
  {
    "name": "Sass News. Get the latest and greatest news, tutorials, and code examples on all Sass-y greatness. Archive.",
    "url": "http://sass.news"
  },
  {
    "name": "Web Design Weekly. Just pure awesome links to the best news and articles to hit the interweb during the week.",
    "url": "https://web-design-weekly.com/"
  },
  {
    "name": "Product Design Weekly. Digital product design news, articles, showcases and resources, delivered straight to your inbox once a week.",
    "url": "http://designweekly.atomic.io/"
  },
  {
    "name": "Sidebar. Five design-centric posts each day.",
    "url": "https://sidebar.io"
  },
  {
    "name": "Web Designer News. Curated stories for designers.",
    "url": "http://www.webdesignernews.com"
  },
  {
    "name": "Responsive Design Weekly. A free, once–weekly round-up of responsive design articles, tools, tips, tutorials and inspirational links.",
    "url": "http://responsivedesignweekly.com"
  },
  {
    "name": "UX Weekly. A small newsletter of around five links per week that has consistently good reading.",
    "url": "http://uxwkly.com/"
  },
  {
    "name": "Alertbox E-Mail Newsletter. The latest articles about interface usability, website design, and UX research from the Nielsen Norman Group.",
    "url": "https://www.nngroup.com/articles/subscribe/"
  },
  {
    "name": "UI Movement. Only the best UI design inspiration, right in your inbox.",
    "url": "https://uimovement.com"
  },
  {
    "name": "Designer News. Where the design community meets.",
    "url": "https://www.designernews.co"
  },
  {
    "name": "Design Faves. Daily posts and exclusive articles marry the very best modern expressions and innovations from the Branding, Art and Graphic Design worlds.",
    "url": "https://www.designfaves.com/"
  },
  {
    "name": "Hack Design. An easy to follow design course for people who do amazing things.",
    "url": "https://hackdesign.org"
  },
  {
    "name": "Hacking UI. Weekly hand-picked resources for front-end developers and product managers.",
    "url": "http://hackingui.com/"
  },
  {
    "name": "UX Essentials. 5 best links of week about UX, UI and Product Design emailed to you every Sunday.",
    "url": "http://uxessentials.co.uk/"
  },
  {
    "name": "eWebDesign. Latest web news and articles from industry experts.",
    "url": "https://ewebdesign.com/"
  },
  {
    "name": "The UI Animation Newsletter. The UI Animation Newsletter keeps you up to date on the best web animation, motion design, and UX resources.",
    "url": "http://valhead.us2.list-manage2.com/subscribe?u=6fbaddc8c1fce7588d1a35cb2&id=8f4de2c2e5"
  },
  {
    "name": "Web Animation Weekly. A hand-picked selection of articles, videos, book reviews, and other goodies pertaining to the wonderful worlds of web animation and motion design!",
    "url": "http://webanimationweekly.com/"
  },
  {
    "name": "Design Systems News. Latest news, articles, repos, code, frameworks, videos and podcasts on Design Systems, Pattern Libraries and Styleguide. Archive.",
    "url": "http://news.design.systems/"
  },
  {
    "name": "Designgest. Designgest is an easy way to get fresh information about interactive design trends.",
    "url": "http://designgest.com/"
  },
  {
    "name": "Design Systems Weekly. Get the latest on how others are building, scaling and preventing entropy in their design systems delivered to your inbox.",
    "url": "https://designsystems.email/"
  },
  {
    "name": "FrontEnd Focus. A once–weekly HTML5 and Web Platform technology roundup. CSS 3, Canvas, WebSockets, WebGL, Native Client, and more.",
    "url": "https://frontendfoc.us"
  },
  {
    "name": "Gamedev.js Weekly. Weekly newsletter about HTML5 Game Development.",
    "url": "http://gamedevjsweekly.com/"
  },
  {
    "name": "Phaser World. Weekly newsletter as a summary of all the new content -game releases, tutorials, videos, etc- added to Phaser site over the last week.",
    "url": "http://phaser.io/community/newsletter"
  },
  {
    "name": "SVG Weekly. A weekly email focused on Scalable Vector Graphics (SVG), sharing tutorials, tools, experiments, talks and data.",
    "url": "https://tinyletter.com/svgweekly"
  },
  {
    "name": "O’Reilly Programming Newsletter. Receive weekly Programming news and insights from industry insiders.",
    "url": "http://www.oreilly.com/programming/newsletter"
  },
  {
    "name": "Programming Digest. 5 links, one article from Monday to Friday with the most interesting news about programming, big data, architecture, development process, databases — you name it.",
    "url": "https://programmingdigest.net/"
  },
  {
    "name": "Morning Cup of Coding. A daily newsletter featuring long-form technical articles of all fields of programming.",
    "url": "https://www.humanreadablemag.com/morningcupofcoding"
  },
  {
    "name": "iOS Dev Weekly. The best iOS development links every week.",
    "url": "https://iosdevweekly.com/"
  },
  {
    "name": "ObjC. Free monthly issues covering the most important aspects of advanced iOS and OS X development.",
    "url": "https://www.objc.io/"
  },
  {
    "name": "Awesome iOS Newsletter. A curated list of awesome iOS libraries, including Objective-C and Swift Projects.",
    "url": "https://ios.libhunt.com/newsletter"
  },
  {
    "name": "C# Digest. A weekly newsletter featuring the top 5 c# links of the week.",
    "url": "https://csharpdigest.net/"
  },
  {
    "name": "Awesome .Net Newsletter. A collection of awesome .Net libraries, tools & frameworks.",
    "url": "https://dotnet.libhunt.com/newsletter"
  },
  {
    "name": "Node Weekly. A free, once–weekly e-mail round-up of Node.js news and articles.",
    "url": "https://nodeweekly.com/"
  },
  {
    "name": "npm Weekly",
    "url": "https://www.npmjs.com/npm-weekly"
  },
  {
    "name": "Awesome Node.js Newsletter. A weekly overview of the most popular Node.js news, articles and packages.",
    "url": "https://nodejs.libhunt.com/newsletter"
  },
  {
    "name": "Swift Newsletter. Code examples, tutorials, screencasts and much more to learn Apple’s new programming language.",
    "url": "http://swiftweekly.com/"
  },
  {
    "name": "Swift Weekly Brief. A community-driven weekly newsletter about Swift.org. Curated by Jesse Squires and published for free every Thursday.",
    "url": "https://swiftweekly.github.io"
  },
  {
    "name": "Awesome Swift Newsletter. A curated list of awesome swift libraries and resources.",
    "url": "https://swift.libhunt.com/newsletter"
  },
  {
    "name": "Go Newsletter. A weekly newsletter about the Go programming language.",
    "url": "https://golangweekly.com/"
  },
  {
    "name": "Awesome Go Newsletter. A weekly overview of the most popular Go news, articles and libraries.",
    "url": "https://go.libhunt.com/newsletter"
  },
  {
    "name": "R Weekly. Weekly updates about R and Data Science. R Weekly is openly developed on GitHub.",
    "url": "https://rweekly.org"
  },
  {
    "name": "Ruby Weekly. A free, once–weekly e-mail round-up of Ruby news and articles.",
    "url": "https://rubyweekly.com/"
  },
  {
    "name": "Ruby posts by Thoughtbot",
    "url": "https://robots.thoughtbot.com/tags/ruby"
  },
  {
    "name": "Rails Weekly. Weekly inside scoop of interesting commits, pull requests and more from Rails, delivered to your inbox every Friday.",
    "url": "https://rails-weekly.ongoodbits.com/"
  },
  {
    "name": "Volt Framework. Volt is a framework for building data rich web applications shockingly fast.",
    "url": "http://voltframework.com/"
  },
  {
    "name": "Green Ruby News. A feed of fresh links of the week about ruby, javascript, webdev, devops, collected by mose, xenor and tysliu every Sunday.",
    "url": "http://greenruby.org/"
  },
  {
    "name": "Awesome Ruby Newsletter. A collection of awesome Ruby gems, tools, frameworks and software.",
    "url": "https://ruby.libhunt.com/newsletter"
  },
  {
    "name": "PHP Weekly. A free once-a-week newsletter, featuring some great articles, news and blog posts.",
    "url": "http://www.phpweekly.com/"
  },
  {
    "name": "Laravel News. Every week lots of tips, tutorials, and packages are released for Laravel.",
    "url": "https://laravel-news.com/"
  },
  {
    "name": "Awesome PHP Newsletter. A curated list of awesome PHP libraries and resources.",
    "url": "https://php.libhunt.com/newsletter"
  },
  {
    "name": "murze.be newsletter. A bi weekly newsletter on modern PHP and Laravel.",
    "url": "https://murze.be/newsletter/"
  },
  {
    "name": "Laravel Daily Weekly tips and tricks from Laravel community.",
    "url": "http://laraveldaily.com/weekly-laravel-newsletter/"
  },
  {
    "name": "Python Weekly. A free weekly newsletter featuring curated news, articles, new releases, jobs etc related to Python.",
    "url": "https://www.pythonweekly.com/"
  },
  {
    "name": "Weekly Python Newsletter. Weekly Python Newsletter containing Python Articles, Projects, Videos, Tweets delivered in your inbox.",
    "url": "http://importpython.com/newsletter/"
  },
  {
    "name": "Pycoders Weekly. A free weekly e-mail newsletter, on Fridays, for those interested in python development and various topics around python.",
    "url": "http://www.pycoders.com/"
  },
  {
    "name": "Awesome Python Newsletter. A weekly overview of the most popular Python news, articles and packages.",
    "url": "https://python.libhunt.com/newsletter"
  },
  {
    "name": "Groovy Weekly Newsletter. The latest releases, interesting articles, interviews, presentations, relevant tweets or Google+ posts, links to podcasts or screencasts, code snippets, books, upcoming events, and more.",
    "url": "http://www.groovy-lang.org/groovy-weekly.html"
  },
  {
    "name": "Perl Weekly. A free, once a week e-mail round-up of hand-picked news and articles about Perl.",
    "url": "http://perlweekly.com/"
  },
  {
    "name": "Elixir Radar. A weekly email with blog posts, latest libraries, talks, events and job opportunities.",
    "url": "http://plataformatec.com.br/elixir-radar"
  },
  {
    "name": "Awesome Elixir Newsletter. A curated list of awesome Elixir and Erlang packages and resources. Archive.",
    "url": "https://elixir.libhunt.com/newsletter"
  },
  {
    "name": "Elixir Digest. Weekly portion of Elixir and Phoenix goodness. Archive.",
    "url": "https://elixirdigest.net/"
  },
  {
    "name": "The REPL. A weekly newsletter about Clojure and ClojureScript.",
    "url": "https://therepl.net/"
  },
  {
    "name": "Haskell Weekly. A free email newsletter about the Haskell programming language.",
    "url": "https://haskellweekly.news"
  },
  {
    "name": "Elm Weekly. The wonderful world of the Elm programming language, in your inbox.",
    "url": "http://www.elmweekly.nl/"
  },
  {
    "name": "This Week in Rust. Stay up to date with events, learning resources, and recent developments in Rust community.",
    "url": "https://this-week-in-rust.org"
  },
  {
    "name": "Awesome Rust Newsletter. A curated list of Rust libraries and resources.",
    "url": "https://rust.libhunt.com/newsletter"
  },
  {
    "name": "Awesome C++ Newsletter. A curated list of awesome C/C++ frameworks, libraries, resources, and shiny things.",
    "url": "https://cpp.libhunt.com/newsletter"
  },
  {
    "name": "Awesome Scala Newsletter. A community driven list of useful Scala libraries, frameworks and software.",
    "url": "https://scala.libhunt.com/newsletter"
  },
  {
    "name": "Awesome Java Newsletter. A curated list of awesome Java frameworks, libraries and software.",
    "url": "https://java.libhunt.com/newsletter"
  },
  {
    "name": "Awesome Kotlin Newsletter. A weekly overview of the most popular Kotlin news, articles and libraries.",
    "url": "https://kotlin.libhunt.com/newsletter"
  },
  {
    "name": "Vim Weekly. Every monday, we send 5 tips that can help boost your vim productivity you can think of it as one tip per day!",
    "url": "http://www.vimweekly.com/"
  },
  {
    "name": "Mastering Vim Quickly. Best Vim stuff, once a week.",
    "url": "http://masteringvim.com/"
  },
  {
    "name": "DB Weekly. A weekly round-up of database technology news and articles covering new developments, SQL, NoSQL, document databases, graph databases, and more.",
    "url": "https://dbweekly.com/"
  },
  {
    "name": "Postgres Weekly. A free, once–weekly e-mail round-up of PostgreSQL news and articles.",
    "url": "https://postgresweekly.com/"
  },
  {
    "name": "Weekly MySQL News. Unofficial Weekly News Digest of all things MySQL.",
    "url": "http://mysqlnewsletter.com/"
  },
  {
    "name": "Redis Watch. Periodic newsletter about everything and anything Redis.",
    "url": "https://redislabs.com/resources/redis-watch-archive/"
  },
  {
    "name": "NoSQL Weekly. A free weekly newsletter featuring curated news, articles, new releases, jobs etc related to NoSQL.",
    "url": "https://www.nosqlweekly.com/"
  },
  {
    "name": "mongoDB Weekly. A free, once–weekly e-mail round-up of MongoDB news and articles.",
    "url": "https://mongodb.email/"
  },
  {
    "name": "Docker Weekly. Weekly newsletter filled with great updates from Docker, our users and ecosystem.",
    "url": "https://www.docker.com/newsletter-subscription"
  },
  {
    "name": "DevOps Weekly. A weekly slice of devops news.",
    "url": "http://www.devopsweekly.com/"
  },
  {
    "name": "DevOps newsletter. The best DevOps links of the week delivered to your inbox\nevery Sunday in the form of the DevOps newsletter.",
    "url": "https://blog.serverdensity.com/devops-newsletter/"
  },
  {
    "name": "Sysadmin Casts. Sysadmin Casts",
    "url": "https://sysadmincasts.com/get-notified",
    "description": "bite-sized sysadmin screencasts (released weekly)."
  },
  {
    "name": "Server Admin for Programmers",
    "url": "https://serversforhackers.com/"
  },
  {
    "name": "Cron.Weekly. A weekly newsletter, delivered to you every Sunday, with news & tools tailored to Linux sysadmins.",
    "url": "https://www.cronweekly.com"
  },
  {
    "name": "MicroServices Weekly. Get a free weekly dose of Microservice architectures and container-based virtualization news and articles from around the community.",
    "url": "http://www.microservicesweekly.com/"
  },
  {
    "name": "Awesome SysAdmin Newsletter. A curated list of awesome SysAdmin tools, software and resources.",
    "url": "https://sysadmin.libhunt.com/newsletter"
  },
  {
    "name": "Monitoring Weekly. Monitoring Weekly delivers the latest monitoring news, articles, and tools right to your inbox.",
    "url": "https://weekly.monitoring.love/"
  },
  {
    "name": "SRE Weekly. SRE Weekly is a newsletter devoted to everything related to keeping a site or service available as consistently as possible.",
    "url": "http://sreweekly.com/"
  },
  {
    "name": "Web Operations Weekly. A weekly newsletter on Web operations, infrastructure, performance, and tooling, from the browser down to the metal.",
    "url": "https://webopsweekly.com/"
  },
  {
    "name": "Cloud Development Weekly. News, links and resources for developers working with cloud services, cloud APIs, and cloud-based tools.",
    "url": "http://clouddevweekly.co/"
  },
  {
    "name": "Your weekly Azure news fix. Azure Weekly is a summary of the week's top news in the Microsoft Azure ecosystem, as well as interesting historic content that's well worth reading.",
    "url": "http://azureweekly.info/"
  },
  {
    "name": "Serverless Status. A weekly newsletter about serverless architectures and paradigms, function-as-a-service, AWS Lambda, etc.",
    "url": "https://serverless.email/"
  },
  {
    "name": "Google Cloud Weekly Newsletter. This Google Cloud Weekly is a summary of the week's top news, tutorials, videos, podcasts associated to the Google Cloud ecosystem, it's well worth reading.",
    "url": "https://www.the-swamp.info/newsletter/"
  },
  {
    "name": "kubelist. Your curated weekly kubernetes information reconciliation loop.",
    "url": "https://kubelist.com"
  },
  {
    "name": "KubeWeekly. Interesting weekly news about Kubernetes in the form of a newsletter.",
    "url": "http://kube.news"
  },
  {
    "name": "LWKD. LWKD is a weekly newsletter summarizing code activity in the Kubernetes project: merges, PRs, deprecations, version updates, release schedules, and the weekly community meeting.",
    "url": "http://lwkd.info"
  },
  {
    "name": "Mobile Web Weekly. A weekly round-up of the releases, articles, and links that affect Web developers working on the mobile-facing Web.",
    "url": "https://mobiledevweekly.com/"
  },
  {
    "name": "Android Weekly Free newsletter that helps you to stay cutting-edge with your Android Development.",
    "url": "http://androidweekly.net/"
  },
  {
    "name": "Awesome Android Newsletter. A curated list of awesome Android packages and resources.",
    "url": "https://android.libhunt.com/newsletter"
  },
  {
    "name": "Weekly Xamarin. Xamarin development.",
    "url": "http://weeklyxamarin.com"
  },
  {
    "name": "Data Science Weekly Newsletter. A free weekly newsletter featuring curated news, articles and jobs related to Data Science.",
    "url": "https://www.datascienceweekly.org/"
  },
  {
    "name": "Hadoop Weekly. Summary of the week's top news in the Apache Hadoop™ ecosystem.",
    "url": "https://www.hadoopweekly.com/"
  },
  {
    "name": "Data Elixir. A weekly newsletter of the best data science news and resources from around the web. Archive.",
    "url": "https://dataelixir.com/"
  },
  {
    "name": "Artificial Intelligence Weekly. A weekly collection of the best news and resources on Artificial Intelligence amd Machine Learning.",
    "url": "http://aiweekly.co/"
  },
  {
    "name": "The Wild Week in AI. A weekly AI & Deep Learning newsletter.",
    "url": "https://www.getrevue.co/profile/wildml"
  },
  {
    "name": "Machine Learnings. A weekly roundup of ML & AI news.",
    "url": "http://subscribe.machinelearnings.co/"
  },
  {
    "name": "Inside AI. Weekly newsletter bringing you the latest in Artificial Intelligence, Robotics, and Neurotechnology.",
    "url": "https://inside.com/ai"
  },
  {
    "name": "Data Prism. Data Prism is a weekly publication of curated news about startups and companies in the fields of data science, machine learning, AI and analytics.",
    "url": "http://dataprism.co/"
  },
  {
    "name": "Barista.io. Stay on top of today's most popular Tech news with a daily e-mail of crowd-curated articles from across the Web.",
    "url": "https://www.barista.io/"
  },
  {
    "name": "DevCraft. A weekly newsletter on the art, craft and lifestyle of Software Engineering.",
    "url": "https://devcraftweekly.com/"
  },
  {
    "name": "Four Short Links. 4 short links about (mostly research oriented) technology every weekday.",
    "url": "https://www.oreilly.com/feed/four-short-links"
  },
  {
    "name": "The Morning Paper. An interesting/influential/important paper from the world of CS every weekday morning, as selected by Adrian Colyer.",
    "url": "https://blog.acolyer.org/"
  },
  {
    "name": "Finimize. Understand today's financial news within 3 minutes. For free.",
    "url": "http://insider.finimize.com/"
  },
  {
    "name": "HackerNewsLetter. A weekly newsletter of the best articles on startups, technology, programming, and more. All links are curated by hand from the popular Hacker News site.",
    "url": "http://www.hackernewsletter.com/"
  },
  {
    "name": "Reddit's Official Newsletter. Best of reddit's content curated, packaged, and delivered to your inbox once a week.",
    "url": "https://www.reddit.com/newsletter"
  },
  {
    "name": "The ChangeLog Weekly. A weekly newsletter, covering everything that hits open source radar.",
    "url": "https://changelog.com/weekly"
  },
  {
    "name": "GitHub News. Discover top trending repos at GitHub, detected by a peak detection algorithm.",
    "url": "https://www.gitlogs.com/"
  },
  {
    "name": "Inspiration in your inbox by TED.",
    "url": "https://www.ted.com/newsletter"
  },
  {
    "name": "Projects We Love archive by KickStarter.",
    "url": "https://www.kickstarter.com/newsletters"
  },
  {
    "name": "Startup Digest. Curated reading materials from around the world, customized by your interests.",
    "url": "https://www.startupdigest.com/reading-lists"
  },
  {
    "name": "A free weekly newsletter featuring the best and hand curated links related to domains, development, monetization, how to guides, tips and tricks, resources, events and more. This Week in Domains",
    "url": "http://www.thisweekindomains.com/"
  },
  {
    "name": "My Morning Routine. My Morning Routine is an independent online magazine that brings you a brand new, inspiring morning routine every Wednesday.",
    "url": "https://mymorningroutine.com/"
  },
  {
    "name": "wpMail.me. A free WordPress Newsletter, once a week, with a round-up of WordPress news and articles. Archive.",
    "url": "http://wpmail.me/"
  },
  {
    "name": "Handwritten newsletter. The Think Clearly newsletter gives you little reflection exercises to help you in your daily life. It is created with love and admiration. Archive.",
    "url": "http://www.thnkclrly.com/newsletter/"
  },
  {
    "name": "Better Dev Link. A weekly newsletter, collects links that aim to improve programming knowledge general. The purpose is not include the links that reader can search instantly from google such as how to do x, y, z but more about problem solving in programming.",
    "url": "https://betterdev.link"
  },
  {
    "name": "GitHub Trending Repos. A special repo allowing to track trending projects in your favorite programming language on GitHub. Updates come as GitHub notifications once a day or a week.",
    "url": "https://github.com/vitalets/github-trending-repos"
  },
  {
    "name": "Bitcoin Weekly. A weekly round-up of Bitcoin and cryptocurrency news and articles.",
    "url": "http://bitcoinweekly.com/"
  },
  {
    "name": "Founder Weekly. A free weekly newsletter for entrepreneurs featuring best curated content, must read articles, how to guides, tips and tricks, resources, events and more.",
    "url": "http://www.founderweekly.com/"
  },
  {
    "name": "WebRTC Weekly. A weekly & brief newsletter with all the latest news and activities on WebRTC.",
    "url": "https://webrtcweekly.com/"
  },
  {
    "name": "Web Audio Weekly. A weekly newsletter for people are interested in the Web Audio API, the Web MIDI API, or sound on the web in general.",
    "url": "http://www.webaudioweekly.com/"
  },
  {
    "name": "Data Is Plural. A weekly newsletter of useful/curious datasets.",
    "url": "https://tinyletter.com/data-is-plural"
  },
  {
    "name": "Founders Grid. A weekly newsletter for startup founders that rounds up the best resources from startup ecosystem.",
    "url": "https://foundersgrid.com/"
  },
  {
    "name": "Software Lead Weekly. A free weekly email, for busy people who care about people, culture and leadership.",
    "url": "http://softwareleadweekly.com/"
  },
  {
    "name": "Hacking Revenue. One email a week with carefully curated insights to scale up your business.",
    "url": "http://hackingrevenue.com/"
  },
  {
    "name": "The Changelog Nightly. An email, every night at 10pm CT, that unearths the hottest new repos on GitHub.",
    "url": "https://changelog.com/nightly"
  },
  {
    "name": "Code Cartoons. Learn code via cartoons via email.",
    "url": "https://tinyletter.com/codecartoons"
  },
  {
    "name": "Awesome Self Hosted Newsletter. A directory of free software solutions and web applications which can be hosted locally.",
    "url": "https://selfhosted.libhunt.com/newsletter"
  },
  {
    "name": "lkml.wtf. A weekly roundup of Linux Kernel Mailing List threads but with a lot more sarcasm.",
    "url": "https://lkml.wtf/"
  },
  {
    "name": "Crypto-Gram. A security-focused monthly newsletter curated by Bruce Schneier, one of the most famous security experts in the world.",
    "url": "https://www.schneier.com/crypto-gram/"
  },
  {
    "name": "Now I Know. A free, daily email offering trivia in a neat digest.",
    "url": "http://nowiknow.com/"
  },
  {
    "name": "The ListServe. A free, unique \"lottery\" newsletter where every day a subscriber is picked whose email submission is sent to all of the other subscribers. Subject matter varies in both topic and quality.",
    "url": "http://thelistserve.com/"
  },
  {
    "name": "Engineering Impact. Weekly newsletter for managers of engineering teams covering leadership, culture, scaling, and software development productivity.",
    "url": "https://www.gitprime.com/engineering-impact/"
  },
  {
    "name": "tl;dr Marketing. Weekly newsletter for digital marketers, covering news on SEO, PPC and Social Media.",
    "url": "https://tldrmarketing.com/"
  },
  {
    "name": "Security Newsletter. Weekly e-mail with the latest security news on Thursday or Friday.",
    "url": "https://securitynewsletter.co/"
  },
  {
    "name": "Startup Watching. Curated knowledge, inspiration and background stories for startups. Delivered to your inbox every Monday and Thursday.",
    "url": "https://startupwatching.com/"
  },
  {
    "name": "Inside Bitcoin. Tracking trends, news, and analysis around Bitcoin and cryptocurrencies.",
    "url": "https://inside.com/bitcoin"
  },
  {
    "name": "Crypto Weekly. The best cryptocurrency news and insights delivered to your inbox every week.",
    "url": "https://cryptoweekly.co/"
  }
]
