[
  {
    "name": "Front-end Front. Frontendfront",
    "url": "https://frontendfront.us9.list-manage.com/subscribe?u=b033c4814d034fca4f850fe82&id=ceaf5763d0"
  },
  {
    "name": "Dev Tips. A developer tip, in the form of a gif, in your inbox each week.",
    "url": "https://umaar.com/dev-tips/"
  },
  {
    "name": "Friday Front-end. 15 great Front-end articles, tutorials, and announcements every Friday. Sections for CSS/SCSS, JavaScript, and other awesome stuff. Archive.",
    "url": "https://zendev.com/friday-frontend.html"
  },
  {
    "name": "Unreadit/Frontend. Best frontend development news sourced from the best subreddits.",
    "url": "https://unread.it/n/frontend/"
  },
  {
    "name": "UI Dev Newsletter. A hand-curated list of articles, tutorials, opinions, and tools related to User Interface development.",
    "url": "https://mentor.silvestar.codes/reads"
  },
  {
    "name": "Labnotes. A weekly email about software development, tech, and anything else interesting.",
    "url": "https://labnotes.org/"
  },
  {
    "name": "Web Development Reading List. This Newsletter shares the latest articles in web development.",
    "url": "https://wdrl.info"
  },
  {
    "name": "Pony Foo Weekly. A weekly newsletter discussing interesting and trending topics around the web platform. Archive.",
    "url": "https://ponyfoo.com/weekly"
  },
  {
    "name": "JAMstacked. An email update on the evolving JAMstack ecosystem.",
    "url": "https://jamstack.email/"
  },
  {
    "name": "FreeCodeCamp. Weekly selection of five articles, videos or entire courses from FreeCodeCamp learning platform.",
    "url": "https://www.freecodecamp.org"
  },
  {
    "name": "Codrops. Weekly news about qualitative new projects and libraries in web development and design.",
    "url": "https://tympanus.net/codrops/"
  },
  {
    "name": "The Comet. Short. Concise. Blazing fast 🌠 A monthly free newsletter about WordPress and web development.",
    "url": "https://wpuniverse.online/the-comet/"
  },
  {
    "name": "JavaScript Weekly. A free, once–weekly e-mail round-up of JavaScript news and articles. Archive.",
    "url": "https://javascriptweekly.com/"
  },
  {
    "name": "The Smashing Email Newsletter. Email newsletter twice a month with useful tips, tricks and resources for designers and developers.",
    "url": "https://www.smashingmagazine.com/the-smashing-newsletter/"
  },
  {
    "name": "A Drip of JavaScript. One quick JavaScript tip, delivered to your inbox every other week.",
    "url": "http://adripofjavascript.com/index.html"
  },
  {
    "name": "Web Tools Weekly. Web Tools Weekly is a front-end development and web design newsletter with a focus on tools.",
    "url": "https://webtoolsweekly.com/"
  },
  {
    "name": "ES.next News. 5 ECMAScript.next links every week curated by Dr. Axel Raushmayer and Johannes Weber.",
    "url": "http://esnextnews.com/"
  },
  {
    "name": "Awesome JavaScript Newsletter. A collection of awesome browser-side JavaScript libraries, resources and shiny things.",
    "url": "https://js.libhunt.com/newsletter"
  },
  {
    "name": "TypeScript Weekly. The best TypeScript links every week, right in your box.",
    "url": "https://www.typescript-weekly.com/"
  },
  {
    "name": "JSter. No nonsense list of curated JavaScript links to your mailbox once every two weeks. Subscribe.",
    "url": "http://jster.net/blog"
  },
  {
    "name": "Best of JavaScript. Weekly rankings about the most popular open-source projects related to Node.js and the web platform.",
    "url": "https://weekly.bestofjs.org/"
  },
  {
    "name": "JavaScript Kicks. Curated list of the top-rated articles from the community of JavaScript developers sent weekly.",
    "url": "https://javascriptkicks.com/"
  },
  {
    "name": "Bytes. Become a smarter JavaScript developer. Staying informed on the JavaScript ecosystem has never been so entertaining. Delivered every Monday, for free.",
    "url": "https://bytes.dev/"
  },
  {
    "name": "Deno Weekly. A weekly roundup of news, tutorials and projects from the land of Deno, the newest JavaScript runtime on the block.",
    "url": "https://denoweekly.com/"
  },
  {
    "name": "This Week In React. Weekly newsletter for experienced React and React-Native developers.",
    "url": "https://thisweekinreact.com"
  },
  {
    "name": "React Newsletter. The free, weekly newsletter of the best React.js news and articles.",
    "url": "https://reactnewsletter.com/"
  },
  {
    "name": "React Native Newsletter. Free occasional summary of React Native news, articles, issues & pull requests, libraries and apps.",
    "url": "https://reactnativenewsletter.com/"
  },
  {
    "name": "React Native Now. Hand picking the best React Native news, tutorials, libraries, articles, and videos.",
    "url": "https://reactnativenow.com/"
  },
  {
    "name": "React Digest. A weekly newsletter for React developers with top 5 links. Archive.",
    "url": "https://reactdigest.net/"
  },
  {
    "name": "React Status. A weekly roundup of the latest React and React Native links and tutorials.",
    "url": "https://react.statuscode.com/"
  },
  {
    "name": "Awesome React Newsletter. A weekly overview of the most popular React news, articles and libraries.",
    "url": "https://react.libhunt.com/newsletter"
  },
  {
    "name": "The Ember Times. Updates from the Ember.js Learning Team.",
    "url": "https://embertimes.substack.com/"
  },
  {
    "name": "Ember Weekly. The latest Ember.js news, tips & code delivered directly to your inbox.",
    "url": "https://www.emberweekly.com/"
  },
  {
    "name": "Vue.js Newsletter. Weekly dose of handpicked Vue.js news.",
    "url": "https://news.vuejs.org"
  },
  {
    "name": "Vue.js Developers Newsletter. A weekly curated publication of the best articles, latest news and coolest Vue projects.",
    "url": "https://www.getrevue.co/profile/vuejs-developers"
  },
  {
    "name": "VueDose. Tips & tricks about the Vue ecosystem, for busy devs. Published weekly.",
    "url": "https://vuedose.tips"
  },
  {
    "name": "Svelte News Weekly. A curated newsletter for Svelte enthusiasts with a weekly dose of handpicked news.",
    "url": "https://svelte.news/weekly"
  },
  {
    "name": "Angular Weekly. Angular Weekly is a summary of #angular related topics and news from the last week.",
    "url": "https://www.getrevue.co/profile/angular-newsletter"
  },
  {
    "name": "Best in Visual Storytelling. Monday roundup of the best in data journalism from the past week. Paid version also includes data visualization job postings.",
    "url": "https://us16.list-manage.com/subscribe?u=5c12dabe1e59a9fbde1174b8c&id=e27a48af53"
  },
  {
    "name": "Generative Collective. News, tutorials, articles and inspirations covering the generative / functional arts every Saturday morning.",
    "url": "https://generative.substack.com/"
  },
  {
    "name": "CSS Weekly. Weekly e-mail roundup of css articles, tutorials, experiments and tools curated by Zoran Jambor.",
    "url": "https://css-weekly.com/"
  },
  {
    "name": "CSS-Tricks. signup is at the bottom of the page right under the Get the newsletter header!.",
    "url": "https://css-tricks.com"
  },
  {
    "name": "CSS Layout News. A weekly collection of tutorials, news and information on all things CSS Layout.",
    "url": "http://csslayout.news/"
  },
  {
    "name": "Tailwind Weekly. Weekly newsletter about all things TailwindCSS.",
    "url": "https://tailwindweekly.com/"
  },
  {
    "name": "Web Design Weekly. Just pure awesome links to the best news and articles to hit the interweb during the week.",
    "url": "https://web-design-weekly.com/"
  },
  {
    "name": "Sidebar. Five design-centric posts each day.",
    "url": "https://sidebar.io"
  },
  {
    "name": "Web Designer News. Curated stories for designers.",
    "url": "https://www.webdesignernews.com"
  },
  {
    "name": "Responsive Design Weekly. A free, once–weekly round-up of responsive design articles, tools, tips, tutorials and inspirational links.",
    "url": "http://responsivedesignweekly.com"
  },
  {
    "name": "Alertbox E-Mail Newsletter. The latest articles about interface usability, website design, and UX research from the Nielsen Norman Group.",
    "url": "https://www.nngroup.com/articles/subscribe/"
  },
  {
    "name": "UI Movement. Only the best UI design inspiration, right in your inbox.",
    "url": "https://uimovement.com"
  },
  {
    "name": "Designer News. Where the design community meets.",
    "url": "https://www.designernews.co"
  },
  {
    "name": "Design Faves. Daily posts and exclusive articles marry the very best modern expressions and innovations from the Branding, Art and Graphic Design worlds.",
    "url": "https://www.designfaves.com/"
  },
  {
    "name": "Hack Design. An easy to follow design course for people who do amazing things.",
    "url": "https://hackdesign.org"
  },
  {
    "name": "Hacking UI. Weekly hand-picked resources for front-end developers and product managers.",
    "url": "http://hackingui.com/"
  },
  {
    "name": "eWebDesign. Latest web news and articles from industry experts.",
    "url": "https://ewebdesign.com/"
  },
  {
    "name": "The UI Animation Newsletter. The UI Animation Newsletter keeps you up to date on the best web animation, motion design, and UX resources.",
    "url": "https://us2.list-manage.com/subscribe?u=6fbaddc8c1fce7588d1a35cb2&id=8f4de2c2e5"
  },
  {
    "name": "Web Animation Weekly. A hand-picked selection of articles, videos, book reviews, and other goodies pertaining to the wonderful worlds of web animation and motion design!",
    "url": "http://webanimationweekly.com/"
  },
  {
    "name": "Design Systems News. Latest news, articles, repos, code, frameworks, videos and podcasts on Design Systems, Pattern Libraries and Styleguide. Archive.",
    "url": "http://news.design.systems/"
  },
  {
    "name": "Designgest. Designgest is an easy way to get fresh information about interactive design trends.",
    "url": "http://designgest.com/"
  },
  {
    "name": "Unreadit/Design. Design inspiration and great design-related content sourced from the best subreddits.",
    "url": "https://unread.it/n/design/"
  },
  {
    "name": "Figmalion. A biweekly curated newsletter about Figma.",
    "url": "https://figmalion.com"
  },
  {
    "name": "FrontEnd Focus. A once–weekly HTML5 and Web Platform technology roundup. CSS 3, Canvas, WebSockets, WebGL, Native Client, and more.",
    "url": "https://frontendfoc.us"
  },
  {
    "name": "Gamedev.js Weekly. Weekly newsletter about HTML5 Game Development.",
    "url": "http://gamedevjsweekly.com/"
  },
  {
    "name": "Phaser World. Weekly newsletter as a summary of all the new content -game releases, tutorials, videos, etc- added to Phaser site over the last week.",
    "url": "http://phaser.io/community/newsletter"
  },
  {
    "name": "SVG Weekly. A weekly email focused on Scalable Vector Graphics (SVG), sharing tutorials, tools, experiments, talks and data.",
    "url": "https://tinyletter.com/svgweekly"
  },
  {
    "name": "GraphQL Weekly. A weekly newsletter highlighting resources and news from the GraphQL community.",
    "url": "https://www.graphqlweekly.com/"
  },
  {
    "name": "O’Reilly Programming Newsletter. Receive weekly Programming news and insights from industry insiders.",
    "url": "https://www.oreilly.com/programming/newsletter.html"
  },
  {
    "name": "Programming Digest. A weekly newsletter for software engineers featuring top 5 links. Archive.",
    "url": "https://programmingdigest.net/"
  },
  {
    "name": "Weekly Dev Tips. A weekly email each Wednesday with a new software development tip from Steve \"ardalis\" Smith. Topics range from git to career to web development to personal development and teamwork.",
    "url": "https://ardalis.com/tips"
  },
  {
    "name": "LLVM Weekly. A weekly newsletter covering developments in LLVM, Clang, and related projects.",
    "url": "http://llvmweekly.org"
  },
  {
    "name": "Discover dev. Weekly digest of the best engineering blogs from across the web. Archive.",
    "url": "https://www.discoverdev.io"
  },
  {
    "name": "Programming Feedback for Advanced Beginners. Bi-weekly in-depth code-review related write-up.",
    "url": "https://advancedbeginners.substack.com/"
  },
  {
    "name": "Active forks. A weekly newsletter for open source enthusiats with a list of repositories and their recently active forks.",
    "url": "https://activeforks.net"
  },
  {
    "name": "BaseClass. A fortnightly newsletter explaining fundamental computing topics in under 5 minutes.",
    "url": "https://www.baseclass.io/"
  },
  {
    "name": "Docto Tech Life. A weekly newsletter featuring the latest Rails + Javascript + software engineering content.",
    "url": "https://doctolib.engineering/engineering-news-ruby-rails-react/"
  },
  {
    "name": "GIMTEC. The weekly newsletter I wish I had when I finished my development bootcamp.",
    "url": "https://www.gimtec.io/"
  },
  {
    "name": "A Byte of Coding. A daily curated newsletter that features technical deep-dives on all things software engineering.",
    "url": "https://abyteofcoding.com"
  },
  {
    "name": "Pointer. A window into what current and future CTOs are reading and thinking about. Super high quality engineering-related content only.",
    "url": "https://www.pointer.io/"
  },
  {
    "name": "Embedsys Weekly. A weekly selection of embedded software and hardware articles.",
    "url": "https://embedsysweekly.com/"
  },
  {
    "name": "ObjC. Free monthly issues covering the most important aspects of advanced iOS and OS X development.",
    "url": "https://www.objc.io/"
  },
  {
    "name": "Awesome iOS Newsletter. A curated list of awesome iOS libraries, including Objective-C and Swift Projects.",
    "url": "https://ios.libhunt.com/newsletter"
  },
  {
    "name": "C# Digest. A weekly newsletter featuring only the top 5 links for C# and .NET developers. Archive.",
    "url": "https://csharpdigest.net/"
  },
  {
    "name": "Awesome .Net Newsletter. A collection of awesome .Net libraries, tools & frameworks.",
    "url": "https://dotnet.libhunt.com/newsletter"
  },
  {
    "name": "ASP.NET Core News. A weekly newsletter about everything ASP.NET Core, Blazor, SignalR, and similar.",
    "url": "https://aspnetcore.news/"
  },
  {
    "name": "Node Weekly. A free, once–weekly e-mail round-up of Node.js news and articles.",
    "url": "https://nodeweekly.com/"
  },
  {
    "name": "npm Weekly. What we’re working on, thinking about, and talking about NPM",
    "url": "https://www.npmjs.com/npm-weekly"
  },
  {
    "name": "Awesome Node.js Newsletter. A weekly overview of the most popular Node.js news, articles and packages.",
    "url": "https://nodejs.libhunt.com/newsletter"
  },
  {
    "name": "Swift Newsletter. Code examples, tutorials, screencasts and much more to learn Apple’s new programming language.",
    "url": "https://swiftweekly.com/"
  },
  {
    "name": "iOS Dev Weekly. The best iOS development links every week. Archive.",
    "url": "https://iosdevweekly.com/"
  },
  {
    "name": "Swift Weekly Brief. A community-driven weekly newsletter about Swift.org. Curated by Jesse Squires and published for free every Thursday.",
    "url": "https://swiftweekly.github.io"
  },
  {
    "name": "Awesome Swift Newsletter. A curated list of awesome swift libraries and resources.",
    "url": "https://swift.libhunt.com/newsletter"
  },
  {
    "name": "The Swift by Sundell. Introducing the Swift by Sundell monthly newsletter!",
    "url": "https://www.swiftbysundell.com/newsletter/"
  },
  {
    "name": "iOS Goodies. Weekly iOS newsletter. Archive.",
    "url": "https://ios-goodies.com"
  },
  {
    "name": "Indie iOS Focus Weekly. Best iOS development, marketing, Swift, design, and Xcode links.",
    "url": "https://indieiosfocus.com"
  },
  {
    "name": "Swift Developments. Weekly curated newsletter containing a hand picked selection of the latest links, videos, tools and tutorials for people interested in designing and developing their own iOS, macOS, watchOS and tvOS apps using Swift.",
    "url": "https://andybargh.com/swiftdevelopments/"
  },
  {
    "name": "iOS Dev Tools Newsletter. The best tools for iOS developers, updated weekly.",
    "url": "https://iosdev.tools/"
  },
  {
    "name": "Go Newsletter. A weekly newsletter about the Go programming language. Archive.",
    "url": "https://golangweekly.com/"
  },
  {
    "name": "Awesome Go Newsletter. A weekly overview of the most popular Go news, articles and libraries.",
    "url": "https://go.libhunt.com/newsletter"
  },
  {
    "name": "Go Gazette. Weekly curated blogs and tools for Golang seniors.",
    "url": "http://www.go-gazette.com/"
  },
  {
    "name": "GoNotícias. A weekly newsletter about the Go programming language in Portuguese.",
    "url": "https://gonoticias.substack.com/"
  },
  {
    "name": "R Weekly. Weekly updates about R and Data Science. R Weekly is openly developed on GitHub.",
    "url": "https://rweekly.org"
  },
  {
    "name": "Ruby Weekly. A free, once–weekly e-mail round-up of Ruby news and articles.",
    "url": "https://rubyweekly.com/"
  },
  {
    "name": "Ruby Articles. Ruby posts by Thoughtbot",
    "url": "https://thoughtbot.com/blog/tags/ruby"
  },
  {
    "name": "Rails Weekly. Weekly inside scoop of interesting commits, pull requests and more from Rails, delivered to your inbox every Friday.",
    "url": "https://rails-weekly.ongoodbits.com/"
  },
  {
    "name": "Awesome Ruby Newsletter. A collection of awesome Ruby gems, tools, frameworks and software.",
    "url": "https://ruby.libhunt.com/newsletter"
  },
  {
    "name": "PHP Weekly. A free once-a-week newsletter, featuring some great articles, news and blog posts.",
    "url": "http://www.phpweekly.com/"
  },
  {
    "name": "Laravel News. Every week lots of tips, tutorials, and packages are released for Laravel.",
    "url": "https://laravel-news.com/"
  },
  {
    "name": "Awesome PHP Newsletter. A curated list of awesome PHP libraries and resources.",
    "url": "https://php.libhunt.com/newsletter"
  },
  {
    "name": "Freek.dev. A bi weekly newsletter on modern PHP and Laravel.",
    "url": "https://freek.dev/newsletter/"
  },
  {
    "name": "Laravel Daily Weekly tips and tricks from Laravel community.",
    "url": "https://laraveldaily.com/weekly-laravel-newsletter/"
  },
  {
    "name": "La semana PHP. A weekly collection of news, tutorials and information in Spanish about PHP and its ecosystem: Laravel, Symfony, WordPress, Drupal, ... Manually selected by Jesús Amieiro.",
    "url": "https://www.lasemanaphp.com/"
  },
  {
    "name": "Bootsity Newsletter. A free one-in-two-weeks newsletter curating great articles, videos and news.",
    "url": "https://bootsity.com/"
  },
  {
    "name": "PHP Annotated Monthly. A free monthly newsletter containing latest news from the PHP community and the most interesting PHP articles from around the web. Archive",
    "url": "https://info.jetbrains.com/PHP-Annotated-Subscription.html"
  },
  {
    "name": "Python Weekly. A free weekly newsletter featuring curated news, articles, new releases, jobs etc related to Python.",
    "url": "https://www.pythonweekly.com/"
  },
  {
    "name": "Weekly Python Newsletter. Weekly Python Newsletter containing Python Articles, Projects, Videos, Tweets delivered in your inbox. Archive.",
    "url": "https://importpython.com/newsletter/"
  },
  {
    "name": "Pycoders Weekly. A free weekly e-mail newsletter, on Fridays, for those interested in python development and various topics around python.",
    "url": "https://pycoders.com/"
  },
  {
    "name": "Awesome Python Newsletter. A weekly overview of the most popular Python news, articles and packages.",
    "url": "https://python.libhunt.com/newsletter"
  },
  {
    "name": "Data Science Simplified. A daily Python and data science snippet.",
    "url": "https://mathdatasimplified.com/"
  },
  {
    "name": "Groovy Weekly Newsletter. The latest releases, interesting articles, interviews, presentations, relevant tweets or Google+ posts, links to podcasts or screencasts, code snippets, books, upcoming events, and more.",
    "url": "http://www.groovy-lang.org/groovy-weekly.html"
  },
  {
    "name": "Perl Weekly. A free, once a week e-mail round-up of hand-picked news and articles about Perl.",
    "url": "http://perlweekly.com/"
  },
  {
    "name": "Elixir Radar. A weekly email with blog posts, latest libraries, talks, events and job opportunities.",
    "url": "http://plataformatec.com.br/elixir-radar"
  },
  {
    "name": "Awesome Elixir Newsletter. A curated list of awesome Elixir and Erlang packages and resources. Archive.",
    "url": "https://elixir.libhunt.com/newsletter"
  },
  {
    "name": "The REPL. A weekly newsletter about Clojure and ClojureScript.",
    "url": "https://www.therepl.net/"
  },
  {
    "name": "Clojure Morsels. Delicious Clojure(Script) morsels delivered fresh to your inbox every other week!",
    "url": "https://www.clojuremorsels.com/"
  },
  {
    "name": "Haskell Weekly. A free email newsletter about the Haskell programming language.",
    "url": "https://haskellweekly.news"
  },
  {
    "name": "Elm Weekly. The wonderful world of the Elm programming language, in your inbox.",
    "url": "http://www.elmweekly.nl/"
  },
  {
    "name": "This Week in Rust. Stay up to date with events, learning resources, and recent developments in Rust community. Archive.",
    "url": "https://this-week-in-rust.org"
  },
  {
    "name": "Awesome Rust Newsletter. A curated list of Rust libraries and resources.",
    "url": "https://rust.libhunt.com/newsletter"
  },
  {
    "name": "Awesome C++ Newsletter. A curated list of awesome C/C++ frameworks, libraries, resources, and shiny things.",
    "url": "https://cpp.libhunt.com/newsletter"
  },
  {
    "name": "Awesome Scala Newsletter. A community driven list of useful Scala libraries, frameworks and software.",
    "url": "https://scala.libhunt.com/newsletter"
  },
  {
    "name": "Awesome Java Newsletter. A curated list of awesome Java frameworks, libraries and software.",
    "url": "https://java.libhunt.com/newsletter"
  },
  {
    "name": "Baeldung Weekly Review. Keep up-to-date with the main developments in the Java world through this weekly guide.",
    "url": "https://www.baeldung.com/category/weekly-review/"
  },
  {
    "name": "Java Newsletter Insights. A Java newsletter contemplating Java content curated from dozens of sources.",
    "url": "https://curatedjava.com/java-weekly-newsletter/"
  },
  {
    "name": "Awesome Kotlin Newsletter. A weekly overview of the most popular Kotlin news, articles and libraries.",
    "url": "https://kotlin.libhunt.com/newsletter"
  },
  {
    "name": "Kotlin Weekly. The weekly newsletter for Kotlin developers, with articles, libraries, videos and podcasts from the Kotlin environment.",
    "url": "http://www.kotlinweekly.net/"
  },
  {
    "name": "Lua Digest. A regular newsletter for the Lua Programming Language.",
    "url": "https://luadigest.immortalin.com"
  },
  {
    "name": "BSD Weekly. A free, once–weekly e-mail round-up of BSD news and articles.",
    "url": "https://bsdweekly.com/"
  },
  {
    "name": "NixOS Weekly. Latest News for NixOS",
    "url": "https://weekly.nixos.org"
  },
  {
    "name": "Console Weekly. Discover cool open-source projects and an interview with one of the developers every week.",
    "url": "https://console.substack.com/"
  },
  {
    "name": "FOSS Weekly. The easiest way to keep up with Open Source Software.",
    "url": "https://fossweekly.beehiiv.com/"
  },
  {
    "name": "Git Rev News. Aggregation of activities of the Git mailing list in a format for the wider tech audience.",
    "url": "https://git.github.io/rev_news/rev_news/"
  },
  {
    "name": "Mastering Vim Quickly. Best Vim stuff, once a week.",
    "url": "https://masteringvim.com/"
  },
  {
    "name": "vscode.email. A Newsletter for News and Tips on VS Code & IDEs.",
    "url": "https://vscode.email/"
  },
  {
    "name": "DB Weekly. A weekly round-up of database technology news and articles covering new developments, SQL, NoSQL, document databases, graph databases, and more.",
    "url": "https://dbweekly.com/"
  },
  {
    "name": "Postgres Weekly. A free, once–weekly e-mail round-up of PostgreSQL news and articles.",
    "url": "https://postgresweekly.com/"
  },
  {
    "name": "Redis Watch. Periodic newsletter about everything and anything Redis.",
    "url": "https://redislabs.com/resources/redis-watch-archive/"
  },
  {
    "name": "NoSQL Weekly. A free weekly newsletter featuring curated news, articles, new releases, jobs etc related to NoSQL.",
    "url": "https://www.nosqlweekly.com/"
  },
  {
    "name": "mongoDB Weekly. A free, once–weekly e-mail round-up of MongoDB news and articles.",
    "url": "https://mongodb.email/"
  },
  {
    "name": "Docker Weekly. Weekly newsletter filled with great updates from Docker, our users and ecosystem.",
    "url": "https://www.docker.com/newsletter-subscription"
  },
  {
    "name": "DevOps Weekly. A weekly slice of devops news.",
    "url": "https://www.devopsweekly.com/"
  },
  {
    "name": "DevOps newsletter. The best DevOps links of the week delivered to your inbox\nevery Sunday in the form of the DevOps newsletter.",
    "url": "https://blog.serverdensity.com/devops-newsletter/"
  },
  {
    "name": "Sysadmin Casts. Sysadmin Casts",
    "url": "https://sysadmincasts.com/get-notified",
    "description": "bite-sized sysadmin screencasts (released weekly)."
  },
  {
    "name": "Server Admin for Programmers. Teaching the server tech you need for development and production. Eliminating the frustration of server configuration.",
    "url": "https://serversforhackers.com/"
  },
  {
    "name": "Cron.Weekly. A weekly newsletter, delivered to you every Sunday, with news & tools tailored to Linux sysadmins. Archige.",
    "url": "https://www.cronweekly.com"
  },
  {
    "name": "Awesome SysAdmin Newsletter. A curated list of awesome SysAdmin tools, software and resources.",
    "url": "https://sysadmin.libhunt.com/newsletter"
  },
  {
    "name": "Monitoring Weekly. Monitoring Weekly delivers the latest monitoring news, articles, and tools right to your inbox.",
    "url": "https://monitoring.love/"
  },
  {
    "name": "SRE Weekly. SRE Weekly is a newsletter devoted to everything related to keeping a site or service available as consistently as possible.",
    "url": "http://sreweekly.com/"
  },
  {
    "name": "StatusCode Weekly. A weekly newsletter on Web operations, infrastructure, performance, and tooling, from the browser down to the metal.",
    "url": "https://weekly.statuscode.com/"
  },
  {
    "name": "Your weekly Azure news fix. Azure Weekly is a summary of the week's top news in the Microsoft Azure ecosystem, as well as interesting historic content that's well worth reading.",
    "url": "https://azureweekly.info/"
  },
  {
    "name": "Serverless Status. A weekly newsletter about serverless architectures and paradigms, function-as-a-service, AWS Lambda, etc.",
    "url": "https://serverless.email/"
  },
  {
    "name": "Google Cloud Weekly Newsletter. This Google Cloud Weekly is a summary of the week's top news, tutorials, videos, podcasts associated to the Google Cloud ecosystem, it's well worth reading.",
    "url": "https://www.gcpweekly.com/"
  },
  {
    "name": "Last Week in AWS. A weekly roundup of news from Amazon's cloud ecosystem.",
    "url": "https://www.lastweekinaws.com/"
  },
  {
    "name": "kubelist. Your curated weekly kubernetes information reconciliation loop.",
    "url": "https://kubelist.com"
  },
  {
    "name": "KubeWeekly. Interesting weekly news about Kubernetes in the form of a newsletter.",
    "url": "https://kube.news"
  },
  {
    "name": "LWKD. LWKD is a weekly newsletter summarizing code activity in the Kubernetes project: merges, PRs, deprecations, version updates, release schedules, and the weekly community meeting.",
    "url": "http://lwkd.info"
  },
  {
    "name": "Mobile Web Weekly. A weekly round-up of the releases, articles, and links that affect Web developers working on the mobile-facing Web.",
    "url": "https://mobiledevweekly.com/"
  },
  {
    "name": "Android Weekly. Free newsletter that helps you to stay cutting-edge with your Android Development.",
    "url": "https://androidweekly.net/"
  },
  {
    "name": "Awesome Android Newsletter. A curated list of awesome Android packages and resources.",
    "url": "https://android.libhunt.com/newsletter"
  },
  {
    "name": "Weekly Xamarin. Xamarin development.",
    "url": "http://weeklyxamarin.com"
  },
  {
    "name": "Mobile Developers Cafe. A weekly newsletter for Mobile Developers",
    "url": "https://mobiledeveloperscafe.com",
    "description": "iOS, Android, Flutter & React Native."
  },
  {
    "name": "Flutter Croissants. Receive every Monday all the news about Flutter and the world of mobility.",
    "url": "https://flutter-croissants.com/"
  },
  {
    "name": "Flutter Digest. 🇫🇷 A weekly French newsletter about Flutter and Dart.",
    "url": "https://flutter-digest.com/"
  },
  {
    "name": "Android Croissants. 🇫🇷 Every Monday morning, receive the latest news, tutorials, tips… about Android.",
    "url": "https://android-croissants.com/"
  },
  {
    "name": "Data Elixir. A weekly newsletter of the best data science news and resources from around the web. Archive.",
    "url": "https://dataelixir.com/"
  },
  {
    "name": "Artificial Intelligence Weekly. A weekly collection of the best news and resources on Artificial Intelligence amd Machine Learning.",
    "url": "http://aiweekly.co/"
  },
  {
    "name": "Machine Learnings. A weekly roundup of ML & AI news.",
    "url": "http://subscribe.machinelearnings.co/"
  },
  {
    "name": "Inside AI. Weekly newsletter bringing you the latest in Artificial Intelligence, Robotics, and Neurotechnology.",
    "url": "https://inside.com/ai"
  },
  {
    "name": "Import AI. The latest breakthroughs, applications and foul-ups in artificial intelligence. Archive",
    "url": "https://twitter.us13.list-manage.com/subscribe?u=67bd06787e84d73db24fb0aa5&id=6c9d98ff2c"
  },
  {
    "name": "The ML Engineer Newsletter. Receive updates on open source frameworks, tutorials and articles curated by machine learning professionals. Obtain insights on best practices, tools and techniques in machine learning explainability, reproducibility, model evaluation, feature analysis and beyond.",
    "url": "https://ethical.institute/mle.html"
  },
  {
    "name": "True Positive Weekly. The most important artificial intelligence and machine learning links of the week.",
    "url": "https://aiweekly.substack.com/"
  },
  {
    "name": "Inside Cryptocurrency. Tracking trends, news, and analysis around Bitcoin and cryptocurrencies.",
    "url": "https://inside.com/cryptocurrency"
  },
  {
    "name": "Crypto Weekly. The best cryptocurrency news and insights delivered to your inbox every week.",
    "url": "https://cryptoweekly.co/"
  },
  {
    "name": "Build Blockchain. Blockchain tech without the bull— a weekly dose of blockchain reality with a heavy bias toward the technical.",
    "url": "https://www.buildblockchain.tech/newsletter"
  },
  {
    "name": "TLDR. TLDR is a daily curated newsletter containing links and summaries of the most interesting stories in tech.",
    "url": "https://www.tldrnewsletter.com/"
  },
  {
    "name": "Barista.io. Stay on top of today's most popular Tech news with a daily e-mail of crowd-curated articles from across the Web.",
    "url": "https://www.barista.io/"
  },
  {
    "name": "The Morning Paper. An interesting/influential/important paper from the world of CS every weekday morning, as selected by Adrian Colyer.",
    "url": "https://blog.acolyer.org/"
  },
  {
    "name": "TechMeme. Techmeme is a aggregated, filtered, archiveable summary in near real-time of what is new and generating conversation in technology.",
    "url": "https://www.techmeme.com/"
  },
  {
    "name": "Unzip.dev. Developer trends newsletter, unpacking one trend at a time.",
    "url": "https://unzip.dev/"
  },
  {
    "name": "Daily Tech. Daily Tech is a curated newsletter about technology, startups, product, and software engineering.",
    "url": "https://dailytech.email"
  },
  {
    "name": "Software Lead Weekly. Insightful articles about company culture, leadership and building software in general.",
    "url": "https://softwareleadweekly.com/"
  },
  {
    "name": "Tech Lead Digest. A weekly newsletter with five interesting stories about building teams, leadership, and engineering culture.",
    "url": "https://techleaddigest.net/"
  },
  {
    "name": "tldrMarketing. Get the latest breaking news and trends about digital marketing without all the fluff.",
    "url": "https://tldrmarketing.com"
  },
  {
    "name": "Zero to Marketing. A weekly email with 5-minute case study with actionable tips.",
    "url": "https://zerotomarketing.com/"
  },
  {
    "name": "The Content Odyssey. Biweekly tried-and-tested content growth experiments.",
    "url": "https://newsletter.mktodyssey.com/"
  },
  {
    "name": "Finimize. Understand today's financial news within 3 minutes. For free.",
    "url": "https://insider.finimize.com/"
  },
  {
    "name": "The Pricing Newsletter. Q&As, lessons, and news articles to help startups and business owners understand how to implement pricing strategy.",
    "url": "https://taprun.com/newsletter/"
  },
  {
    "name": "FBA monthly. FBA Monthly is an across-the-board summary of the month's most important news articles and blog posts regarding Amazon businesses. Only actual news, solutions, strategies, seller-to-seller tips and much more.",
    "url": "https://www.fbamonthly.com/"
  },
  {
    "name": "Capital minded. Weekly intelligence brief on navigating the index fund age, understanding the economy, and hacking capitalism.",
    "url": "https://capitalminded.com"
  },
  {
    "name": "AngelList Weekly. The best of the startup world, curated weekly.",
    "url": "https://angel.co/newsletters"
  },
  {
    "name": "Startup Curated. The startup community’s newsletter with the best content from and for founders. Archive.",
    "url": "https://startup.curated.co"
  },
  {
    "name": "Unvalidated Ideas. Fresh startup and SaaS ideas that you can take out and market validate every week.",
    "url": "https://unvalidatedideas.com"
  },
  {
    "name": "HackerNewsLetter. A weekly newsletter of the best articles on startups, technology, programming, and more. All links are curated by hand from the popular Hacker News site.",
    "url": "https://www.hackernewsletter.com/"
  },
  {
    "name": "ChangeLog Weekly. A weekly newsletter, covering everything that hits open source radar.",
    "url": "https://changelog.com/weekly"
  },
  {
    "name": "GitHub News. Discover top trending repos at GitHub, detected by a peak detection algorithm.",
    "url": "https://www.gitlogs.com/"
  },
  {
    "name": "TED. Inspiration in your inbox by TED",
    "url": "https://www.ted.com/newsletter"
  },
  {
    "name": "KickStarter. Projects We Love archive by KickStarter",
    "url": "https://www.kickstarter.com/newsletters"
  },
  {
    "name": "Startup Digest. Curated reading materials from around the world, customized by your interests.",
    "url": "https://www.startupdigest.com/reading-lists"
  },
  {
    "name": "My Morning Routine. My Morning Routine is an independent online magazine that brings you a brand new, inspiring morning routine every Wednesday.",
    "url": "https://mymorningroutine.com/"
  },
  {
    "name": "wpMail.me. A free WordPress Newsletter, once a week, with a round-up of WordPress news and articles. Archive.",
    "url": "http://wpmail.me/"
  },
  {
    "name": "Handwritten newsletter. The Think Clearly newsletter gives you little reflection exercises to help you in your daily life. It is created with love and admiration. Archive.",
    "url": "http://www.thnkclrly.com/newsletter/"
  },
  {
    "name": "Better Dev Link. A weekly newsletter, collects links that aim to improve programming knowledge general. The purpose is not include the links that reader can search instantly from google such as how to do x, y, z but more about problem solving in programming.",
    "url": "https://betterdev.link"
  },
  {
    "name": "GitHub Trending Repos. A special repo allowing to track trending projects in your favorite programming language on GitHub. Updates come as GitHub notifications once a day or a week.",
    "url": "https://github.com/vitalets/github-trending-repos"
  },
  {
    "name": "HN Mail. A customizable weekly newsletter that delivers Hacker News stories based on your interests.",
    "url": "https://hnmail.io"
  },
  {
    "name": "Senior Mindset. Get a series of curated essays on the mindset of a senior software engineer.",
    "url": "https://seniormindset.com"
  },
  {
    "name": "Weekly Robotics. A weekly newsletter with news, projects and research related to robotics.",
    "url": "https://weeklyrobotics.com/"
  },
  {
    "name": "Future Crunch. A fortnightly newsletter with all the good news you don't get to hear about, in science, the environment, and across the world. You can see a feed of their good news here.",
    "url": "https://futurecrunch.com"
  },
  {
    "name": "Resilience Roundup. Learn from Resilence Engineering research without having to dig through long, academic papers.",
    "url": "https://resilienceroundup.com"
  },
  {
    "name": "Crypto-Gram. A security-focused monthly newsletter curated by Bruce Schneier, one of the most famous security experts in the world.",
    "url": "https://www.schneier.com/crypto-gram/"
  },
  {
    "name": "this week in security. a weekly tl;dr cybersecurity newsletter including news, the happy corner, your weekly cyber-cat, and more. It's sent every Sunday.",
    "url": "https://twitter.us18.list-manage.com/subscribe?u=e1ad6038c994abec17dafb116&id=a2457dc8ad"
  },
  {
    "name": "InfoSecSherpa. A daily summary of 10 Information Security news items that aren't necessarily getting a lot of attention.",
    "url": "https://nuzzel.com/InfoSecSherpa"
  },
  {
    "name": "tl;dr sec. A weekly distillation of the best security tools, blog posts, and conference talks, covering AppSec, cloud and container security, DevSecOps, and more.",
    "url": "https://tldrsec.com/"
  },
  {
    "name": "Advisory Week. A weekly email with a roundup of Security Advisories published by the major software vendors.",
    "url": "https://advisoryweek.com/"
  },
  {
    "name": "Shift Security Left. A free biweekly newsletter for security-aware developers covering application security, secure architecture, DevSecOps, cryptography, incidents, etc. that can be useful for builders and (to a lesser extent) for breakers. Get a deeper understanding of causes for security vulnerabilities, designing defences, inventing and implementing security controls—with Felix, an imaginary mascot and a security engineer at @cossacklabs.",
    "url": "https://shift-security-left.curated.co/"
  },
  {
    "name": "Founder Weekly. A free weekly newsletter for entrepreneurs featuring best curated content, must read articles, how to guides, tips and tricks, resources, events and more.",
    "url": "http://www.founderweekly.com/"
  },
  {
    "name": "WebRTC Weekly. A weekly & brief newsletter with all the latest news and activities on WebRTC.",
    "url": "https://webrtcweekly.com/"
  },
  {
    "name": "Web Audio Weekly. A weekly newsletter for people are interested in the Web Audio API, the Web MIDI API, or sound on the web in general.",
    "url": "https://www.webaudioweekly.com/"
  },
  {
    "name": "Data Is Plural. A weekly newsletter of useful/curious datasets.",
    "url": "https://tinyletter.com/data-is-plural"
  },
  {
    "name": "Founders Grid. A weekly newsletter for startup founders that rounds up the best resources from startup ecosystem.",
    "url": "https://smash.vc/founders-grid/"
  },
  {
    "name": "Changelog Nightly. An email, every night at 10pm CT, that unearths the hottest new repos on GitHub.",
    "url": "https://changelog.com/nightly"
  },
  {
    "name": "Code Cartoons. Learn code via cartoons via email.",
    "url": "https://tinyletter.com/codecartoons"
  },
  {
    "name": "Awesome Self Hosted Newsletter. A directory of free software solutions and web applications which can be hosted locally.",
    "url": "https://selfhosted.libhunt.com/newsletter"
  },
  {
    "name": "lkml.wtf. A weekly roundup of Linux Kernel Mailing List threads but with a lot more sarcasm.",
    "url": "https://lkml.wtf/"
  },
  {
    "name": "Kleroteria. A free, unique \"lottery\" newsletter where a subscriber is picked whose email submission is sent to all of the other subscribers. Subject matter varies in both topic and quality.",
    "url": "https://www.kleroteria.org"
  },
  {
    "name": "Startup Watching. Curated knowledge, inspiration and background stories for startups. Delivered to your inbox every Monday and Thursday.",
    "url": "https://startupwatching.com/"
  },
  {
    "name": "Unreadit/Tech. Hardware and software news for tech junkies from the best posts on Reddit.",
    "url": "https://unread.it/n/tech/"
  },
  {
    "name": "Unreadit/Entrepreneur. Cutting edge news regarding entrepreneurship, growth, investing and startups sourced from the best Reddit posts.",
    "url": "https://unread.it/n/entrepreneur/"
  },
  {
    "name": "Tech Productivity. Tech Productivity is a short weekly newsletter for tech professionals (programmers, developers, designers, etc). Each issue includes a brief list of productivity-related tools, articles, and other resources that can help workers in various tech-related fields be more productive.",
    "url": "https://techproductivity.co/"
  },
  {
    "name": "Dev Updates. A weekly newsletter focussing on latest in mobile, web, AI, UI/UX, jobs/carrers and anything related to developers and the industry.",
    "url": "https://mailchi.mp/f59beeac6b9b/devupdates"
  },
  {
    "name": "Trending Projects. A weekly email showcasing trending projects on GitHub.",
    "url": "https://www.trendingprojects.com/"
  },
  {
    "name": "Softwaretalks Newsletter. In Softwaretalks Newsletter, we send articles about software engineering every Thursday. (For persian users).",
    "url": "https://newsletter.softwaretalks.ir/"
  },
  {
    "name": "Figures. Receive high-paying tech jobs based on your minimum salary requirement.",
    "url": "https://joinfigures.com/"
  },
  {
    "name": "rendezvous with cassidoo. A free weekly tech newsletter with the latest web development articles, a practice technical interview question of the week, a joke, some non-technical content, and more, arriving every Sunday night/Monday morning depending on where you are in the world.",
    "url": "https://cassidoo.co/newsletter/"
  },
  {
    "name": "No-Code Shots. A curated weekly newsletter that will bring you news, updates, and tips on how to improve your No-code skills.",
    "url": "https://nocodeshots.com"
  }
]
