[
  {
    "name": "Web Components",
    "url": "http://w3c.github.io/webcomponents/explainer/",
    "description": "This document is a non-normative reference, which provides an overview of Web Components."
  },
  {
    "name": "Shadow Dom",
    "url": "http://w3c.github.io/webcomponents/spec/shadow/",
    "description": "Spec of Shadow Dom"
  },
  {
    "name": "HTML Imports",
    "url": "http://w3c.github.io/webcomponents/spec/imports/",
    "description": "Spec of html imports"
  },
  {
    "name": "Template Spec of Template",
    "url": "https://html.spec.whatwg.org/multipage/scripting.html#the-template-element"
  },
  {
    "name": "Custom Elements",
    "url": "http://w3c.github.io/webcomponents/spec/custom/",
    "description": "Spec Custom Elements is cherry on cake."
  },
  {
    "name": "WebComponents.org a place to discuss and evolve web component best-practices",
    "url": "http://webcomponents.org/"
  },
  {
    "name": "Polymer Articles Articles core concepts of build apps on top of Polymer and web components",
    "url": "https://www.polymer-project.org/articles/"
  },
  {
    "name": "Polymer Blog Blog with news of polymer.",
    "url": "https://blog.polymer-project.org/"
  },
  {
    "name": "Introduction to the template elements Templates allow teams to divide their work.",
    "url": "http://webcomponents.org/articles/introduction-to-template-element/"
  },
  {
    "name": "Polymer vs. X-Tag Polymer vs. X-Tag",
    "url": "http://pascalprecht.github.io/2014/07/21/polymer-vs-x-tag-here-is-the-difference/",
    "description": "Here's the difference"
  },
  {
    "name": "Ten Principles for Great General Purpose Web Components This page lays out a set of principles for creating general-purpose web components that can be readily adopted in a wide range of sites and application.",
    "url": "https://github.com/basic-web-components/components-dev/wiki/Ten-Principles-for-Great-General-Purpose-Web-Components"
  },
  {
    "name": "Introduction To Custom Elements A Detailed Introduction To Custom Elements",
    "url": "http://www.smashingmagazine.com/2014/03/introduction-to-custom-elements/"
  },
  {
    "name": "Accessibility and the Shadow DOM A lesson on rendering trees, emerging technologies and tacos",
    "url": "http://substantial.com/blog/2014/02/05/accessibility-and-the-shadow-dom"
  },
  {
    "name": "Modular future Web Components A Guide to Web Components",
    "url": "https://css-tricks.com/modular-future-web-components/"
  },
  {
    "name": "Polymer vs Angular Here’s the difference between Polymer and Angular",
    "url": "http://www.binpress.com/blog/2014/06/26/polymer-vs-angular/"
  },
  {
    "name": "Building single page apps using web components The Polymer approach to building single page applications",
    "url": "https://www.polymer-project.org/articles/spa.html"
  },
  {
    "name": "Web Components é uma Revolução? PT-br Existe uma nova celebridade na cidade, e seu nome é \"Web Components\". Ultimamente muitos apresentam esta nova tecnologia como o 'Santo Graal' que vai resolver todos os problemas da Web. Este artigo não é um apoio incondicional, não é uma crítica negativa irrefutável, mas meramente uma apresentação de perspectivas com o objetivo de dar clareza.",
    "url": "http://www.akitaonrails.com/2014/07/06/web-components-e-uma-revolucao"
  },
  {
    "name": "The State of the Componentised Web The idea of building applications out of a number of independent components isn’t anything new. But with Web Components is a good time to look at component-based application development, how we benefit from taking this approach, how we can build our applications in this way using existing technologies and how we’re likely to be building our front-end web apps in the future.",
    "url": "http://www.leggetter.co.uk/2014/08/06/state-componentised-web.html"
  },
  {
    "name": "Integrating Web Components with AngularJS This article focuses on the integration of Web Components with the AngularJS of today and the AngularJS of tomorrow.",
    "url": "pascalprecht.github.io/2014/10/25/integrating-web-components-with-angularjs/"
  },
  {
    "name": "Introducing Polymer 0.5.1 We announce significant releases here on the blog, highlighting the major new features as well as breaking changes.",
    "url": "https://blog.polymer-project.org/releases/2014/11/12/release-0.5.1/"
  },
  {
    "name": "Polymer Web Components With Marionette.js JavaScript is a playground. If you disagree, then I encourage you to read Atwood’s Law. A quick Google search will reveal the law in full force with assemblers, machine emulators, and programming languages all written in JavaScript. That is just a small sampling. Go peruse the npm registry for plenty of build tools, frameworks, and servers written in JavaScript. We are tinkerers, especially in the JavaScript community. Sometimes our creations are practical and sometimes they are just fun.",
    "url": "http://blog.jeremyfairbank.com/javascript/polymer-web-components-with-marionette-js/"
  },
  {
    "name": "Creating a Polymer Chat App with Material Design I am showing how to create yet another chat app with Material Design using Polymer to create a simple but visually appealing app with a great user-experience",
    "url": "https://www.pubnub.com/blog/2015-01-15-creating-a-polymer-chat-app-with-material-design/"
  },
  {
    "name": "Best Practice for Creating Custom Elements It looks like custom elements, and web components in general, are beginning to break through into general developer consciousness, as I see more and more articles and talks discussing what they are, what they are good for, and how to make them.",
    "url": "https://www.broken-links.com/2015/01/27/best-practice-creating-custom-elements/"
  },
  {
    "name": "Web Components and their role in the future of web development A discussion surrounding the history and future of Web Components in modern web development.",
    "url": "http://kaytcat.github.io/web-components/"
  },
  {
    "name": "Using Polymer to Create Web Components To bridge the gap and give developers access to this rich functionality now, Google has created the Polymer library which serves as a set of polyfills to bring the promise of Web Components to you today.",
    "url": "http://code.tutsplus.com/tutorials/using-polymer-to-create-web-components--cms-20475"
  },
  {
    "name": "Custom Elements defining new elements in HTML",
    "url": "http://www.html5rocks.com/en/tutorials/webcomponents/customelements/"
  },
  {
    "name": "Exploring HTML Imports Web Components have come a long way in the past few months. HTML Imports allow you to load additional documents into your page without having to write a bunch of ajax. This is great for Custom Elements where you might want to import a suite of new tags.",
    "url": "http://robdodson.me/exploring-html-imports/"
  },
  {
    "name": "A No-Nonsense Guide to Web Components A multi-part series with a crash course on Web Components specs, polyfills, performance, accessibility, and more.",
    "url": "http://cbateman.com/blog/a-no-nonsense-guide-to-web-components-part-1-the-specs/"
  },
  {
    "name": "React and Custom Elements Component Interop with React and Custom Elements",
    "url": "http://addyosmani.com/blog/component-interop-with-react-and-custom-elements/"
  },
  {
    "name": "Interop Sass A demo of interoperability between Sass and Polymer.",
    "url": "https://github.com/webcomponents/sass-interop"
  },
  {
    "name": "Interop Less A demo of interoperability between Less and Polymer.",
    "url": "https://github.com/webcomponents/less-interop"
  },
  {
    "name": "Interop Angular A demo of interoperability between Polymer and AngularJs.",
    "url": "https://github.com/webcomponents/angular-interop"
  },
  {
    "name": "Custom Element Interoperability Using Polymer, X-Tag, and Vanilla Custom Elements",
    "url": "https://www.polymer-project.org/articles/polymer-xtag-vanilla.html"
  },
  {
    "name": "Generator Elements A Yeoman Generator that provides a functional boilerplate to easily create Custom Elements using Polymer, X-Tag or VanillaJS.",
    "url": "https://github.com/webcomponents/generator-element"
  },
  {
    "name": "Generator Polymer Yeoman generator for scaffolding Polymer apps",
    "url": "https://github.com/yeoman/generator-polymer/"
  },
  {
    "name": "Geneator X-Tag X-Tag generator for Yeoman",
    "url": "https://github.com/x-tag/yo-x-tag-generator"
  },
  {
    "name": "Generator Bosonic Yeoman Generator Bosonic",
    "url": "https://github.com/bosonic-labs/yeoman-bosonic"
  },
  {
    "name": "Slush Element A Slush Generator that provides a functional boilerplate to easily create Custom Elements using Polymer, X-Tag or VanillaJS.",
    "url": "https://github.com/webcomponents/slush-element"
  },
  {
    "name": "Seed-Element Polymer element boilerplate Tests",
    "url": "https://github.com/PolymerElements/seed-element"
  },
  {
    "name": "Web Component Tester web-component-tester makes testing your web components a breeze!",
    "url": "https://github.com/Polymer/web-component-tester"
  },
  {
    "name": "Bower search Bower search Web Components",
    "url": "http://bower.io/search/?q=web-components"
  },
  {
    "name": "Built Polymer Built with Polymer",
    "url": "http://builtwithpolymer.org/"
  },
  {
    "name": "Components Kitchen The best ingredients for your web apps",
    "url": "https://component.kitchen/"
  },
  {
    "name": "Custom Elements a web components gallery for modern web apps",
    "url": "https://customelements.io/"
  },
  {
    "name": "Polymer Tools Designer Designer is a drag and drop tool for prototyping apps using Polymer. Save your experiments as Github gists.",
    "url": "https://www.polymer-project.org/tools/designer/"
  },
  {
    "name": "Web Components best practices Web Components (WC) are a new set of web platform features that enable developers to build applications in a declarative, composable way.",
    "url": "http://webcomponents.org/articles/web-components-best-practices/"
  },
  {
    "name": "How should I name my element? Naming is always a challenging task when developing a component. We can create truly complex pieces of code but we still have a hard time to name a simple variable.",
    "url": "http://webcomponents.org/articles/how-should-i-name-my-element/"
  },
  {
    "name": "WEB COMPONENTS AND YOU – DANGERS TO AVOID Web Components are a hot topic now. Creating widgets on the web that are part of the browser’s rendering flow is amazing.",
    "url": "https://www.christianheilmann.com/2014/04/18/web-components-and-you-dangers-to-avoid/"
  },
  {
    "name": "Melhores Práticas Web Components PT-br Conheça práticas simples que podem ajudar na organização do seu web component.",
    "url": "http://tableless.com.br/melhores-praticas-web-components/"
  },
  {
    "name": "The Web’s Declarative, Composable Future This year, the platform is getting Web Components, bringing forward a way to make the relationships between markup and behaviour a lot less vague when you’re looking at the HTML.",
    "url": "http://addyosmani.com/blog/the-webs-declarative-composable-future/"
  },
  {
    "name": "Google Web Components Style Guide This guide serves as an extension to the Google JavaScript Style Guide with additional style guidance around authoring Web Components, particuarly those in this element collection. It is targeted at Google engineers, but may be useful for others too.",
    "url": "https://github.com/GoogleWebComponents/style-guide"
  },
  {
    "name": "High Performance Web Components HTML5DevConf May 2014: Steve Souders, Fastly : High Performance Web Components",
    "url": "https://www.youtube.com/watch?v=m3EPIeKaDCU"
  },
  {
    "name": "Polymer Polymer is a new type of library for the web, built on top of Web Components, and designed to leverage the evolving web platform on modern browsers.",
    "url": "https://www.polymer-project.org/"
  },
  {
    "name": "X-Tag X-Tag is a small JavaScript library, created and supported by Mozilla, that brings Web Components Custom Element capabilities to all modern browsers.",
    "url": "https://x-tag.readme.io/"
  },
  {
    "name": "Bosonic Bosonic is a set of tools that enable you to build Web Components as the spec currently describes, and supporting not-so-modern browsers like IE9.",
    "url": "http://bosonic.github.io/"
  },
  {
    "name": "Polymer Dart Polymer.dart is a Dart port of Polymer. Build Web Components with Dart, and interoperate with Web Components built with JavaScript.",
    "url": "https://www.dartlang.org/polymer/"
  },
  {
    "name": "Skate Skate is a web component library that is focused on being a tiny, performant, syntactic-sugar for binding behaviour to custom and existing elements without ever having to worry about when your element is inserted into the DOM.",
    "url": "https://github.com/skatejs/skatejs"
  },
  {
    "name": "Setting up Bower and Polymer I wanted to show how easy it is to get Bower and Polymer setup.",
    "url": "https://www.youtube.com/watch?v=WX6Hbi-xSUI"
  },
  {
    "name": "YOLOmer! Polymer and Yeoman for lighting fast dev 'Allo! Rob Dodson here, your host on this tour of the new Polymer generator for Yeoman.",
    "url": "https://www.youtube.com/watch?v=INH_OW4lFSs"
  },
  {
    "name": "Introducing the Polymer Designer tool We're really excited to show off our new Designer tool, which makes building prototypes with Polymer super easy. In this video I'll walk you through the basics of creating a simple maps app, and along the way we'll touch on some of the interesting features that Designer brings to the table.",
    "url": "https://www.youtube.com/watch?v=djQh8XKRzRg"
  },
  {
    "name": "Ferramenta Polymer Designer PT-br Introdução sobre Polymer Tools Designer ferramenta de prototype de web components.",
    "url": "https://www.youtube.com/watch?v=yKR3VO0NF3Y&list=UU5f2WvUyrAkoktfiIuu7a-A"
  },
  {
    "name": "Configurando Bower e Polymer PT-br mostrando como é fácil começar a instalação do Bower e do Polymer",
    "url": "https://www.youtube.com/watch?v=owT5n9jlzVI&list=UU5f2WvUyrAkoktfiIuu7a-A"
  },
  {
    "name": "Are We Componentized Yet? Tracking the progress of Web Components through standardisation, polyfillification, and implementation.",
    "url": "http://jonrimmer.github.io/are-we-componentized-yet/"
  },
  {
    "name": "Vulcanize Concatenate a set of Web Components into one file",
    "url": "https://github.com/polymer/vulcanize"
  },
  {
    "name": "Polymer Boilerplate A bare minimum custom element starter-kit using Polymer.",
    "url": "https://github.com/webcomponents/polymer-boilerplate"
  },
  {
    "name": "X-Tag Boilerplate A bare minimum custom element starter-kit using X-Tag.",
    "url": "https://github.com/webcomponents/xtag-boilerplate"
  },
  {
    "name": "VanillaJS Boilerplate A bare minimum custom element starter-kit using VanillaJS.",
    "url": "https://github.com/webcomponents/element-boilerplate"
  }
]
